[{"page": 73, "question0": ["  Tarun Bajaj, the 1988 batch IAS officer has  been given charge of the _____________ Secretary  of the country", "   Economic Affairs "], "question1": ["  Which p opular TV serial has created the   world  record of highest viewed entertainment  programme globally", "    Ramayan       "], "question2": ["  Name the   l egendary Footballer, captain of the  gold medal winning team of   Jakarta Asiad, who  died in Kolkata after prolonged illness.   Chuni  Goswami "], "question3": ["  Order of Rising Sun is one  of the highest civilian  honour of which country", "    Japan "], "question4": ["  Pradhan Mantri Jan Arogya Yojana offers a  health insurance cover of how much amount to  eligible families", "    Rs 5 lakh "], "question5": ["  J. Arunkumar, former Karnataka cricketer, has  been appointed the head coach of wh ich  country™s national cricket team", "    USA "], "question6": ["  The Asian Development Bank has approved a $  346 million loan to Maharashtra for what  purpose", "    To provide reliable power  connections in rural areas of the state "], "question7": ["  What is another popular name for the   Labour  Day / I nternational Workers™ Day observed on  May 1", "    May Day "], "question8": ["  According to a recent report titled ‚The Global  Report on Internal Displacement (GRID 2020)™,  which country suffered largest number of  displacements in 2019", "    India  "], "question9": ["  Which apex organisation   launched  the Kisan  Sabha App to connect farmers to the supply  chain and freight transportation management  system", "    CSIR  "], "question10": ["  What is the full form of CSIR", "   Council of  Scientific and Industrial Research  "], "question11": ["  The   Council of Scientific and Industrial  Research is based in whic h city", "    New Delhi  "], "question12": ["  A faculty member at IIT Madras Prof. T.  Pradeep has won the Nikkei Asia Prize for  which achievement", "    For his pioneering work  in nanotechnology - based water purification  "], "question13": ["  Nikkei Asia Prize is given by Nikkei  Œ   the  biggest media group of  ____________.    Japan  "], "question14": ["  The Open budget survey conducted by the  International Budget Partnership (IBP) has  placed India at     ____     position among 117  nations", "    53 rd  "], "question15": ["  Which country   was ranked on top in terms of  budget transparency", "    New Zealand  "], "question16": ["  Which global d ay is observed on May 3 to   pay  gratitude to those journalists who lost their  lives in order to bring us honest and real news", "    World Press Freedom Day  "], "question17": ["  What is the theme of this year™s World Press  Freedom Day", "     \"Journalism without Fear or  Favour.\"  "], "question18": ["  Hafthor   Bjornsson set a new world record for  the deadlift on May 2 when he lifted 1,104  pounds (501 kg). He is from which  Country", "   Iceland  "], "question19": ["  World Tuna Day is observed on which  date", "    May 2  "], "question20": ["  Tuna is a popular fish food of which  country", "    Almost all countries  "], "question21": ["  Dr.  Shobhana Narasimhan, a noted Indian  scientist has been given which international  honour recently", "   Elected as an International  Honorary Member to the American  Academy of Arts and Science  "], "question22": ["  WHO supports the celebrations of Hand  Hygiene Day on which date", "     May   05  "], "question23": ["  What is the theme of this year™s Hand Hygiene  Day", "    Save lives", " Clean your hands  "], "question24": ["  Which international NGO supports the  celebration of World Asthma Day", "   Global  Initiative for Asthma  "], "question25": ["  Which flower product produced in the Kashmi"]}, {"page": 74, "question0": ["  What is the name of the   Ultraviolet (UV)  disinfection tower developed by the DRDO for  the chemical - free and rapid disinfection of high  infection - prone areas", "   UV Blaster  "], "question1": ["  The government launched which mission to  operate 64 flights  from May 7 to 13 to bring  home thousands of Indian nationals stranded  abroad due to the coronavirus  lockdown", "   Vande Bharat Mission  "], "question2": ["  Three photojournalists from which Indian state  won the Pulitzer Prize for feature  photography", "   Jammu and Kashmir  "], "question3": ["  Mustafa al - Kadhimi has been elected as the  new   Prime Minister of which country by its  Parliament", "     Iraq  "], "question4": ["  Marcus Wallenberg Prize is awarded for  outstanding achievement in which field", "   For  contribution in the field of forestry and  forest industries  "], "question5": ["  Which Arabian cou ntry recently changed its  currency from Rial to Toman to counter the  hyperinflation", "    Iran  "], "question6": ["  This year™s World Athletics Day was observed  on which date", "    May 7  "], "question7": ["  What is the new name adopted by  the   International Amateur Athletic Federation  for itself", "    World   Athletics  "], "question8": ["  AIIB   signed a _____ million dollar ﬁCOVID - 19  Emergency Response and Health Systems  Preparedness Projectﬂ in New Delhi  to   strengthen public health preparedness in  India", "    500  "], "question9": ["  What is the full form of AIIB", "    Asian  Infrastructure Investment Bank  "], "question10": ["  Where are the headquarters of AIIB located", "     Beijing  "], "question11": ["  The Border Roads Organisation successfully  completed road connectivity from Dharchula to  __________ , famously known as Kailash - Mansarovar Yatra Route", "     Lipulekh  "], "question12": ["  On which Sunday of May the world cele brated  the Mother™s Day", "   Second  "], "question13": ["  What is the other popular name for the Vesak  Day", "    Buddha Jayanti, Buddha Purnima  "], "question14": ["  On which auspicious day the Buddhists across  the world celebrate the Vesak Day", "    On the  first   full moon day of May  "], "question15": ["  World Red Cross Day is c elebrated on which  day of May", "   8 th  "], "question16": ["  World Red Cross Day commemorates the birth  anniversary of which great person", "     Henri  Dunant  "], "question17": ["  Who was Henri Dunant", "    Founder  of   International Committee of the Red Cross  in 1863 in Geneva, Switzerland  "], "question18": ["  The Thalassaemia  disease is related to which  part/function of human body", "     It™s a type of  blood disorder  "], "question19": ["  What happens to a person suffering from  Thalassaemia", " Reduction in red blood cells  "], "question20": ["  Which international NGO supports the  celebration of the   World Thalassaemia  Day", "    Thalassaemia International  Federation, Geneva  "], "question21": ["  World Thalassaemia Day is observed every  year on which date", "    May 8  "], "question22": ["  Which Indian telecom major recently received  foreign investment worth Rs. 11,367 crore  from   US - based private equity firm Vista Equity  Partne rs", "    Jio Platforms of Reliance  Industriees  "], "question23": ["  Rob Gibbs, 55 year old veteran animation  director, story artist and writer from USA was  in news recently for what reason", "   He passed  away  "], "question24": ["  Rob Gibbs was associated with which famous  studios for over 20 years", "    Pix ar Animation  Studios, California, USA  "], "question25": ["  Name the Congress leader in Lok Sabha has  been reappointed chairperson of the  Parliament™s public accounts committee (PAC)", "  Adhir Ranjan Chowdhury  "], "question26": ["  Who is the appointing authority for  the   chairperson of the PAC", "  Speaker of the  Lok Sabha  "], "question27": ["  PAC comprises of not more than 22 MPs, ___  from Lok Sabha and ___ from Rajya Sabha", "     15;     7  "], "question28": ["  What is the primary function of the PAC", "     To  keep a check on government expenditure b"]}, {"page": 75, "question0": ["  Which natio nal day is celebrated to  commemorate the day on which India  successfully test - fired its first nuclear bombs in  1998", "     National Technology Day  "], "question1": ["  What was the code name for the   successful  test - firing of India™s first nuclear bombs in  1998", "    ﬁOperation Shakti ﬂ in Pokhran,  Rajasthan  "], "question2": ["  What was the code name for the India™s  first   successful nuclear test conducted in  1974", "    Smiling Buddha  "], "question3": ["  International Nurses Day is observed on which  date", "    May 12  "], "question4": ["  International Nurses Day commemorates the  birth day of which lege ndary British social  reformer", "   Florence Nightingale  "], "question5": ["  Florence Nightingale was popularly known  with which nick name", "     Lady with the Lamp  "], "question6": ["  Olive Ridley is a popular species of which  animal", "     Turtles  "], "question7": ["  Which Indian state is known for its famous  turtle  rookeries in Gahirmatha and  Rushikulya ", "     Odisha  "], "question8": ["  India had launched Mission Sagar on May 10 to  provide assistance to ______ island nations of  Eastern Indian Ocean Region amid the ongoing  COVID - 19 crisis", "    Five  "], "question9": ["  The United Nations Postal Administration  (UNP A) and the ________________ jointly launched  a postal stamp to mark the 40th Anniversary of  Smallpox Eradication on May 8", "    World Health  Organisation (WHO)  "], "question10": ["  The Ministry of MSMEs (Micro, Small and  Medium Enterprises) launched which portal to  assist Indian  MSMEs in becoming national and  global champions", "    CHAMPIONS  "], "question11": ["  The Supreme Court has ruled that all __________  banks in the country can also make use of the  SARFAESI Act to make recovery from  defaulting borrowers", "    Co - operative  "], "question12": ["  The SARFAESI Act was passed  in which  year", "    2002  "], "question13": ["  The SARFAESI Act empowered bankers for the  first time for what action", "   To seize the assets  of defaulting borrowers, directly, without  going to the court  "], "question14": ["  Name the Indian who is the President of  International Hockey Federation, Lausann e,  Switzerland", "    Narinder Batra  "], "question15": ["  Which state launched the country's first ever  ‚FIR Aapke Dwar Yojana™", "    Madhya Pradesh  "], "question16": ["  The Kempegowda International Airport of  which city   has won this year™s SKYTRAX Award  for Best Regional Airport in India and Central  Asi a", "    Bengaluru  "], "question17": ["  Which country has named a street in its biggest  city, after celebrated Indian poet Rabindranath  Tagore", "    Israel, in Tel Aviv  "], "question18": ["  Name the senior para - athlete who announced  her retirement from Paralympics games in  order to serve as the office - be arer in the  Paralympic Committee of India", "    Deepa Malik  "], "question19": ["  The Prime Minister announced a stimulus  packages on May 13,   amounting to 20 lakh  crore rupees under which banner", "   Atma - Nirbhar Bharat Abhiyan (Self Reliant India  Mission)  "], "question20": ["  ___________ has become the  first Indian state to  regulate the cultivation of crops in the  state", "    Telangana  "], "question21": ["  The BRICS™s New Development Bank has  decided to provide $ 1 billion emergency  assistance loan to India for what purpose", "    To  support its efforts to combat the  coronavirus pan demic  "], "question22": ["  What is India™s rank in the recently released  Global Energy Transition Index compiled by the  World Economic Forum", "    74 th  "], "question23": ["  Which country secured the first rank in the  Global Energy Transition Index", "   Sweden  "], "question24": ["  Which ministry has decided that from June  01,  2020, all the dry canteens of the Central Armed  Police Forces (CAPF) will sell only indigenous  products", "   Home Ministry  "], "question25": ["  Name the Indian media personality who has  been selected for one of the 17 Deutsche Welle  Freedom of Speech Awards", "   Siddharth  Varadar ajan  "], "question26": ["  Siddharth Varadarajan is associated with which  digital news platform", "    The Wire  "], "question27": ["  Name the   Odisha cadre IAS officer   who ha"]}, {"page": 76, "question0": ["  With the support of the UNO,   which day is  celebrated across the world on May 15 to  highlight the importance of families in  strengthening the social fabric all over the  world", "    International Family Day  "], "question1": ["  What is the theme of this year™s International  Family Day", "    Families in Developmen t  "], "question2": ["  Which union ministry promotes the celebration  of the National Dengue Day", "    Ministry of  Health and Family Welfare  "], "question3": ["  Who is the present   Minister of Health and  Family Welfare in India", "   Dr Harsh Vardhan  "], "question4": ["  Dengue is a viral disease, transmitted by the  infectiv e bite of which mosquito", "   Aedes  Aegypti  "], "question5": ["  The government plans to launch a 20,000 crore  rupees scheme for the development of marine  and inland fisheries. What is its  name", "   Pradhan Mantri Matsya Sampada  Yojana  "], "question6": ["  Celebrations of the   International   Day of Living   Together in Peace are supported by which  international organisation", "    United Nations  "], "question7": ["  The   International   Day of Living Together in  Peace is observed in May on which day", "    16 th  "], "question8": ["  The government plans to launch a 20,000 crore  rupees scheme for the development   of marine  and inland fisheries.   What is its  name", "    Pradhan Mantri Matsya Sampada  Yojanaﬂ   (Prime Minister Fisheries Wealth  Scheme)   APRIL 2020  "], "question9": ["  Name the oldest Grand Slam tennis tournament  that has been scrapped for the first time since  World War II due to havoc of Corona.   Wimbledon, London  "], "question10": ["  The Union cabinet has approved a _____ percent  cut in the salaries of the Members   of Parliament  for one ye ar wef April 1 this year.   30%  "], "question11": ["  The Union cabinet has decided to  suspend  MPLADS funds for two years from 2020 - 21 to  2022.     What is the full form of MPLADS", "   Member of Parliament Local Area  Development Scheme  "], "question12": ["  Every MP gets how much funds every year  under t he MPLADS", "   Rs 5 crore  "], "question13": ["  The Central Board of Secondary Education  (CBSE) has decided to introduce three new  subjects for class 11 from 2020 - 21 academic  session. Name these subjects.  Design  Thinking, Physical Activity Trainer and  Artificial Intelligence  "], "question14": ["  Which global agency has approved a fast - track  $1 billion support for ﬁIndia Covid Emergency  Response and Health Systems Preparedness  Projectﬂ", "   The World Bank  "], "question15": ["  The Great Barrier Reef, the world™s largest coral  reef system has suffered its worst mass coral  bleaching in recent years. Where is it located", "   In the sea around northeast Australia   "], "question16": ["  Name the FIFA event that was to be held in  India in November this year, which has been   postponed by FIFA due to the worsening  COVID - 19 pandemic across the globe.   The  F IFA Under - 17 Women™s World Cup   "], "question17": ["  The New Delhi _________ World Cup , which had  already been postponed from March to May,  has now been cancelled due to the Covid - 19  pandemic.   Shooting   "], "question18": ["  The Central Government has approved a  double - digit hike in the wages of manual  labourers under MNREGA. The letter G stands  for what", "  Guarantee    "], "question19": ["  The World Health Day is celebrated around the  globe on which date", "   April 07   "], "question20": ["  What is the name of the main mobi le app  launched for tracking and fighting COVID - 19,  launched by the Central Government", "   ‚Aarogya Setu™   "], "question21": ["  Name the British cricketer who co - invented the  Duckworth - Lewis Method, who died on April 1  at the age of   78.    Tony Lewis   "], "question22": ["  Who has been appointed the new Chairman of  the National Association of Software and  Services Companies (Nasscom)", "   Pravin Rao   "], "question23": ["  The  World Homoeopathy Day   is observed on  which date", "  April 10   "], "question24": ["  Who is known as the father of the   Homoeopathic system of medicines ", "    Dr"]}, {"page": 77, "question0": ["  India celebrates   National Safe Motherhood Day  on April 11. This day also commemorates the  birth day of which great Indian lady social  worker", "   Kasturba Gandhi   "], "question1": ["  Which organisation supports the celebration of  the  National Safe Moth erhood Day", "   White  Ribbon Alliance India   "], "question2": ["  Indian football team retained its ______ spot in  the latest FIFA rankings.   108 th   "], "question3": ["  Which ministry launched Bharat Padhe Online  campaign on April 11 to crowdsource ideas for  improving the online education ecosystem of  India", "    The Union Ministry of Human  Resources Development   "], "question4": ["  These days we hear a lot about providing PPEs  to doctors and m edical staff. What is full form  of PPE", "    Personal Protection Equipment   "], "question5": ["  Which funding agency has   has assured $2.2  billion (about Rs 16,500 crore) support to India  in its fight against the Covid - 19 pandemic", "   The  Asian Development Bank   "], "question6": ["  Name the England™s a ll - rounder who has been  named the leading cricketer in the world     2020  by Wisden.   Ben Stokes   "], "question7": ["  Which national day is celebrated to  commemorate the sailing of first Indian ship  from Mumbai to London", "    National Maritime  Day, April 5   "], "question8": ["  Which global day is  observed on April 2 to   highlight the need to improve the quality of life  of those suffering with Autism", "   World Autism  Awareness Day   "], "question9": ["  The Indian Air Force conducted ‚Operation  Sanjeevani™ to air - lift 6.2 tonnes of essential  medical supplies to which countr y", "   Maldives   "], "question10": ["  The Olympic Council of Asia unveiled the  official mascots of the 19th Asian Games - 2022.  Which city will host these games", "   Hangzhou,  China   "], "question11": ["  Name the three animated robots selected as the  mascots for the 19th Asian Games - 2022", "   Congcong,  Lianlian and Chenchen   "], "question12": ["  What is the single name given to the three  mascots of 19th Asian Games - 2022", "    The  Smart Triplets   "], "question13": ["  Who is the Chief of the Indian Air Force", "   Air  Chief   Marshal Rakesh Kumar Singh  Bhadauria   "], "question14": ["  In which state Baisakhi is celebrated as  Naba  Barsha", "    West Bengal   "], "question15": ["  Vishu is a famous festival of which state", "    Kerala   "], "question16": ["  In Tamil Nadu festival of Baisakhi is celebrated  by which name", "   Puthandu   "], "question17": ["  Which country has approved the sale of  Harpoon Block II air launched missiles and  lightweight torpedoes worth $155 million to  India.   USA   "], "question18": ["  What kind of weapon is a Torpedo", "    A guided  missile usually fired from a submarine   "], "question19": ["  M S Mahabaleshwara has been   re - ap pointed as  the   MD and CEO of which private sector", "   Karnataka Bank   "], "question20": ["  World Art Day is celebrated with support from  UNESCO on which day of April", "    15 th   "], "question21": ["  Which country has decided to stop funding for  the World Health Organization (WHO),  accusing it of grossly mismanaging and  covering - up the spread of the novel  coronavirus", "   USA   "], "question22": ["  Reserve Bank of India on April 17 announced  several regulatory measures aimed a t boosting  liquidity in the market. It slashed which policy  rate by 25 basis points", "   Reverse Repo Rate   "], "question23": ["  RBI announced a booster package of 50,000  crore rupees for supporting which sector of  economy to recover from the lockdown", "  Small  and Medium - sized indu stries    "], "question24": ["  The RBI Governor declared that the period of  resolution plan for NPAs will be extended by  ____ days", "   90   "], "question25": ["  An Integrated Geospatial Platform named  _________has been rolled out by the Deptt. of  Science and Technology, Govt. of India, to help  in deci sion making during the present COVID - 19 outbreak.    SAHYOG   "], "question26": ["  The WWF (World Wide Fund) India has  appointed veteran world chess champion  ___________ as its ambassador for the  environmental education program.   Viswanathan Anand"]}, {"page": 78, "question0": ["  World Hemophilia Day is observ ed on April 17  across the world. Hemophilia is related to  which ailment", "  B leeding disorders   "], "question1": ["  Fei Fei the bird has been unveiled as the mascot  for which Asian Para Games", "   Hangzhou  (China) 2022 Asian Para Games   "], "question2": ["  World Heritage Day is observed on which date", "   April 18     "], "question3": ["  What is the name of the mobile app launched to  facilitate transportation of food grains and  perishables like fruits and vegetables, during  lockdown", "   Kissan Rath   "], "question4": ["  Which Indian two wheeler company ha s  acquired   the United Kingdom™s most iconic  sporting motorcycle brand ‚Norton™", "   TVS  Motors   "], "question5": ["  Name the world's most famous cycling race,  held every year in France, which has been  postponed in the wake of the Coronavirus  pandemic.   Tour de France   "], "question6": ["  April 19 i s celebrated around the world to  promote awareness about one of the most  complex organ in the body. Can you name it", "    Liver   "], "question7": ["  Which great Indian statesman termed civil  servants as the ‚steel frame of India™", "    Sardar  Vallabhbhai Patel   "], "question8": ["  Which International da y is observed on April  22 to create awareness about pollution and to  celebrate the environment of our planet", "   The  Earth Day   "], "question9": ["  Social media and tech giant Facebook invested  Rs 43,574 crore for securing a 9.99 per cent  stake in which Indian company", "    Jio  Platforms   "], "question10": ["  ______________ became the first state on April 19  to geo - tag community kitchens being run in the  state.   Uttar Pradesh   "], "question11": ["  Name the creator of most popular animation  characters Tom and Jerry, Popeye the Sailor,  who passed away at the age of 95 at his  residence in Prague, Czechoslovakia.   Gene  Deitch   "], "question12": ["  Kapil Dev Tripathi has been a ppointed as the  new Secretary to which apex auth ority", "   President of India   "], "question13": ["  Which bank has rolled out a new feature of  voice banking services on Amazon Alexa and  Google Assistant for its customers", "   ICICI Bank   "], "question14": ["  HRD Ministry launched the national program  named _________ for inviting e - learning content  co ntributions for both school and higher  education.   VidyaDaan 2.0   "], "question15": ["  April 23 is observed globally every year as  English Language Day to mark the birthday and  date of death of which legendary writer", "    William Shakespeare   "], "question16": ["  The UNESCO has selected which city as the  World Book Capital for 2020.   Kuala Lumpur,  Malaysia   "], "question17": ["  National Panchayati Raj Day is celebrated on  which date", "   April 24   "], "question18": ["  Which amendment of Indian Constitution  introduced the Panchayati Raj Act in 1993", "   73 rd   amendment   "], "question19": ["  The Prime Minister launched which two major  schemes for rural areas on April 24", "  e - Gram  Swaraj Portal and Swamitva   "], "question20": ["  The World Bank   has approved $82 million for  the State Roads Transformation Project of  which state for upgradation of major roads and  modernization of the Public Works Department  in the state", "   Himachal Pradesh   "], "question21": ["  Name the eminent theatre personality who  died at her residen ce in south Kolkata on April  23, at the age of 75.   Usha Ganguly   "], "question22": ["  The Global Press Freedom Index has ranked  India at which spot", "   142 nd   "], "question23": ["  Which country topped the the Global Press  Freedom Index", "   Norway   "], "question24": ["  Which institution has claimed to have  developed a pot ential COVID - 19 vaccine, the  first human trials of which began on April 23,  2020", "   Oxford University, London   "], "question25": ["  Who has been appointed as the new Chief  Vigilance Commissioner of India", "      Sanjay  Kothari   "], "question26": ["  Which international day is celebrated on April  25 to  raise awareness about a globally present  disease", "    World Malaria Day   "], "question27": ["  Malaria is a life - threatening disease which is  caused by ________ Parasites.   Plasmodium   "], "question28": ["  The Plasmodium parasite is spread by whic"]}, {"page": 79, "question0": ["  What is the them e for this year™s World Malaria  Day", "   Zero malaria starts with me   "], "question1": ["  Government has declared banking industry as a  public utility service for six months till October  21 under the provisions of which Act", "  Industrial Disputes Act, 1947   "], "question2": ["  __________ has become the first state to have the  requisite infrastructure in all its courts for  hearing cases through video conferencing.   Uttar Pradesh   "], "question3": ["  Which country successfully launched its first - ever military satellite named ﬁNoorﬂ into orbit", "   Iran   "], "question4": ["  According to a Swedish research institute,  Stockholm International Peace Research  Institute (SIPRI), India is the ____ biggest  spender on military hardware.   Third   "], "question5": ["  As per SIPRI report, ___________ is the biggest  spender of military expenditure.   USA   "], "question6": ["  Which country has declared an end to the death  penalty for crimes committed by minors", "   Saudi Arabia   "], "question7": ["  The Reserve Bank announced on April 27 a  Special Liquidity Facility of Rs 50,000 crore for  which sector of economy", "   Mutual funds   "], "question8": ["  World Day for Safety an d Health at Work is  observed on which day", "   April 28   "], "question9": ["  Which UN agency supports the celebrations of  the World Day for Safety and Health at Work", "   International Labour Organization (ILO)   "], "question10": ["  The BRICS Ministers of Foreign Affairs summit  was held through a video   conference on April  28, 2020.  It was hosted by which country", "   Russia   "], "question11": ["  What is the full form of the UN special agency  WIPO", "   World Intellectual Property Office,  Geneva   "], "question12": ["  What is the theme of this year™s  World  Intellectual Property Day", "   Innovate for a  Green Future   "], "question13": ["  Who has been appointed as the next  Ambassador / Permanent Representative of  India to the United Nations", "   T S Tirumurti   "], "question14": ["  The International Dance Day is celebrated on  which day of April", "   29 th   "], "question15": ["  The 11th session of Petersburg Climate  Dialogue with 30 countries including India was  hosted by which country", "   Germany   "], "question16": ["  Who represented India at the 11th session of  Petersburg Climate Dialogue", "   Prakash  Javadekar, the Union Minister for  Environment, Fores t and Climate Change   "], "question17": ["  Name the veteran Bollywood actor who passed  away on Apri 30, losing his battle against  Leukemia.   Rishi Kapoor     MARCH 2020   "], "question18": ["  The Central government approved Rs 1,340  crore recapitalisation plan to help which type  of banks", "  Regional  Rural Banks (RRBs)   "], "question19": ["  Govt has planned recapitalization of RRBs to  meet the CRAR requirements. What is full form  of CRAR", "  Capital to Risk weighted Assets  Ratio   "], "question20": ["  What is the percentage of stake of the  sponsoring bank in the capital of the RRB", "   35%   "], "question21": ["  What is the percentage of stake of the central  government in the capital of the RRB", "  50%   "], "question22": ["  Rajyogini Dadi Janki, who passed away  recently,   was the spiritual head of which world  famous spiritual organisation", "  Brahma  Kumaris Sansthan   "], "question23": ["  The World Theatre Day is   observed on which  day of March", "   23 rd   "], "question24": ["  Which US defence force   deployed its Advanced  Extremely High Frequency (AEHF) satellite to  provide secure communications for the US  military and its allies", "   US Space Force   "], "question25": ["  Government announced the ‚Garib Kalyan  Packa ge™ for helping the poor people amidst the  Corona crisis.  What is its amount", "   Rs. 1.70  lakh crore   "], "question26": ["  Under which new government scheme 80 crore  poor people will be given 5 kg Wheat or 5  kg   Rice and one kg pulse for 3 months", "   Pradhan Mantri Garib Kalyan An na Yojana   "], "question27": ["    Government has announced Rs.____ lakh per  person insurance cover for all employees  working in the medical field for next three  months.   50   "], "question28": ["  Indian scientists have developed ‚MACS 4028™,  a biofortified high - protein variety of whic"]}, {"page": 80, "question0": ["  Which country hosted the firstever G - 20 virtual  summit through video conference", "   Saudi  Arabia   "], "question1": ["  Name the doe - eyed star of 1950s and ‚60s  Hindi movies such as  Aan, Barsaat and Deedar,   who died recently after prolonged illness.   Nimmi   "], "question2": ["  Name the artist and ar chitect renowned for his  versatility across different mediums, who  passed away recently in New Delhi.   Satish  Gujral   "], "question3": ["  Which global rating agency slashed its estimate  of India's GDP growth during the 2020 calendar  year to 2.5 per cent, from an earlier estimate of  5.3 per cent", "   Moody's Investors Service    "], "question4": ["  The Monetary Policy Committee of RBI headed  by its Governor Shaktika nta Das announced on  March 27 a cut in benchmark interest rate,  Repo Rate by _____ basis points to 4.40 per cent.   75   "], "question5": ["  RBI   reduced the Cash Reserve Ratio (CRR) of all  banks by ______ basis points to 3 per cent with  effect from March 28 for 1 year.   100   "], "question6": ["  Wh at is the new reverse repo rate under the  LAF after a reduction of 90 basis points", "   4%   "], "question7": ["  Which oil company has become the 1st Indian  company to begin supply of BS - VI fuel across its  28,000 petrol pumps", "   Indian Oil Corporation  Ltd.   "], "question8": ["  The Reserve Bank of Ind ia has decided to  extend the _________  _______ classification for  bank loans to Non - Banking Financial  Companies (NBFCs) for on - lending, for FY  2020 - 21.   Priority sector   "], "question9": ["  Which State Police has become the first to be  equipped with taser guns as a part of t heir  modernization drive to ensure public safety  and security", "   Gujarat   "], "question10": ["  Which gas is used in the Taser guns to fire the  darts", "    Compressed Nitrogen   "], "question11": ["  Famous ‚Abel Prize™ is given for outstanding  achievement in which field", "    Mathematics   "], "question12": ["  Government of which   country has instituted  the Abel Prize", "    Norway   "], "question13": ["  Japan's Prime Minister and the head of the  International Olympic Committee, Shinzo Abe  announced to postpone the Tokyo 2020 Games  by how many months", "   12   "], "question14": ["  In the 124 - year old history of the Olympics, the  games have been cancelled how many times", "   Three   "], "question15": ["  World Tuberculosis Day is observed on which  day of March", "   24   "], "question16": ["  World Tuberculosis Day is observed with the  support of which UN organisation", "  WHO  Œ   World Healt h Organisation   "], "question17": ["  What is the theme for this year™s   World  Tuberculosis Day", "  It™s Time   "], "question18": ["  Name the scientist who discovered the  Tuberculosis causing bacteria", "    Dr. Robert  Koch      "], "question19": ["  Name the Indian mountaineer who entered  ‚Limca Book of Records™ for his extraordi nary  achievement of becoming the first Indian to  climb the highest volcanoes of each of the 7  continents.   Satyarup Siddhanta   "], "question20": ["  Who took the oath of Chief Minister for the  fourth time in Madhya Pradesh", "    Shivraj Singh  Chouhan   "], "question21": ["  M arch 23 is celebrated as  Shaheed Diwas   every  year to pay tribute to which three martyrs", "  Bhagat Singh, Sukhdev Thapar, and  Shivaram Rajguru   "], "question22": ["  World Meteorological Day is observed on  March 23 to highlight which important issue", "   Climate related issues   "], "question23": ["  What is the theme for this yea r™s World Water  Day", "    Water and climate change   "], "question24": ["  On which day of March we celebrate  World  Water Day", "   March 22   "], "question25": ["  For what purpose Small Industries  Development Bank of India (SIDBI) plans to  start Swavalamban Express on June 05, 2020", "   To promote budding busi ness aspirants and  entrepreneurs   "], "question26": ["  Where are the headquarters of   Small Industries  Development Bank of India (SIDBI)", "   Lucknow   "], "question27": ["  Who is the current Charman & Managing  Director of SIDBI", "   Mohmmad Mustafa   "], "question28": ["  When do we celebrate  the International Day for  the Elimination of Racial Discrimination", ""]}, {"page": 81, "question0": ["  What is the theme for this year™s World Down  Syndrome Day observed on March 21", "    We  Decide     "], "question1": ["  On which date we observe World Poetry Day", "   March 21   "], "question2": ["  Which international day is observed every year  to raise awareness about the importance of the  household sparrow and the other common  birds to urban environments, and the threats to  their populations", "  The World Sparrow Day     "], "question3": ["  As per the World Happiness Repor t 2020  released by the United Nations, India stands at  which rank in world", "   144 th   "], "question4": ["  Which country topped the rankings given by  the   World Happiness Report 2020", "   Finland   "], "question5": ["  Name the legendary Indian footballer who died  in Kolkata after battling prolonged illness.  P K  Banerjee   "], "question6": ["  The Defence Ministry signed a capital  acquisition contract with which country for  procurement of 16,479 Negev 7.62x51 mm  light machine guns (LMGs)", "   Is rael   "], "question7": ["  A bench of NCLAT has been established in  Chennai to cater to the needs of south based  clients. Expand the term NCLAT.   National  Company Law Appellate Tribunal   "], "question8": ["  OFB  - Ordnance Factory Board, th e 2nd largest  defence equipment manufacturer in Asia, has  its headquarters in which city", "   Kolkata   "], "question9": ["  What is the name of the OFB HQs in Kolkata", "    Aayudh Bhawan   "], "question10": ["  The Chameli Devi Award is conferred upon  women for showing excellence in which field", "   Journalism   "], "question11": ["  A roll - on - roll off cum passenger ferry service,  was recently launched between Mumbai and  which other city", "    Mandwa   "], "question12": ["  Which apex authority recently ruled that  women cannot be denied permanent  commission in the Navy", "   Supreme Court   "], "question13": ["  A tiny island country i n the South Pacific Ocean  has become the world™s first whole country to  be recognised as a ‚Dark Sky Place™. Name it.   Nieu   "], "question14": ["  Who has been appointed as the new MD and  CEO of the Yes Bank", "   Prashant Kumar   "], "question15": ["  Which national day is observed celebrate  delivery of   the first dose of Oral Polio Vaccine  in India on March 16, 1995", "  National  Vaccination Day   "], "question16": ["  Name the former Chief Justice of India who has  recently been nominated to Rajya Sabha.    Justice Ranjan Gogoi   "], "question17": ["  The Central Sanskrit University Bill 2019 was  passed recently by the Parliament to provide  Central University status to how many  universities in India.   Three   "], "question18": ["  Name the ace Indian paddler   who  ended his  decade - long wait for a title by winning the ITTF  Chall enger Plus Oman Open (Table Tennis) in  Muscat, Oman.     Achanta Sharath Kamal   "], "question19": ["  Noted  philanthropist and IT magnate, Bill Gates  was in news recently for what reason", "   He  stepped down from Microsoft™s Board of  Directors.   "], "question20": ["  Muhyiddin Yassin has been appointed as the  Prime Minister of which country", "   Malaysia   "], "question21": ["  The First Khelo India University Games were  hosted by which state", "  Odisha   "], "question22": ["  Indian Railways launched its first ﬁRestaurant  on Wheelsﬂ at which railway station", "   Asansol,  West Bengal.   "], "question23": ["  On which date we celebrate Zero  Discrimination Day", "   March 1   "], "question24": ["  What is the name of the welfare programme  launched to provide good nutritional food tp  pregnant mothers", "    Suposhit Maa Abhiyaan   "], "question25": ["  The United States recently signed a historic  peace  agreement with which big militant  group", "   Taliban   "], "question26": ["  Which militant outfit is formally known as the  Islamic Emirate of Afghanistan", "   Taliban   "], "question27": ["  DRDO in collaboration with Indian Institute of  Science, Bengaluru has developed a new  explosive detection device  RaIDer - X for what  purpose", "    To detect explosives from a  distance   "], "question28": ["  Which International day is observed on March  3 for raising awareness about flora and fauna  and the dependability of humans on their  surroundings and the environment", "   Worl"]}, {"page": 82, "question0": ["  The Government of India has declared the  National Chambal Sanctuary an eco - sensitive  zone. It lies in which state", "   Madhya Pradesh   "], "question1": ["  Dr. Ajay Bhushan Pandey has been given charge  of which important office in the Finance  Ministry", "   Finance Secretary   "], "question2": ["    Which  are the two places nominated by the  government for inclusion in the World Heritage  List 2020, maintained by UNESCO", "   Dholvira  and Forts and Monuments of Deccan  Sultanate   "], "question3": ["  Dholavira, an ancient site of  Indus Valley  Civilization is located in which state", "   Gujarat   "], "question4": ["  India bagged a $ 40 million deal to supply 4  indigenously built radars (capable of locating  weapons) to which European country", "   Armenia   "], "question5": ["  Assembly of which state went paperless on  March 2 with the implementation of National e - Vidhan Application (N eVA)", "   Arunachal  Pradesh   "], "question6": ["  Which union ministry is responsible for  implementation of   National   e - Vidhan  Application", "   Ministry of Parliamentary  Affairs   "], "question7": ["  Who is the Minister of Parliamentary Affairs", "   Pralhad Joshi   "], "question8": ["  What is the name of the scheme that aims to   r eplace all level crossings on National  Highways with road over bridges or under  bridges", "   Setu Bhartam   "], "question9": ["  Name the former UN chief, who led the world  body during the Iran - Iraq war and the civil war  in El Salvador, who died recently.   Javier Perez  de Cuella r   "], "question10": ["  India observes  National Safety Day on which  date", "   March 4   "], "question11": ["  Which hilly state of India has declared to shift  its summer capital to Gairsain", "   Uttarakhand   "], "question12": ["  On March 1, we celebrate World _____  ______ Day  to highlight the importance of civil protection.    Civil Defence   "], "question13": ["  What was the theme for this year™s World Civil  Defence Day", "   Children™s safety, our  responsibility   "], "question14": ["  India celebrates Jan Aushadhi Diwas on which  day of March", "  7 th   "], "question15": ["  International Women's Day is observed on  which date", "   March 8   "], "question16": ["  Dhruv Batra Player of the Year Award is given  for outstanding performance in which field", "   Hockey   "], "question17": ["  Who won this year™s  Dhruv Batra Player of the  Year Award for men", "   Manpreet Singh   "], "question18": ["  Who won this year™s Dhruv Batra Player of the  Year Award for women", "   Rani  Rampal   "], "question19": ["  Denys Shmygal was elected as the new _________  of Ukraine.   Prime Minister   "], "question20": ["  Which country won the ICC Women™s T20  World Cup 2020", "   Australia   "], "question21": ["  Finals of the  ICC Women™s T20 World Cup 2020  were held in which city", "   Melbourne,  Australia   "], "question22": ["    Securities a nd Exchange Board of India (SEBI)  has launched a mobile application ‚Sebi  SCORES™ for what purpose", "   To facilitate  online filing of investors grievances through  their smartphones.   "], "question23": ["  What is the full form of the acronym SCORES", "   Sebi Complaints Redress Syste m   "], "question24": ["  Name the RBI Deputy Governor who  announced his resignation due to health  problems", "     N S Vishwanathan   "], "question25": ["  ﬁChapchar Kutﬂ is the most joyful and biggest  spring festival of which Indian state", "   Mizoram   "], "question26": ["    Which state government has asked the temple  administrators in     the state to obtain a ‚BHOG™  certificate from FSSAI (Food Safety and  Standards Authority of India) for the ‚prasad™  distributed by them", "   Tamil Nadu   "], "question27": ["  What is the name of the Mizoram™s  popular  bamboo folk dance", "   Cheraw   "], "question28": ["    NASA has named its Mars rover as__________ for  the Mars mission scheduled for July 2020", "   Perseverance   "], "question29": ["  Which great Indian king was named as the  'greatest leader ever' in the world in a survey  conducted by BBC World History Magazine", "   Maharaja Ranjit Singh   "], "question30": ["  Pritzker Prize is given for outstanding  achievement in which field", "   Architecture"]}, {"page": 83, "question0": ["  What is the amount  of cash award given with  the Pritzker Prize", "   $ 1,00,000/=   "], "question1": ["  What is one word that  describes a disease that  is spreading between people in multiple  countries around the world at the same time", "   Pandemic   "], "question2": ["  The World Kidney Day is observed on which  Thursday of   March", "   Second   "], "question3": ["    Who is popularly known as the Father of Green  Revolution in India", "   Dr M S Swaminathan   "], "question4": ["  Dr M S Swaminathan award is given for  outstanding performance in which field", "    Agriculture   "], "question5": ["  Which state has topped the list for domestic  solar rooftop installations, accounting for about  64% of the total 77,950 domestic solar  installations in the country", "   Gujarat   "], "question6": ["  Who is the winner of the first BBC Indian  Sportswoman of the Year Award  Œ   2019", "   P   V  Sindhu   "], "question7": ["  India is the world™s second largest arms  importer. Which country is at first spot", "  Saudi  Arabia   "], "question8": ["  The World Bank approved a $80 million loan to  the ____________ government to improve water  management practices and increase  agricultural productivi ty.   Himachal Pradesh   "], "question9": ["  Name the legendary Golf player from California,  USA who has been elected into the World Golf   Hall of Fame", "   Tiger Woods   "], "question10": ["  The World Health Organization, WHO   launched  an emergency task force ﬁCOVID Action  Platformﬂ in collaboration wi th which other  organisation", "   World Economic Forum   "], "question11": ["  In a big decision towards \"Customer First  Approach '', which bank waived minimum  balance requirement for its savings bank  customers", "    State Bank of India   "], "question12": ["  The 4th Inclusive Internet Index 2020 compiled  by the Economist Intelligence Unit (EIU),  London has placed India at which rank", "   46 th   "], "question13": ["  The government has announced to hold a CET  for recruitment in railways, banks and lower  levels of the Central government. What is the  full form of CET", "  Common Eligibility Test   "], "question14": ["  Which International Day is observed on March  15 to promote basic rights of cons umers and to  ensure that these rights are respected and  protected", "   The World Consumer Rights Day   "], "question15": ["  For the first time in India, the Department of  Posts introduced a free digital parcel locker  service in __________ to enable customers to  collect their consi gnment from specified post  offices at their convenience.   Kolkata   FEBRUARY 2020   "], "question16": ["  Which International Day is observed on Feb  28/29 to raise awareness about rare diseases  and their impacts", "  The World Rare Disease  Day     "], "question17": ["  What was the name of the Joint Airforce  exercise of India and UK held in last week of  February", "  Exercise Indradhanush 2020   "], "question18": ["  Exercise Indradhanush 2020 was held at which  place in India", "  Air Force Station Hindan, near  Ghaziabad, Uttar Pradesh   "], "question19": ["  Which apex org anization has recently launched  \"UPI Chalega\" campaign to promote UPI as  easy, safe, and instant mode of payment", "    National Payments Corporation of India  (NPCI)   "], "question20": ["  Which film won the best film award at the  Dadasaheb Phalke International Film Festival  Awards   2020", "  Super 30   "], "question21": ["  Who is the director of the award winning film  Super 30", "  Vikash Bahl     "], "question22": ["  Name the five - time Grand Slam winner tennis  player from Russia, one of the highest - paid  sportswomen for 11 years, who announced her  retirement", "  Maria Sharapova     "], "question23": ["  The Reserve Bank has directed banks to link all  the new floating rate loans to __________   enterprises with external benchmark, with  effect from 1st April 2020", "  Medium   "], "question24": ["  What is the full form of the MSMED Act, 2006", "  Micro, Small and Medium Enterprises  Devel opment    "], "question25": ["  Name the noted Indian - American business  executive who has been named the new  executive Chairman of Mastercard", "  Ajay Pal  Singh Banga     "], "question26": ["  The 6th National Ice Stock Sports  Championship was held     at which place"]}, {"page": 84, "question0": ["  Mohammed Hosni Mubarak,   who died recently,  ruled which country as President for 30 years", "  Egypt   "], "question1": ["  US President Donald Trump was given a grand  public reception at which stadium in  Ahmedabad", "  Sardar Patel Stadium, Motera   "], "question2": ["  During his India visit, US President signed a $3  billion deal to supply which helicopters to  India", "  MH - 60 Romeo Helicopters   "], "question3": ["  What type of helicopters are the MH - 60 Romeo  Helicopters", "  Advanced anti - submarine and  anti - surface warfare helicopter    "], "question4": ["  ndia  celebrates Central Excise Day on which  date", "   February 24   "], "question5": ["  What is the name of the Hindi version of  Artificial Intelligence - based chatbot launched  by the Indian Railway", "  ASKDISHA   "], "question6": ["  __________ has become the first Indian Football  Club to qualify for the Asian   Football  Confederation (AFC) Champions League group  stage", "  FC Goa   "], "question7": ["  India™s first floating jetty has been inaugurated  at which place in Goa", "  Vasco   "], "question8": ["  Government has formally announced the  constitution of the _____  Law Commission", "  22nd   "], "question9": ["  India celebrates Nati onal Science Day on  February 28 to honour the scientific  achievement of which Nobel laureate", "  Sir C V  Raman   "], "question10": ["  What is the popular name of the discovery  made by Sir C V Raman for which he was  awarded the Nobel prize in Physics in 1930", "  Raman Effect   "], "question11": ["  D Gukesh , the 13 - year old ChessGrandmaster  from Tamil Nadu emerged champion in the  34th Cannes Open in which country", "  France     "], "question12": ["  According to the Commerce Ministry data for  2018 - 19, which country was India's top trading  partner", "  USA   "], "question13": ["  Prime Minister Narendra Modi declared open  the first - ever Khelo India University Games at  _______ in Odisha on Feb 22", "  Cuttack   "], "question14": ["  ________________selected as the new Chief  Information Commissioner to head the Central  Information Commission", "  Bimal Julka   "], "question15": ["  What   is the name of the autobiography of  Yashwant Sinha, veteran BJP leader and former  Minister of Finance and External Affairs", "  Relentless     "], "question16": ["  What is the title of the recent book written by  Jaggi Vasudev, popular as ‚Sadhguru™, noted  Yogi and spiritual leader", "   Death -   An Inside  Story   "], "question17": ["    'Amnesty' is a popular novel written by which  author", "  Aravind Adiga   "], "question18": ["  What is the title of the new novel of Colum  McCann released in February 2020", "  Apeirogon   "], "question19": ["  Which two Union Territories recently hosted  the Khelo India Winter Games 2020", "  Ladakh  and J&K    "], "question20": ["  As per the Sustainability Index 2020 brought  out by the World Health Organization (WHO),  UN Children™s Fund (UNICEF) and the Lancet  medical journal, India has b een ranked at which  place", "  77th   "], "question21": ["  Who has been appointed as per the new Central  Vigilance Commissioner  -   CVC of India", "   Sanjay  Kothari   "], "question22": ["  The Northeast Frontier Railway Construction  Organisation has built India™s tallest railway  pier bridge  Š   100 m tall in which state", "  Manipur   "], "question23": ["  Name the veteran New Zealand batsman who  became the first player in the world to play 100  matches each in all three   formats of cricket", "  Ross Taylor   "], "question24": ["  Divya Kakran won gold in the 68 kg category in  an Asian championship in which sports", "  Wrestling      "], "question25": ["  ESPN Sports Awards are given by which  organization", "    ESPN TV Network, USA      "], "question26": ["  What is the full form of ESPN", "  Entertainment  a nd Sports Programming Network   "], "question27": ["  Who has been named ESPN Female  Sportsperson of the Year", "  PV Sindhu   (Badminton)   "], "question28": ["  Who has been named ESPN Male Sportsperson  of the Year", "  Saurabh Chaudhary (Shooter)   "], "question29": ["  Which day is celebrated across the globe with  support from UN ESCO, Paris to celebrate th"]}, {"page": 85, "question0": ["  What is the theme for this year's International  Mother Language Day", "  Languages without  borders   "], "question1": ["  The World Social Justice Day is observed  on  Feb 20 with support from which UN  organization", "   International Labour  Organization, Geneva   "], "question2": ["  Indian Railways Catering and Tourism  Corporation recently announced to run a  special tourist train covering important places  linked with Lord Rama. What is its na me", "  Sri  Ramayana Express     "], "question3": ["  Which National Day is celebrated to  commemorate the launch of the Soil Health  Card Scheme     in 2015", "  Soil Health Card Day,  Feb 19     "], "question4": ["  Which zone of the Indian Railways has become  the 1st zonal railway in the country to have  function al ﬁenergy neutralﬂ railway stations", "  South Central Railway Zone, Secunderabad   "], "question5": ["  Which global finance agency has agreed to give  a $450 million loan to promote Atal Bhujal  Yojana", "  World Bank   "], "question6": ["  The 3rd edition of the Global Ministerial  Conference on Road Safet y was held in capital  of which country", "  Sweden (Stockholm)   "], "question7": ["  Name the corporate businessman who recently  secured second rank in the list of richest  persons of India", "  Radhakishan Damani     "], "question8": ["  What is the popular name of the retail super  market chain being run by   Damani", "  D - Mart     "], "question9": ["    What is the official motto of the Tokyo 2020  Olympics", "  United by Emotion   "], "question10": ["  The International Hockey Federation has  granted hosting rights for the Junior Men™s  Hockey World Cup 2021 to which country", "  India   "], "question11": ["  As per IMF World Economic Outlook Report,  India emerged as the world's ________ largest  economy", "  Fifth   "], "question12": ["  Which International Airport in India was  recently declared free from    single - use plastic  usage", "  Delhi's Indira Gandhi International  Airport   "], "question13": ["  Koneru Hump y claimed her second title in the  last two months by winning which tournament", "   Cairns Cup chess tournament, USA   "], "question14": ["  The Laureus World Sports Awards  -   2020 were  announced recently at which place", "  Berlin,  Germany    "], "question15": ["  Who won this year's  Laureus Sportsman of the  year award", "  Lonel Messi   "], "question16": ["  Who is Simone Biles, winner of this year's  Laureus Sportswoman of the year award", "  Star  Gymnast with highest ever number of  Olympic and World Championship medals   "], "question17": ["  Which state government has declared the  Cauvery delta region as a Protected Special  Agriculture Zone", "  Tamil Nadu     "], "question18": ["  Indian Railways started on Feb 20 a special  train by the name___________ , linking Varanasi in  Uttar Pradesh with Indore in Madhya Pradesh", "  Kashi Mahakal Express   "], "question19": ["  Which Indian city hosted the 65th Filmfare  Awards", "  Guwahati     "], "question20": ["  Which film won the Filmfare Award for the Best  Film", "  Gully Boy     "], "question21": ["  Name the famous film director who was  honoured with the Filmfare  Lifetime  Achievement Award", "  Ramesh Sippy   "], "question22": ["  A recent global study showed that Hindi is the  ________ most spoken language of the world in  2019 with 615 million speakers", "  3rd   "], "question23": ["  Who has been re - elected as the President of  Afghanistan", "  Ashraf Ghani     "], "question24": ["  Debasish Panda has been appointed to which  important  post in the Ministry of Finance", "  Finance Secretary      "], "question25": ["  The famous Dan David Prize is supported by  which university", "  Tel Aviv University, Israel   "], "question26": ["  Who won the men's singles title at the 77th  Senior National Squash Championship held in  Chennai", "  Saurav Ghosal   "], "question27": ["  The women's singles title at the 77th Senior  National Squash Championship was won by  which player", "  Joshna Chinappa    "], "question28": ["  World SnowShoe Championships were recently  held in which country", "  Japan   "], "question29": ["  The 13th Conference of Parties (COP) of the  Convention on the Conservation of Migrator"]}, {"page": 86, "question0": ["  Which animal / bird has been named as the  mascot of the above event", "  Gibi  -   The Great  Indian Bu stard   "], "question1": ["  Supreme Court directed the union government  to grant _____  commission to all women officers  who opt for it.  Permanent     "], "question2": ["  Which bank topped the list of 'Highest increase  in brand value' among the banks around the  world, according to 'The Banker's Top   500  Banking Brands 2020' report", "  IndusInd Bank   "], "question3": ["  The external affairs ministry has decided to  rename the Pravasi Bhartiya Kendra and  Foreign Service Institute after which veteran  political leader", "  Late Sushma Swaraj     "], "question4": ["  The central government launched the ﬁS chool  Health Ambassador Initiativeﬂ for what  purpose", "  To spread awareness about the  preventive health aspects   "], "question5": ["  The ﬁSchool Health Ambassador Initiativeﬂ has  been launched as a part of which bigger  programme", "  Ayushman Bharat   "], "question6": ["  India celebrates national women's day on Feb  13 in the honour of which great woman leader", "  Sarojini Naidu    "], "question7": ["  On account of her excellence in poetry, Sarojini  Naidu was known will which nick name", "  Bharat Kokila (Nightingale of India)   "], "question8": ["  Which state hosted ﬁCli mFishCon 2020ﬂ, a four  day international conference on the impact of  climate change on ‚hydrological cycle,  ecosystem, fisheries and food security", "  Kerala     "], "question9": ["  The seven nation BIMSTEC Disaster  Management Exercise  -   2020 was hosted by the  National Disaster Re sponse Force (NDRF) in  which city", "  Bhubaneswar, Odisha   "], "question10": ["  What is the full form of the acronym BIMSTEC", "  Bay of Bengal Initiative for Multi - Sectoral  Technical and Economic Cooperation   "], "question11": ["  Headquarters of the BIMSTEC are located in  which city", "  Dhaka, Bangladesh   "], "question12": ["  President Ram Nath Kovind presented  ‚President™s Colour™ to the INS Shivaji. It is  located at which place", "  Lonavala,  Maharashtra   "], "question13": ["  What type of naval establishment is INS  Shivaji", "  It houses Naval College of  Engineering   "], "question14": ["  What is the name 200 - km strike range  supersonic tactical ballistic missile being  developed by DRDO", "  Pranash     "], "question15": ["  Supported by UNESCO, the World Radio Day is  observed on which date", "  Feb 13   "], "question16": ["  What is the theme of this year's World Radio  Day", "  Radio and Diversity   "], "question17": ["  The National Property Day celebrations on Feb  12 are promoted by which Union Ministry", "  Ministry of Commerce and Industry     "], "question18": ["  Name the noted environmentalist, former chief  and founder of TERI (The Energy and  Resources Institute), New Delhi, who passed  away re cently", "  Dr. R K Pachauri   "], "question19": ["  Which Indian boxer has been ranked number  one in the 52 kilogram category for Olympic  Qualifiers", "  Amit Panghal     "], "question20": ["  Which Indian player was named Player of the  Year for 2019 by the International Hockey  Federation", "  Manrpreet Singh   "], "question21": ["  Pr esident of __________ Marcelo Rebelo de Sousa  arrived in New Delhi on a four - day visit", "  Portugal   "], "question22": ["  AAP Chief Arvind Kejriwal secured a landslide  victory in Delhi assembly elections, becoming  Chief Minster for the ________ time", "  3rd   "], "question23": ["  According to the PSU Sur vey 2018 - 19, which  PSUs is the highest profit earning organisation", "   Oil and Natural Gas Corporation (ONGC)   "], "question24": ["  Name the cueist who defeated multiple - time  world champion Pankaj Advani 6 - 2 to win the  National Snooker Championship in Pune", "  Aditya Mehta     "], "question25": ["  Who is the current national title holder of  women's and snooker", "  Vidya Pillai     "], "question26": ["  Which international team has been awarded  ICC Women™s Championship Trophy 2020", "  Australia     "], "question27": ["  Ajeya Warrior - 2020", "     5th edition of joint  military exercise of India was held with w hich  other country", "  United Kingdom      "], "question28": ["  The IOC Coaches Lifetime Achievement Awards  for Men has been won by whom", "  Malcol"]}, {"page": 87, "question0": ["  Who won the women's IOC Coaches Lifetime  Achievement Award", "  Ulla Koch from  Germany, for train ing     gymnasts   "], "question1": ["  Where in India a glass floor suspension bridge,  the first of its kind in the country, is to be  constructed", "  Rishikesh,   Uttarakhand     "], "question2": ["  Lalremsiami, 19 year old Hockey player from  __________ has been named as the ﬁ2019 FIH  Women's Rising Star of the Yearﬂ", "  Mizoram   "], "question3": ["  The World Health Organization (WHO) has  given what formal name to the disease caused  by the new coronavirus", "  Covid - 19   "], "question4": ["  The roots of Unani medicine system can be  traced to which modern country", "  Greece     "], "question5": ["  India celebrates Unani Day on which date", "  Feb  11   "], "question6": ["  The Kolkata - based Garden Reach Shipbuilders  and Engineers delivered ﬁINS Kavarattiﬂ to the  Indian navy recently. What type  of ship it is", "  Anti - submarine warfare stealth corvette   "], "question7": ["  African Union Summit 2020 was held on Feb  10 - 11 in which place", "  Addis Ababa, Ethiopia    "], "question8": ["  Who is  Cyril Ramaphosa, the current chairman  of African Union", "  President of South Africa      "], "question9": ["  Which Indian badmint on coach, was awarded  an \"honourable mention\" at the IOC Coaches  Lifetime Achievement Awards 2019", "  Pullela  Gopichand   "], "question10": ["  Which state won the 10th Hockey India Senior  Women National Championship 2020 (A  Division) title at Kollam, Kerala", "  Haryana      "], "question11": ["  Team of whi ch country lifted the ICC U - 19  World Cup", "  Bangladesh     "], "question12": ["  What is the popular name for the prestigious  Academy Awards given for outstanding  excellence in cinema", "  Oscar     "], "question13": ["  Who made the documentary American Factory,  the film that won the Oscar for the best  documentary", "  Barack and Michelle Obama     "], "question14": ["  Name the South Korean director, who won the  Oscar for the best director for the film Parasite", "  Bong Joon - ho     "], "question15": ["  Which film won the Oscar for the best film", "  Parasite   "], "question16": ["  The largest exhibition for the world's defence  companies to display their land, sea and air  capabilities was held at which city in India", "  Lucknow, UP    "], "question17": ["  _________ of Sri Lanka, Mahinda Rajapaksa,  arrived   in New Delhi     on Feb 8 on a five day  state visit", "  Prime Minister    "], "question18": ["  Which Union Ministry organises the National  Deworming Day on Feb 10", "  Ministry of Health  and Family Welfare   "], "question19": ["  Which medicine is administered to the children  on the National Deworming Day", "  Al bendazole   "], "question20": ["  Who created three new records in the men's  109kg category in the National Weightlifting  Championships at Kolkata", "  Chandrakant Mali   "], "question21": ["  The International Intellectual Property (IP)  Index which measures the intellectual property  environment of 53 eco nomies of the world,  placed India at which rank", "  40th   "], "question22": ["  Britain's Prince Charles unveiled a new  children's protection fund for which country as  part of British Asian Trust", "  India   "], "question23": ["  India replaced which country to become 2nd  largest producer of steel in the  world in 2019", "   Japan     "], "question24": ["  Which country is the largest producer of steel  in the world", "  China   "], "question25": ["    Who has been awarded the International  Gandhi Awards for Leprosy", "  Dr NS  Dharmashaktu   "], "question26": ["  Name the longest - serving Kenyan President,  who passed away on February 04", "  Dan iel  Arap Moi   "], "question27": ["    India™s biggest rural technical festival titled  ‚Antahpragnya 2020™ was held in Rajiv Gandhi  University of Knowledge Technologies, in  which state", "  Telangana    "], "question28": ["  Union Cabinet has decided to bring __________  banks under the regulatory mechanism   of  Reserve Bank of India", "  Cooperative   "], "question29": ["  Ajay Bisaria   has been appointed as the next  High Commissioner of India to which country", "  Canada     "], "question30": ["  The Indian Navy conducted a coastal security  exercise named ‚Malta Abhiyan™ in which place", "  Sunderban delta waters nea r Kolkata, West  Bengal  "]}, {"page": 88, "question0": ["  M Ajit Kumar has been appointed as the  chairman of the Central Board of _______________", "  Indirect Taxes and Customs   "], "question1": ["  Which country has introduced a new system for  collecting fee from regional tourists, called  ‚Sustainable Development Fee", "  Bhutan      "], "question2": ["  Which cinema award are popularly known as  the Oscars of Europe", "   BAFTA Awards     "], "question3": ["  What is the full form of BAFTA", "  British  Acad emy Film and Television Arts   "], "question4": ["  Which film secured the BAFTA award for the  best film", "    1917 by Sam Mendes   "], "question5": ["  Who won the BAFTA award for the best leading  actress", "  R enee Zellweger (Judy)   "], "question6": ["  Name the actor who won all the three top  global awards viz Oscar, Golden  Globe and  BAFTA for the best actor", "  Joaquin Phoenix  (Joker)     "], "question7": ["  RBI has enhanced the insurance cover on bank  deposits to _____ lakh rupees from one lakh  rupees wef Feb 04", "  Five   "], "question8": ["  The Insurance cover on the bank deposits of  individuals is provided by which RBI   owned  company", "  Deposit Insurance and Credit  Guarantee Corporation (DICGC),     "], "question9": ["  Which International Day is celebrated on Feb 2  to raise awareness about the importance of     wetlands in maintaining ecological balance", "  World Wetland Day     "], "question10": ["  Which Island country recently re - joined the  commonwealth, after having left in 2016", "  Maldives     "], "question11": ["  What is the number of member countries of the  Commonwealth after joining of Maldives", "  54   "], "question12": ["  Who has been chosen as the ﬁCentral Banker of  the Yearﬂ for the Asia P acific Region by     the  London based global financial magazine  -   The  Banker", "  Shaktikanta Das   "], "question13": ["  What is the theme of this year's World Cancer  Day observed on Feb 04", "  \"I am and I will\"     "], "question14": ["  The Supreme Court has directed the states,  which are yet to come out with notifications for  establishing Village Courts by the name of  ___________", "  Gram Nyayalayas   "], "question15": ["  The Gram Nyayalayas are to be established  under the provision of which law", "  Gram  Nyayalayas   Act, 2008     "], "question16": ["  Which global technology giant announced a  dollar one million grant to promote news  literacy among Indians", "  Google     "], "question17": ["  10th Hockey India Senior Men National  Championship was held at which place", "  Jhansi,  UP   "], "question18": ["  Mary Higgins Clark, the long - reigning \"Queen of  Suspense\", one of the world's most popular  writers, died recently. She hailed from which  country", "  USA   "], "question19": ["  Name the former communication minister of  Iraq who has been appointed as the Prime  Minister of Iraq", "  Moha mmad Allawi   "], "question20": ["  India and which other country held the 14 day  joint military training exercise SAMPRITI - IX", "  Bangladesh     "], "question21": ["  The bilateral military exercise SAMPRITI - IX  was held at which place", "    Umroi, Meghalaya     "], "question22": ["  The 36th edition of the National Games will be  he ld in ________ from 20th October to 4th  November 2020", "  Goa   "], "question23": ["  What is the name of the flame - throated Bulbul,  that has been unveiled as the official mascot for  the Games", "  Rubigula     "], "question24": ["  The finals of the first grand slam of the year  Australian Open were held in w hich city", "  Melbourne    "], "question25": ["  Who won her first grand slam title by winning  the Australian Open", "  Sofia Kenin, USA      "], "question26": ["  Men's Singles title in the Australian Open was  won by which player", "  Novak Djokovic ,  Serbia     "], "question27": ["  Which state bagged the first position for the  implementation of Pradhan Mantri Matru  Vandana Yojana", "  Madhya Pradesh     "], "question28": ["  On January 31, Britain officially left the  European Union after ________ years of  membership", "  47   "], "question29": ["  Name the British political leader who  su ccessfully led the Britain's exit plan from the  European  Union", "  Boris Johnson     "], "question30": ["  Billed as the world™s largest meditation facility,  an imposing meditation centre was  inaugurated in ‚Kanha Shantivanam™ near  which city", "  Hyderabad   "], "question31": ["  Which country created a new   Guinness Worl"]}, {"page": 89, "question0": ["  President Ram Nath Kovind inaugurated the  34th Surajkund International Crafts Fair on  February 1 at Surajkund in which place", "  Faridabad, Haryana   "], "question1": ["  Which was the pa rtner country for this year's  Surajkund International Crafts Fair", "     Uzbekistan   "], "question2": ["    Which player won the prestigious  'World  Games Athlete of the Year'   award given by  the International World Games Association", "   Rani Rampal   "], "question3": ["    Who is Rani Rampal", "   Captain of In dian  Women's Hockey Team   "], "question4": ["  Tyler Prize, often described as the ‚Nobel Prize  for Environment™ was awarded to whom this  year", "  Pawan Sukhdev   "], "question5": ["  Who has been elected as the Chief Executive  Officer (CEO) of the Indian Banks™ Association  (IBA), Mumbai for the year 2020", "  Sunil Mehta    "], "question6": ["  Which state launched a virtual police station  where people can lodge complaints online from  their respective districts ,     without visiting the  Police Station", "  Odisha     "], "question7": ["  Oxford University Press named which word as  the ﬁOxford Hindi Word of 2019ﬂ saying it  received widespread attention in the year", "  Samvidhaan (Constitution)   "], "question8": ["  Esow Alben of India is a leading sports star of  whi ch sports", "  Cycling   "], "question9": ["  Taranjit Singh Sandhu,   1988 batch IFS officer  has been appointed as India™s ambassador to  which country", "  USA      JANUARY 2020   "], "question10": ["  Who has been appointed as the new Foreign  Secretary of India", "  Harsh Vardhan Shringla   "], "question11": ["  The death anniversary of Mahatma Gandhi is  also celebrated as which day on January 30", "  Anti Leprosy Day / Martyrs Day   "], "question12": ["  Assassination of Mahatma Gandhi took place in  which year", "  1948   "], "question13": ["  What is the title of the book recently written by  Mukhtar Abbas Naqvi,   Un ion Minister of  Minority Affairs", "  Balwa     (uprising)   "], "question14": ["  American Dirt   is a popular novel released in  January 2020. Who is its author", "  Jeanine  Cummins   "], "question15": ["  Which Ministry launched online portal ‚GATI™  for monitoring major projects of the National  Highways Authority of India (NHAI)", "  Union  Road Transport Ministry   "], "question16": ["  Which stat government launched the Shiv  Bhojan Scheme to provide a regular meal in just  Rs. 10 to commoners", "  Maharashtra   "], "question17": ["  The 62nd annual Grammy Awards were  presented at the Staples Center in Los Angeles.  They recognize the outstanding excellence in  which  field", "  Music   "], "question18": ["  Name the artist who created history by  sweeping all the four top Grammy Awards  2020", "  Billie Eilish (USA)   "], "question19": ["  According to the recent data released by the  Agriculture Ministry, which state topped in the  production of vegetables", "  West Bengal    "], "question20": ["  Sta te of ____________ produced the largest  quantity of fruits in 2018 - 19", "  Andhra Pradesh   "], "question21": ["  The central govt. signed a peace accord on  January 27 with the insurgent tribal groups of  which state", "  Assam   "], "question22": ["  This accord was sign with which tribal groups", "  Bodos   "], "question23": ["  Bodos   occupy which part of Assam", "  Western  Assam, north of Brahmaputra   "], "question24": ["  The Coronavirus wreaked havoc in China.  Which Chinese city suffered the most", "  Wuhan   "], "question25": ["  The Coronovirus generally causes which kind  of illness", "  Acute respiratory syndromes   "], "question26": ["  The Supreme Court granted how much  reservation to persons with disabilities in all  public sector jobs", "  3%   "], "question27": ["  Name the veteran American basketball player  who was killed in a helicopter crash in  California, USA", "  Kobe Bryant    "], "question28": ["  The World Bank approved a loan of  $210  million for Agribusiness and Rural  Transformation Project of which state", "  Maharashtra   "], "question29": ["  Out of George Fernandes, Sushma Swaraj, Arun  Jaitley and  Manohar Parrikar, whose name does  not figure in this year's Padma Vibhushan  Awards", "  Manohar Parikar"]}, {"page": 90, "question0": ["  Name the only sports person who has been  considered for award of Padma Vibhushan this  year", "  MC Mary Kom   "], "question1": ["  Shuttler PV Sindhu andindustrialist Anand  Mahindra were selected for which Padma  award this year", "  Padma Bhushan   "], "question2": ["  World Leprosy Day is observed on which   date", "  Last Sunday of January   "], "question3": ["  The Leprosy disease affects which parts of the  body", "  Skin and nerves    "], "question4": ["  At which Indian airport a special all women taxi  service named 'Women with wheels' was  launched recently", "  Indira Gandhi  International Airport, New Delhi   "], "question5": ["  President of which country was the Chief Guest  at the 71st Republic Day Parade ceremony at  Rajpath, New Delhi", "  Brazil   "], "question6": ["  What is the name of the first ever humanoid  unveiled recently by the ISRO", "  Vyomitra   "], "question7": ["  The DRDO successfully test - fired its K - 4  nuclear cap able missile recently from which  launch pad", "  Submarine   "], "question8": ["  Which is the first telecom company to provide  UPI - powered payments service for its  subscribers", "  Reliance Jio   "], "question9": ["  What is the full form of UPI", "  Unified Payments  Interface    "], "question10": ["  UPI is an instant real - time payment system  developed by ___________ and regulated by  _________", "  National Payments Corporation of  India; RBI    "], "question11": ["  What is the name of the debit / credit card  launched by NPCI", "  RuPay   "], "question12": ["  Which day is observed on January 25 every  year to spread awareness about the necessity  of voting and to encourage young generation  towards the voting rights", "  National Voters  Day   "], "question13": ["  Why January 25 has been selected to celebrate  National Voters Day", "  The Electi on  Commission of India came into existence on  this day in 1950   "], "question14": ["  Headquarters of Election Commission of India  in New Delhi are known by which name", "  NirvachanSadan   "], "question15": ["  What was India's rank in the recently released  Global Talent Competitive Index (GTCI) 2020", "  7 2nd   "], "question16": ["  _______ secured the first place in the GTCI 2020", "  Switzerland   "], "question17": ["  Celebration of International Day of Education is  supported by which UN organization", "  UNESCO   "], "question18": ["  International Day of Education is observed on  which date", "  January 24   "], "question19": ["  India observes National E ducation Day on  which date", "  November 11   "], "question20": ["  Which Union Ministry supports the celebration  of National Girl Child Day", "  Ministry of Women  and Child Development   "], "question21": ["  India celebrates National Girl Child Day on  which date", "  January 24   "], "question22": ["  Which organization launched a blockchain - technology based payment system ‚Vajra  Platform™", "  National Payments Corporation of  India (NPCI)   "], "question23": ["  Customers of which bank will now be able to  withdraw cash from ATMs without their debit  cards", "  ICICI Bank   "], "question24": ["  As per the  World Economic Situation and  Prospects (WESP) 2020 report released by the  United Nations, India™s GDP growth rate has  been lowered to ____ %for 2019 - 20, from     7.6%  projected last year", "  5.7%   "], "question25": ["  __________ has become the 1st state in the  country where the gove rnment has made a  policy to lease out agricultural land available  under the government's control", "  Uttarakhand   "], "question26": ["  As per the Corruption Perception Index 2020  India slipped two spots to ______ place", "   80th   "], "question27": ["  Which NGO compiles the Corruption Perception  Index", "  Transparency International   "], "question28": ["  Which two countries shared equal marks to  secure top position in the Corruption  Perception Index", "  New Zeeland and Denmark   "], "question29": ["  Airpocalypse, a study of     air pollution level in  287 Indian cities declared which 2 coal mining  cities as   the most polluted", "  Jharia and  Dhanbad   "], "question30": ["  Jharia and Dhanbad are located in which state", "  Jharkhand    "], "question31": ["  Crystal Awards are associated with which field", "  Social Work by exceptional artist "]}, {"page": 91, "question0": ["  Which organization is associated with Crystal  Awards", "  World Economic  Forum   "], "question1": ["  Name the Indian celebrity who won the Crystal  Award this year", "   Deepika Padukone   "], "question2": ["  January 22 the Prime Minister chaired the first  PRAGATI meeting of the year 2020. What is the  purpose of meeting", "  To review the progress  of various ongoing mega projec ts   "], "question3": ["  What is the full form of the acronym PRAGATI", "  Pro - Active Governance and Timely  Implementation   "], "question4": ["  EkateriniSakellaropoulou has been elected as  the first woman President of which country", "  Greece   "], "question5": ["  In which metro city shops and business  establishments like m ultiplexes and malls have  been allowed to remain open 24x7", "  Mumbai   "], "question6": ["  The 3rd Khelo India Youth Games were held in  _________ from Jan 10 to 22", "  Guwahati   "], "question7": ["  Which state won the Champions trophy in the  3rd Khelo India Youth Games", "  Maharashtra   "], "question8": ["  India dropped 10 places to ________ rank in the  latest Democracy Index 2019", "  51st   "], "question9": ["  Which organization compiles the Democracy  Index", "  Economist Intelligence Unit,  London   "], "question10": ["  Which country topped the Democracy Index  2019", "  Norway   "], "question11": ["  Arjun Munda elected as the President of  Archery Association of India. Who is he", "  Union  Minister for Tribal Affairs   "], "question12": ["  With which neighbouring country India opened  an ICP at Biratnagar", "  Nepal    "], "question13": ["  What is the full form of ICP", "  Integrated Check  Post   "], "question14": ["  Which is the   Indian counterpart city for the  Biratnagar ICP", "  Jogbani, Bihar   "], "question15": ["  India secured which rank on the annual Carbon  Disclosure Project (CDP) 2019 report", "  5th    "], "question16": ["  Carbon Disclosure Project (CDP) 2019 report  placed which country at the top spot", "  USA   "], "question17": ["  Which senior BJP leader has been elected as the  11th President of the party", "  Jagat Prakash  Nadda   "], "question18": ["  Sanjiv Chadha has been appointed as the MD &  CEO of which Bank", "  Bank of Baroda    "], "question19": ["  Which international organization lowered  India™s economic growth forecast to  4.8 percent  for 2019 - 20, from 6.1 percent projected in  October", "  International Monetary Fund    "], "question20": ["  The World Economic Outlook report is brought  out by which International Body", "    International Monetary Fund   "], "question21": ["  Which global NGO held its annual meeting at  Davos att racting some 3,000 leading  business/political leaders, economists,  celebrities and journalists", "  World Economic  Forum   "], "question22": ["  Davos is located in which country", "  Switzerland    "], "question23": ["  Who is the founder chairman of WEF", "  Klaus  Schwab   "], "question24": ["  The World Economic Forum is based at wh ich  city in Switzerland", "  Geneva   "], "question25": ["  At which place the Indian Air Force has  inducted its first squadron of Sukhoi - 30 MKI  aircraft carrying the supersonic BrahMos  missiles", "  Thanjavur, Tamil Nadu   "], "question26": ["  Which country has shared technology with  India to make Sukhoi - 30 MKI fighter jets in  India", "  Russia   "], "question27": ["  Sania Mirza won the women™s doubles title of  the WTA International trophy at _____________,  Australia", "  Hobart   "], "question28": ["  In a list of 130 cities across the world, sur veyed  by the US based global property consultant JLL,  __________ has emerged as the world™s most  dynamic city", "  Hyderabad   "], "question29": ["  India has been ranked very low at _______ place  out of 82 countries on a new Social Mobility  Index", "  76th   "], "question30": ["  The Social Mobility Index is   topped by which  country", "  Denmark   "], "question31": ["  Which organization is responsible for bringing  out the Social Mobility Index", "  World Economic  Forum   "], "question32": ["  Who won the women's singles title at the  Indonesia Badminton Masters 2020", "  RatchanokIntanon of Thailand   "], "question33": ["  The 9th     Interna tional Children's Film Festival  was held in __________ from Jan19 to 26", "  Kolkata   "], "question34": ["  What was the name of the joint exercise of    Indian Coast Guard and the Japan Coast Guar"]}, {"page": 92, "question0": ["  The joint exercise Sahyog - Kaijin was held at  which place", "  Off the Chennai coast   "], "question1": ["    Mikhail V. Mishustin has been elected by the  Russian Parliament as the country's new  __________ . Prime Minister   "], "question2": ["  Arunachal Pradesh became the first Indian  state to sign a MoU   with IUCN for red - listing of  _______ in the state", "   Orchids   "], "question3": ["    What is the full form of IUCN", "   International  Union for Conservation of Nature   "], "question4": ["  What are Orchids", "   Attractive flowering  plants   "], "question5": ["  What is meant by red listing of species", "  It is  listing of  threatened species that need  conservation   "], "question6": ["  _________ approved a $88 million loan for Assam  Inland Water Transport Project to modernize  the Assam™s passenger ferry sector", "  WorldBank   "], "question7": ["  The first edition of Krishi Manthan -   the largest  Food, Agri - business and Ru ral Development  Summit of Asia was held at which place", "  Ahmedabad    "], "question8": ["  VineshPhogat, Anshu Malik are the top ______ of  India", "  Women wrestler   "], "question9": ["  __________ became the fastest Indian spinner     and  overall third bowler to claim 100 wickets in  ODI", "  Kuldeep Yadav   "], "question10": ["  Name the senior Indian Advocate who has been  appointed as the Queen's Counsel (QC) for the  courts of England and Wales", "  Harish Salve   "], "question11": ["  Which neighbouring country of India suffered a  setback in GDP growth, sinking down to 6.1%,  lowest in 3 decades", "  China   "], "question12": ["  Ro bertAbela elected as the new Prime Minister  of Malta. Where is Malta", "  A tiny island  country in the Mediteranean Sea   "], "question13": ["    Sir Garfield Sobers Trophy is associated with  outstanding performance in which field", "  Cricket   "], "question14": ["    Who won the Sir Garfield Sobers Trophy for   Best Cricketer of the Year 2019, awarded by the  ICC", "  Ben Stokes, England   "], "question15": ["  The Government of India signed an historic  agreement with the governments of _______ and  ___________ and representatives of Bru - ReangTribals", "  Tripura, Mizoram   "], "question16": ["  As per the agreement, the Bru - Reangtribals will  now be settled in _______ state of India", "  Tripura   "], "question17": ["  ISRO™s     high power communication satellite  GSAT - 30 was successfully launched onboard  Ariane 5 rocket from which place", "  French  Guiana   "], "question18": ["  The GSAT - 30 satellite will be used for  improving services in which field", "  Telecommunication and broadcasting    "], "question19": ["  The prestigious literary award  'SaraswatiSamman' is conferred for  outstanding contribution to literature in which  language", "  22 languages listed i n Schedule  VIII of the Constitution of India   "], "question20": ["  Who won the SaraswatiSamman for 2019", "  VasdevMohi   "], "question21": ["  VasdevMohi won the SaraswatiSamman for  which book", "  Chequebook, a collection of  short stories   "], "question22": ["  What is the cash award component of the  SaraswatiSamman", "  Rs.15 lak h   "], "question23": ["  VasdevMohi is a prominent writer associated  with which language", "  Sindhi   "], "question24": ["  Which organization awards the  SaraswatiSamman", "  K K Birla Foundation,  Delhi.   "], "question25": ["  Which Indian monument has been included by  the Shanghai Cooperation Organization in its  list of eight w onders", "  Statue of Unity   "], "question26": ["  Name the Indian Army officer who became the  first woman parade adjutant to lead the  Republic Day parade 2020", "  Captain Tania  Shergill   "], "question27": ["  Which day is celebrated on January 15 to mark  the taking over of command of Indian Army by  then Lt Gen K M Cariappa, the first Indian  Commander - in - Chief, from the British General", "  Army Day   "], "question28": ["  The 23rd National Youth Festival 2020 was  held from 12 - 16 January  in_______, Uttar  Pradesh", "  Lucknow   "], "question29": ["  The 23rd National Youth Festival 2020 was  held from 12 - 16 January.  It is associated with  which great personality of India", "  Swam"]}, {"page": 93, "question0": ["  What is the linkage of Swami Vivekananda with  the National Youth Day", "  It is  the birthday of  Swami Vivekananda   "], "question1": ["  The National Youth Day is celebrated on which  date", "  January 12   "], "question2": ["  Who has been appointed as the new Director  General of CRPF", "  A P Maheshwari   "], "question3": ["  What is the full form of CRPF", "  Central Reserve  Police Force    "], "question4": ["  Which city hosted t he World Future Energy  Summit", "  Abu Dhabi   "], "question5": ["  Recently we read about 'Raisina Dialogue' in  the news headlines. What is it all about", "  Itis  theflagship global conference of India on  geopolitics and geo - economicsissues   "], "question6": ["  Which Indian city hosted the 'Raisina Dialogue'  from January 14 to 16", "  New Delhi   "], "question7": ["  Which is the popular festival of North India  associated with end of winter solstice and  beginning of summer solstice", "  Makar  Sankranti    "], "question8": ["  The Makar Sankranti is celebrated popu larly as  Magh Bihu in which state", "  Assam   "], "question9": ["  People in Tamil Nadu celebrate occasion of  Makar Sankranti as _________ festival", "  Pongal   "], "question10": ["  In which state Makar Sankranti is celebrated as  Uttarayan festival", "  Gujarat   "], "question11": ["  The Reserve Bank released a report titled  ﬁNati onal Strategy for Financial Inclusion", "  2019 - 2024ﬂ. The report has identified how  many pillars to achieve financial inclusion", "  Six   "], "question12": ["  The award for Best International Cricketer is  given by BCCI in the honour of which great  cricketer", "  Polly Umrigar   "], "question13": ["  Who won th is year's Polly Umrigar award for  the best cricketer in Men's category", "  JaspritBumrah   "], "question14": ["  The DilipSardesai Award for highest runs was  given to ________ by BCCI", "  ChetaswarPujara   "], "question15": ["  The DilipSardesai Award for taking highest  wickets was given to ______ by BCCI", "  JaspritBumrah   "], "question16": ["  JaspritBumrah is specializes in which field of  cricketer", "  Right arm fast bowling   "], "question17": ["  The Polly Umrigar award for the best  womencricketer  -    has been won by", "  Poonam  Yadav   "], "question18": ["  Poonam Yadav excels in which roll in the Indian  Cricket Team", "  Leg Spinner   "], "question19": ["  What was the formal name of Swami  Vivekananda", "  Narendra Nath Datta   "], "question20": ["  What is the name of the popular spiritual and  educational institution founded by Swami  Vivekananda", "  Ramkrishna Mission   "], "question21": ["  Henley Passport Index 2020 has ranked   Indian  passport at which ran k in the world", "   84 th   "], "question22": ["  Which country tops the Henley Passport Index  2020 for providing visa - free access to 191  countries", "  Japan   "], "question23": ["  Which country recently became the first one to  declare its exit from the European Union", "  Britain   "], "question24": ["  How many countries are there in European  Union", "  28   "], "question25": ["  According to recent World Bank report, India™s  growth rate is projected to come down to _____  % in 2019 - 20 amid enduring financial sector  issues", "  5%   "], "question26": ["  The RBI has amended the KYC norms allowing  banks to use V - CIP. What is its full form", "  Video  based Customer Identification Process   "], "question27": ["  Which international day is observed on January  10 to promote Hindi language around the  world", "  World Hindi Day   "], "question28": ["  India celebrat es Rashtriya Hindi Divas on  which date", "  September 14   "], "question29": ["  Indian - origin writer JasbinderBilan won which  international award for her debut novel ﬁAsha  and the Spirit Birdﬂ", "  UK Children's Book  Award   "], "question30": ["  The Cabinet Committee on Economic Affairs  approved 'Viability  Gap Funding' worth  Rs.5559 crores to set up a natural gas pipeline  grid in which part of the country", "  North East    "], "question31": ["  Which company has been selected to set up a  natural gas pipeline grid in North East", "  Indradhanush Gas Grid Limited   "], "question32": ["  The 31st International Kite Festival was held in  which city in the second week of January", "   Ahmedabad, Gujarat   "], "question33": ["  What was the name of the joint maritim"]}, {"page": 94, "question0": ["  Which country began a mass culling of up to  10 ,000 camels as their ﬁextremely largeﬂ herds  have been encroaching on rural communities", "  Australia   "], "question1": ["  Which bank has announced a 'residential  builder finance with buyer guarantee' (RBBG)  scheme, to improve home buyers' confidence", "  SBI   "], "question2": ["  PravasiBharatiya Divas   is observed on which  date", "  January 09   "], "question3": ["  PravasiBharatiya Divas celebrates the home  coming of which great Indian leader on this day  in 1915", "  Mahatma Gandhi   "], "question4": ["  NASA™s TESS (Transiting Exoplanet Survey  Satellite) recently discovered an earth - sized  planet named TOI 700d. What is its specialty", "  NASA expects this planet to be habitable    "], "question5": ["  The Reserve Bank has decided to recruit ___ %  of the specialised supervisory and   regulatory  cadre from the market", "  35%   "], "question6": ["  Pedro Sanchez has been re - elected as the Prime  Minister of which country", "  Spain   "], "question7": ["  The 5th Ice Hockey Association of India (IHAI)  National Ice Hockey Championship  - 2020 was  held in which place", "  Leh, Ladakh   "], "question8": ["  Which State / UTs won both, Men's and  Women's title in the National Ice Hockey  Championship  - 2020", "  Ladakh   "], "question9": ["  Marine ecosystems are aquatic ecosystems  whose waters possess a high _______ content", "  Salt   "], "question10": ["  The 3rd international symposium on Marine  Ecosystems Chal lenges & Opportunities  (MECOS - 3) was hosted by which city", "  Kochi,  Kerala   "], "question11": ["  Which Indian paramilitary force has decided to  observe 2020 as the ‚year of mobility™ to focus  on various welfare measures for its troops", "  CISF - Central Industrial Security Force   "], "question12": ["  Whi ch country recently formally approved  setting up of its special Space Force", "  USA   "], "question13": ["    The first edition of Khelo India University  Games is scheduled to be held at which  university", "  KIIT University in Bhubaneswar   "], "question14": ["  Prof. Suresh Chandra Sharma has been  appointed   as the chairman of which apex  professional body", "  National Medical  Commission   "], "question15": ["  C K Nayudu Lifetime Achievement Award is  given for recognizing one's outstanding  contribution to which field", "  Cricket   "], "question16": ["  Who has been selected for the C K Nayudu  Lifetime Achievement Award 2019 in Men's  category", "  KrishnamachariSrikkanth   "], "question17": ["  Who has been selected for the C K Nayudu  Lifetime Achievement Award 2019 in Women's  category", "  Anjum Chopra   "], "question18": ["  India has extended a line of cr edit (LoC) of $ 75  million (over Rs 500 crore) to ________ to finance  solar parks in their country", "  Cuba   "], "question19": ["  Which Indian city hosted the 63rd National  Shooting Championship", "  Bhopal   "], "question20": ["  Name the Indian all - rounder who announced  his retirement from all forms of Cricket", "  Irfan  Pathan   "], "question21": ["  The Golden Globe Awards are associated with  recognition of excellence in which field", "  Cinema and TV   "], "question22": ["  Which picture won the Golden Globe for the  best picture", "  1917   "], "question23": ["  Malavath Poorna,the 18 - year - old mountaineer  from Telangana recently scaled Mt. Vinson  Massif. It is the highest peak of which  continent", "  Antarctica   "], "question24": ["  Recently KVIC open its first ﬁPatolaﬂ silk  processing plant at Surendranagar in Gujarat.  What is full   form of KVIC", "  Khadi and Village  Industries Commission   "], "question25": ["  ﬁPatolaﬂ silk is famous for which product", "  ExpensiveSilkSarees   "], "question26": ["  Patola sarees from which place enjoy the GI tag  for their exclusivity", "   Patan, Gujarat    "], "question27": ["  Name the star table Tennis player from UP who  jumped nine places to become the world no. 1  in the Under - 21 men™s singles category", "  Manav  Thakkar   "], "question28": ["  What was the name of the person who  developed Braille language for the visually  handicapped persons", "  Louis Bra ille   "], "question29": ["    Braille language is based on _____ convex dot"]}, {"page": 95, "question0": ["  The Indian Railways has renamed its security  force RPF (Railway Protection Force).  What is  the new name", "   Indian Railway Protection  Force Service   "], "question1": ["  What was  the theme of this year's New Delhi  World Book Fair", "  ‚Gandhi", " The Writers™  Writer™   "], "question2": ["  Kota, the coaching capital of India in Rajasthan  was in news recently for what reasons", "  Over  100 infants died in city™s J K Lon Hospital   "], "question3": ["  Which institution hosted the Indian   Science  Congress, the biggest annual gathering of  scientists in India and abroad", "  University of  Agricultural Sciences, Bengaluru   "], "question4": ["  What was the theme of this year's Indian  Science Congress", "   Science and technology", "  Rural Development   "], "question5": ["  The World Health Organisation (WHO) selected  the year 2020 as the ﬁYear of the Nurse and  Midwifeﬂ to commemorate the birthday of  which person", "   Florence Nightingale   "], "question6": ["  Florence Nightingale was famous  nurse,  statistician, and social reformer from which  country", "  Britain   "], "question7": ["  What was the popular name given to Florence  Nightingale", "   Lady with the lamp   "], "question8": ["  India for the first time has been ranked among  the top ten in the Climate Change Performance  Index. What is  India's rank", "  9th   "], "question9": ["  Which country has been ranked at the top for  best efforts in climate control as per the  Climate Change Performance Index", "  Sweden   "], "question10": ["  The Reserve Bank launched mobile app ‚MANI™  for what purpose", "  To help the visually  challenged identify the  denomination of  currency notes   "], "question11": ["  What is the full form of acronym MANI", "  Mobile  Aided Note Identifier   "], "question12": ["  Can the MANI app be used for detecting the  fake currency", "  No   "], "question13": ["  As per the Swachh Survekshan League 2020 for  assessing the cleanliness level of 4,372 cities,  which city topped the survey", "  Indore   "], "question14": ["  Which bank has decided to introduce a one - time password for every cash withdrawal of Rs.  10,000 and above from its ATMs betw een 8 am  and 8 pm", "  State Bank of India   "], "question15": ["  Who are the only two Indians in Wisden™s T20  International team of the decade", "  Virat Kohli  and JaspritBumrah   "], "question16": ["  What is the name of the e - auction platform  launched to facilitate online auction of assets  attached by ban ks", "  eBkray   "], "question17": ["  Name the NASA Astronaut who created a new  record for thelongest single spaceflight by a  woman.  Christina Koch   "], "question18": ["  Which organization recently released its  biannual report ﬁIndia State of Forest Report  2019ﬂ", "  The Forest Survey of India   "], "question19": ["  As per recent data, forest and tress cover  roughly _____ per cent of the total geographic  area of the country", "  25   %   "], "question20": ["  Areawise, _______ has the largest forest cover,  followed by     ArunachalPraesh and  Chhattisgarh", "  Madhya Pradesh   "], "question21": ["  In terms of forest cover as  a percentage of total  geographical area,   with 85.41% area under  forest, _________ is at the top", "  Mizoram   "], "question22": ["  General Bipin Rawat has been named as India™s  first ___________ of India, a post created for the  first time in India", "  Chief of Defence Staff   "], "question23": ["  As Chief of Defence Staff, General Rawat will  also head the new Department of _________", "  Military Affairs   "], "question24": ["  Which apex organization released the  Sustainable Development Goals (SDGs) Index  for the year 2019 - 20", "  NITI Aayog   "], "question25": ["  SDGs Index developed by NITI Aayog  is based  on 17SDGs formulated by which global  organization", " UNO - United Nations  Organization   "], "question26": ["  Which state topped the SDGs index", "  Kerala   "], "question27": ["  Government has decided to waive the MDR  w.e.f. Jan1, 2020 on all digital transactions  using RuPay or UPI platform to prom ote digital  payments. What is full form of MDR", "  Merchant  Discount Rate    "], "question28": ["  Govt. has clarified that MDR charge on credit  cards transactions will continue to be up to  ___________% of the transaction amount", "  2%   "], "question29": ["  Which country recently launched the world™"]}, {"page": 96, "question0": ["  Name the 32 year old Grandmaster from  Andhra, who won the Women™s World Rapid  Championship 2019 in Moscow", "  Koneru  Humpy   "], "question1": ["  Rohtang Tunnel, one of the longest high  altitude tunnels, was in news recently for what  reasons", "  It has been renamed as Atal Tunnel   "], "question2": ["  The Atal Tunnel passes through which range of  Himalayas", "  PirPanjal   "], "question3": ["  The Atal Tunnel connects _______ in Himachal  Pradesh wi th _________ in Ladakh", "  Manali, Leh   "], "question4": ["  Which country deployed recently its  hypersonic missile Avangard, capable of  catching speeds up to 33,000 kmph", "  Russia   "], "question5": ["  Which railway station recently was in news for  offering its passengers the facility of an Oxygen  Parlor", "  Nashik   "], "question6": ["  As per the statistics compiled by the US  National Science Foundation, which country  contributes largest number of scientific articles,  accounti ng for 20.67 per cent of their total  publications", "  China    "], "question7": ["  What is India's rank in terms of its contribution  in the publication of scientific articles", "  3rd  -   5.31%    "], "question8": ["  What is the full form of FICCI", "   Federation of  Indian Chambers of Commerce & Industry,  Sang ita Reddy,   elected as the new President  of the FICCI for 2019 - 20.   "], "question9": ["  Where are the headquarters of FICCI", "  New  Delhi   "], "question10": ["  Which Indian district won the UNICEF 2019  Award for effective implementation of Swachh  Bharat Mission in water sanitation and hygiene  sectors", "  Kamareddy district of Telangana   "], "question11": ["  Niranjan Hiranandani has been elected as the  new President of which apex trade a nd  industry  organization", "  Assocham   "], "question12": ["  Niranjan Hiranandani is associated with which  industry", "  Real estate    "], "question13": ["  What is the full form of Assocham", "  Associated  Chambers of Commerce & Industry of India   "], "question14": ["  India™s first long - distance CNG bus fitted with  CNG (compress ed natural gas) cylinders will  run from New Delhi to which other place", "  Dehradun    "], "question15": ["  American Academy of Ophthalmology has  selected which Indian doctor for its \"Life  Achievement Honour\"", "   Dr Santosh G  Honavar   "], "question16": ["  Indian Railways has started ﬁHim Darshan  Express ﬂ, a glass - enclosed vistadome train on  which heritage route", "  Kalka  -   Shimla route   "], "question17": ["    The National Tribal Dance Festival was held in  which place in Chhattisgarh", "  Raipur   "], "question18": ["  Who was declared as the ‚Most Famous  Teenager in the World™ by the United Nations in  its 'Decade in Review' report", "  Malala  Yousafzai   "], "question19": ["  Who has been elected as the new Chief Minister  of Jharkhand", "  Hemant Soren   "], "question20": ["  The country™s first university for transgender  community will be opened in Kushinagar  district of which state", "   Uttar Pradesh   "], "question21": ["  As per the recently release ﬁGood Governance  Indexﬂ, ___________ secure the first position  among the Indian states", "  Tamil Nadu    "], "question22": ["  Government launched which scheme aimed at  improving the groundwater management in  seven states", "  Atal Bhujal Yojana (ATAL JAL)   DECEMBER 2019 "], "question23": ["  Manuel Marrero Cruz has been appointed the  _______ of Cuba by the President of Cuba", "  Prime  Minister "], "question24": ["  Eight West African countries have announced  the adoption of a new common currency named  _______ in place of currently prevalent CFA Franc  to end the sign of French dominance from the  region", "  Eco "], "question25": ["  FanniMikó, beauty queen of ____________  won the  Miss Interc ontinental 2019 ", "Hungary "], "question26": ["  The International Tennis Federation has named  World Champions in singles for 2019.  Who  won the men™s title", "  RafaelNadal of Spain "], "question27": ["  The women™s singles title for ITF world  champion was won by whom", "   Ashleigh Barty  of Australia "], "question28": ["  Integral Coach Factory (ICF) of Indian Railways  has produced record 3000 Coaches in record  215 days.     Where is this factory", "  Chennai "], "question29": ["  Who is the first Indian to win the Miss Teen  International title for the first time in the2"]}, {"page": 97, "question0": ["  Which country's football team has been  crowned     \"FIFA's Team of the Year\" for  finishing at the top of the world rankings for  the second year in a row", "  Belgium "], "question1": ["  Why December 24 has been selected to  celebrate the National Consumer Day in   India", "  On this day, the Consumer Protection Act,  1986 had received the assent of the  President  "], "question2": ["  India celebrates National Farmers' Day  (KisanDiwas) to commemorate the birthday of  which veteran farmer leader", "  Chaudhary  Charan Singh  "], "question3": ["  Devesh Srivastava   has been appointed as the  Chairman and Managing Director of which  public sector insurance company", "  General  Insurance Corporation of India (GIC Re)  "], "question4": ["  International Human Solidarity Day is observed  on which day of December", "  20th  "], "question5": ["  Name the Ne w - York based international credit  rating agency that cut its growth forecast for  India to 4.6% for the 2019 - 20 fiscal", "  Fitch  ratings  "], "question6": ["  In a landmark achievement which African  country launched its first satellite on Dec 20", "  Ethiopia  "], "question7": ["  S. MirabaiChanu won the gold medal at the 6th  Qatar International Cup in Doha in which field", "  Weight Lifting  "], "question8": ["  Asian Development Bank approved a $490  million loan to upgrade about 1,600 kilometres  of state highways and major district roads in  which state", "  M adhya Pradesh   "], "question9": ["  India successfully test - fired Pinaka missiles  from its Integrated Test Range in Chandipur in  Odisha. It is what type of missile", "  GuidedRocket System   "], "question10": ["  DRDO successfully test fired its QR - SAM missile  recently. What is the full form of QR - SAM ", "  Quick Reaction Surface - to - Air Missile  "], "question11": ["  In a novel initiative, which Municipal  Corporation recently launched India™s first  online waste exchange platform and app", "  Chennai  "], "question12": ["  With which country India conducted a 2+2  dialogue on Dec 18", "  USA  "], "question13": ["  Which two ministe rs from each country  participated in the Indo - US ministerial 2+2  dialogue", "  Defence Minister and Foreign  Minister  "], "question14": ["  Which 3 tech giants have joined hands to  develop a framework titled ‚Connected Home  over IP™ for better compatibility among their  smart home p roducts", "  Amazon, Apple and  Google  "], "question15": ["  What is the name of the smart voice based  services developed by the Amazon, Apple and  Google", "   Amazon Alexa, Apple Siri and Google  Assistant  "], "question16": ["  _______ has become the 3rd Indian firm and the  first Indian bank to cross $100  billion mark in  market capitalization", "   HDFC Bank  "], "question17": ["  Name the Prime Minister of Portugal who came  to India for two - days in Dec. 2019", "  Antonio  Costa  "], "question18": ["  Which country announced the launching of a  ﬁGandhi Citizenship Education Prizeﬂ in the  honour of Gandhian valu es", "  Portugal  "], "question19": ["  Name the celebrity who secured the first  position in the Forbes India™s Celebrity - 100 list", "  Virat Kohli  "], "question20": ["  Mind Master is the title of the autobiography of  which legendary chess player", "  Viswanathan  Anand  "], "question21": ["  \"Phir Meri Yaad\" is a popular book  written by  which author", " Dr. Kumar Vishwas  "], "question22": ["  Who is the author of the famous novel \"Raavan", "  Enemy of Aryavarta\"", "  Amish Tripathi  "], "question23": ["  Recently, there was a headline in the business  section of the newspaper \"PSA group and Fiat  announce merger\". The news relates to   which  industry", "  Automobiles   "], "question24": ["  India successfully conducted trials of two  variants of supersonic cruise missile BrahMos.  The air force variant was fired from which  fighter jet", "  SU - 30MKI Sukhoi  "], "question25": ["  Which state Police was honoured with  ‚President™s Colours™ for their outstanding  services, the highest honour given to a police  force in India", "  Gujarat  "], "question26": ["  Name the England cricketer who has been  voted ﬁBBC Sports Personality of the Year - 2019ﬂ", "  Ben Stokes   "], "question27": ["  O ne of the oldest and most esteemed classical  music festivals in India, the ‚TansenSamaroh™  was held in which place", "  Gwalior, Madhya  Pradesh  "], "question28": ["  The Union government launched National  Broadband Mission to provide Broadband  access to all ________ by 2022", "  Villa ges  "], "question29": ["  What is the theme of this year's International  Migrants Day observed on December 18", "  #We  together  "], "question30": ["  In a landmark ruling, the National Compan"]}, {"page": 98, "question0": ["  Which Indian paramilitary force has started a  dedicated matrimonial site for its staff", "  Indo - Tibetan Border Police (ITBP)  "], "question1": ["  The recently released Gender Gap Index - 2019  by the World Economic Forum, what is the rank  of India", "  112th  "], "question2": ["  Which country has been ranked as the most  appropriate country for women representation  in the Gender Gap Index - 2019", "  Iceland  "], "question3": ["  RBI has asked the banks to waive off service  charge on online usage of which of its  remittance facility", "  NEFT  "], "question4": ["  The free NEFT  service will be available from  which date", "   January 01, 2020  "], "question5": ["  The free NEFT service will be available to  which category of customers", "  Savings Bank  Account Holders  "], "question6": ["  DSC Prize for South Asian Literature 2019 was  won by which author", "  Amitabha Bagchi  "], "question7": ["  Amitabha  Bagchi won the DSC Prize for South  Asian Literature 2019 for which novel", "  Half  The Night Is Gone  "], "question8": ["  Which corporate emerged at number one spot  in terms of revenue generated in   2018 - 19,  ending the state - owned Indian Oil  Corporation's 10 - year reign as India™s  largest  company", "  Reliance Industries Ltd.  "], "question9": ["  KentoMomota, world no. 1 won his 11th  badminton title of the year at the BWF World  Tour Finals. He is from which country", "  Japan  "], "question10": ["  Who is the world's new number one women's  badminton champion", "  Chen Yufei (China)  "], "question11": ["  Th e Supreme Court ruled that states which  have districts where more than _____ cases of  child abuse under POCSO Act should establish  at least 2 special courts in each such district", "  300  "], "question12": ["  Which country recently elected its former  Prime Minister, AbdelmadjidTebboune as its  new President", "  Algeria  "], "question13": ["  Who has been appointed as the next chief of the  Indian Army in the rank of General", "  Lt Gen  Manoj Mukund Naravane  "], "question14": ["  Miss Toni - Ann Singh bagged which  beauty  crown at a ceremony held in London", "  Miss  World 2019  "], "question15": ["  Lakshya Sen notched up his fifth title of the  season, claiming the men™s singles crown at the  Bangladesh International Challenger   Cup in  which sports", "  Badminton   "], "question16": ["  Rohit Sharma, noted cricketer has   been  appointed as the brand ambassador of the  which top Spanish Football Club", "  La Liga  "], "question17": ["  Noted Hindi author and SahityaAkademi  awardee 71 year oldNasera Sharma recently  won which top literary award", "  Vyas Samman  "], "question18": ["  Nasera Sharma won the Vyas Samman for  which novel", "  Kaagaz Ki Naav  "], "question19": ["  India celebrates Vijay Diwas on December 16 to  commemorate its victory in which war", "  1971  Pakistan War  "], "question20": ["  Which day is organized by Energy Efficiency  Bureau on Dec 14", " National Energy  Conserva tion Day  "], "question21": ["  Name the Indian politician who has been  ranked 34th in the Forbes' 100 Most Powerful  Women List  -   2019", "  Nirmala Sitharaman  "], "question22": ["  Name the British political leader who led his  party to victory in the recent General elections  held on December 13", "  Boris  Johnson  "], "question23": ["  Which apex national organization has identified  138 Indian monuments as ﬁMust - See  Monumentsﬂ", "  Archaeological Survey of India  "], "question24": ["  The Citizenship Amendment Act, 2019  passed  by the Parliament aims to   grant Indian  citizenship to people of which 6 relig ions", "  Hindu, Christian, Sikh, Parsi, Jain, and  Buddhist  "], "question25": ["  The Asian Development Bank (ADB) has  sharply scaled down its projection for India's  economic growth to ______ in 2019 - 20 from  6.5%to ", " 5.1%  "], "question26": ["  Name the veteran opener from Maharashtra  who became the fir st player in India cricket to  feature in 150 Ranji matches", "  Wasim Jaffer  "], "question27": ["  Name the 14 year old Grandmaster from  Chennai who won the FIDE Open category of  the London Chess Classic", "  R. Praggnanandhaa  "], "question28": ["  Who has been selected  as 'Person of the Year'  for the yea r 2019 by the Time", " Greta Thunberg  "], "question29": ["  The National Anti Doping Agency (NADA) has  selected which Bollywood celebrity as its brand  ambassador", "  Suniel Shetty  "], "question30": ["  The Lok Sabha passed the Constitution (126th)  Amendment Bill. It is related to which issue", "  Extending  the reservation quota for SCs and  STs in the Lok Sabha and the state  assemblies by another 10 yearsupto Jan  25,2030  "], "question31": ["  ISRO launched earth observation satellite  named _________ along with nine foreign  satellites aboard PSLV - C48", "  RISAT - 2BR1  "], "question32": ["  India entered the   top ten countries group i"]}, {"page": 99, "question0": ["  This year's Climate Change Performance Index  is topped by which country", "  Sweden  "], "question1": ["  Which international day is observed on  December 11 with support from UNO t o  encourage sustainable development in  mountains all over the world", "  International  Mountain Day  "], "question2": ["  Which country topped the medal tally at the  13th South Asian Games", "  India  "], "question3": ["  Which city of United Arab Emirates - UAE has  been selected as the world™s leading spor ts  tourism destination", "  Abu Dhabi  "], "question4": ["  Export - Import Bank of India (Exim Bank)  provided $500 million (Rs.3561 crore) Line of  Credit to which country for funding the  defence - related procurement", "  Bangladesh  "], "question5": ["  Which US retail major has announced that it  will train   50,000 entrepreneurs from the micro,  small & medium enterprises (MSME) sector in  India", "  Walmart  "], "question6": ["  George J. Laurer,   the engineer whose invention  transformed handling of products in retail and  other industries around the world, died at the  age of 94. What was his invention", "  Bar Code  "], "question7": ["  India's ranking in the Human Development  Index 2019 improved marginall y by ______ rank  to 129 this year", "  One  "], "question8": ["  The Human Development Index is associated  with which UN agency", "  UNDP - United Nations  Development Programme  "], "question9": ["  The Human Development Index - 2019 is topped  by which country", "  Norway  "], "question10": ["  The World Anti - Doping Agency, WADA, bann ed  which country for four years,   from  participation in global sporting events", "  Russia  "], "question11": ["  The headquarters of WADA are located in  which city", "  Montreal Canada  "], "question12": ["  The Paika rebellion, a 200 - year - old armed  revolt in 1817 against the British East India  Company took   place in which state", "  Odisha  "], "question13": ["  The UNO promotes the celebration of Human  Rights Day on which date of December", "  10  "], "question14": ["  The Indian Navy celebrates National Submarine  Day on Dec 09 to commemorate the induction  of the first submarine. What was its name", "  INS  Kalva ri  "], "question15": ["  Who is Britain™s top boxer who reclaimed his  world heavyweight crown from Andy Ruiz of  America", "  Anthony Joshua  "], "question16": ["  Which country elected Sanna Marin as the  youngest Prime Minister of the world", "  Finland  "], "question17": ["  MissEarth 2019 crown was won by  Nellys  Pimentel. She   hails from", " Puerto Rico  "], "question18": ["  Miss ZozibiniTunzi, a black beauty from South  Africa created waves by winning the __________  crown at Atlanta USA", "  Miss Universe 2019  "], "question19": ["  As per the recent RBI guidelines, the NEFT  facility will now have how many settlement  batches", "  4 8  "], "question20": ["  Aberdeen Police station has been declared as  the best police station of the country. It is at  which place", "  Andaman Nicobar Islands  "], "question21": ["  A total 799 Van DhanVikas Kendra in the 24  states have been opened till date, for the  benefit of which community", "  Forest  Tribals  "], "question22": ["  Fitness and wellness application by which  actress was awarded Google Play's Best App of  2019 in the ''Personal Growth'' category", "  Shilpa Shetty  "], "question23": ["  Name the legendary Swiss tennis player who  became the first living person in Switzerland to  have a coi n minted in his honour", "  Roger  Federer  "], "question24": ["  The RBI recently released guidelines for ‚on  tap™ licensing of which type of banks in the  private sector", "  Small Finance Bank  "], "question25": ["  What is the minimum capital requirement for  setting up a Small Finance Bank", "  Rs.200 crore  "], "question26": ["  The Saudi Aramco was in news in the first week  of December, 2019 for what reasons", "  It came  out with world's largest IPO for $25.6 billion  "], "question27": ["  What is the name of the joint military exercise  of India and Russia held in December", "  Indra   "], "question28": ["  Indra  -   the joint military exercise of India and  Russia was hosted by which country", "  India   "], "question29": ["  Which national day is observed on Dec. 07 to  express gratitude to the martyrs who sacrifice  their lives for safeguarding the country™s  honour", "  Armed Forces Flag Day   "], "question30": ["  Name the Chess Grandmaster from Chennai  who became the youngest Indian to cross the  Elo rating     of 2,600", "  R Praggnanandhaa   "], "question31": ["  Which Indian celebrity was awarded the Danny  Kaye Humanitarian Award from UNICEF for  supporting the cause of UNICEF", "  Priyanka  Chop ra   "], "question32": ["  Name the railway   station that became the first  station to get the ‚Eat Right Station™ certification  with four stars rating by the FSSAI", "  Mumbai  Central   "], "question33": ["  What is the name of the 8th Indo - China joint  training military exercise held at Umroi,  Meghalaya in December", "  Hand in Hand 2019   "], "question34": ["  All the Members of Parliament (MPs"]}]