[{"page": 73, "question0": ["  The World Bank teamed up with which bank to  enable  recording of secondary market bond  trading using blockchain technology", "   Commonwealth Bank of   Australia  "], "question1": ["  Cyril Ramaphosa has been re - elected as the  President of which country", "  South Africa   "], "question2": ["  Indian Air Force successfully fired the BrahMos  air version missile recently from which of its  aircraft", "  Su - 30 MKI fighter aircraft  "], "question3": ["  Pakistan appointed which senior diplomat as the  High Commissioner to India", "  Mueenul Haq  "], "question4": ["  The eighth edition of the Indo - Mya nmar  coordinated patrol (IMCOR) was held near which  place", "  Andaman and Nicobar Islands  "], "question5": ["  Niki Lauda,   the three - time world champion of  ________ from Austria, passed away at the age of  70", "  F1 Racing     "], "question6": ["  Name the 29 year old American   who   recently   reached the top of world rankings in professional  golf", "  Brooks Koepka  "], "question7": ["  Kapil Sharma, popular comedian - actor was in  news recently for what reasons", "  He   has been  acknowledged as the most viewed stand - up  comedian in India and abroad by the World  Book of Record s, London.  "], "question8": ["  Order of the Rising Sun, Gold and Silver Star is the  2nd highest national award of which country", "   Japan   "], "question9": ["  Name the Indian diplomat recently honoured  with the above award", "  Shyam Saran, former  Foreign Secretary of India   "], "question10": ["  The International Day for Biological Diversity is  observed on which date", "  May 22  "], "question11": ["  What was the theme for this year's International  Day for Biological Diversity", "  ﬁOur Biodiversity,  Our Food, Our Healthﬂ  "], "question12": ["  On which day of May the World Turtle Day is  celebrati ng", "  23rd   "], "question13": ["  Which company has toppled govt owned Indian  Oil Corporation (IOC) to become the country™s  biggest company in terms of revenue and net  profit", "  Reliance Industries  "], "question14": ["  Which two countries are hosting the ICC ODI  world Cup (men™s)", "  Great Britain and W ales  "], "question15": ["  How many teams are competing in the ICC ODI  world Cup (men™s)", "  10  "], "question16": ["  Man Booker International Prize is given for  outstanding work in which field", "  Best book  translated in  to  English   and published in UK  "], "question17": ["  Who won the Man Booker International Prize for  2019", "  Jokha Alharthi for her novel Celestial  Bodies  "], "question18": ["  Jokha Alharthi hails from which country", "  Oman  "], "question19": ["  ISRO recently launched its radar imaging earth  observation satellite. What is its name", "  RISAT - 2B  "], "question20": ["  The data from RISAT - 2B shall be used for what  purpose", "  For the Armed Forces, agriculture  forecasters and disaster relief agencies  "], "question21": ["  The telecom major BSNL  -   Bharat Sanchar Nigam  Ltd. partnered with ____ to increase access to its  WiFi footprint in the countr y", "  Google  "], "question22": ["  The world body governing Badminton, BFA, has  launched ____ new formats of the game", "  Two  "], "question23": ["  What are the 2 new formats of badminton  launched by the BFA", "  Air Badminton and  Triples   "], "question24": ["  The World Metrology Day is observed on May  20th. What is metrology", "   The science of making  measurements and establishing various units  of measurements  "], "question25": ["  Which International Day is celebrated to raise  awareness of the importance of pollinators (such  as bees, butterflies, bats and hummingbirds)", "  World Bee Day, May 20    "], "question26": ["  ______ _ became the first state to tap into masala  bond market", "  Kerala  "], "question27": ["  Kerala listed the Kerala Infrastructure Investment  Fund Board (KIIFB)™s masala bond worth of $312  million (Rs 2,150 crore) in which stock exchange", "  London  "], "question28": ["  Which popular measurement unit of weight was  recently re - defined in terms of unchanging  universal, physics constants", "  Kilogram      "], "question29": ["  Recently USA threatened which country saying  that a military confrontation with America would  ﬁbe its official end\"", "  Iran       "], "question30": ["  What is the main bone of contention behind the  soaring tensions between USA and Iran", "  Alleged  violations of nuclear ban treaty by Iran  "], "question31": ["  Joko Widodo has been re - elected as the President  of which country", "  Indonesia   "], "question32": ["  India delivered the first pair of Russi a made Mi - 24  attack helicopters to the Air Force of which  country", "  Afghanistan    "], "question33": ["  Sasakawa Award 2019 for Disaster Risk  Reduction is conferred by which international  organization", "  UN Office for Disaster Risk  Reduction (UNDRR), Geneva  "], "question34": ["  Name the Indian civil  servant recently honoured  with the Sasakawa Award 2019 for Disaster Risk  Reduction", "  Dr. Pramod Kumar Mishra,  Additional Principal Secretary to Prime  Minister of India  "], "question35": ["  Name the tennis star who won the Italian Open  2019", "  Rafael Nadal of Spain    "], "question36": ["  The Indian Navy held a major bilateral naval  exercise with the Republic of Singapore Navy. Can  you name it", "  SIMBEX 19      "], "question37": ["  SIMBEX 19 naval exercise was held at whic"]}, {"page": 74, "question0": ["  National Dengue Day is observed in India on  which day of May", "  16  "], "question1": ["  D engue is a viral disease caused by    dengue virus  transmitted by bite of _____ mosquito", "  Aedes  aegypti  "], "question2": ["  Which day marks the anniversary of the signing of  the first International Telegraph Convention and  the creation of the International  Telecommunication Un ion on this day in 1865", "  World Telecommunication & Information  Society Day  "], "question3": ["  Which Arabian country has for the first time  approved a scheme that permits permanent  residency to certain expatriates, allowing them to  own real estate in the kingdom and reside with  their families,    without a local sponsor", "  Saudi  Arabia    "], "question4": ["  _________ became 1st country in Asia to pass  a law  that grants legal sanction to same - sex marriage", "  Taiwan    "], "question5": ["  Observation of the International Day of Light on  May 16 is supported by which UN organization", "  UNESCO    "], "question6": ["  What is the full form of UNESCO", "  United Nations  Educational, Scientific and Cultural  Org anization  "], "question7": ["  Where are the headquarters of UNESCO", "  Paris  "], "question8": ["  Which global day is celebrated on May 17 to raise  awareness about high blood pressure in people  across the world", "  World Hypertension Day  "], "question9": ["  What is the general blood pressure levels range", "  Between 120/8 0 to 140/90  "], "question10": ["  What is the theme for this year's world  hypertension day", "  Know your numbers  "], "question11": ["  Which big country has recently rolled out a merit - based immigration system to grant residency  based on points for their age, knowledge, job  opportunities and civic se nse", "  USA  "], "question12": ["  Commandos of which premier counter - terror  force created history by scaling the Mount Everest  on May 16 in their maiden attempt", "  NSG  -   National Security Guard    "], "question13": ["  Exercise Bullstrike was conducted between  armed forces of which country", "  Only India  "], "question14": ["  Exercise Bullstrike was conducted at which place", "  Teressa island near Andamans  "], "question15": ["  Which train was in news recently for competing 1  lakh running kilometres on May 16, without  missing a single trip in just three months of its  launch", "  Vande Bharat Express    "], "question16": ["  Cap tain Aarohi Pandit, 23 - year - old pilot from  Mumbai became the world's first woman in what  regard", "  To cross the Atlantic Ocean solo in a  Light Sports Aircraft  "], "question17": ["  The RBI has asked all NBFCs with asset size of  over Rs. 5,000 crore to appoint chief risk officers   for what purpose", "  To minimize risk associated  with all the loan products  "], "question18": ["  Researchers in which country have reportedly  created recyclable plastic", "  USA  "], "question19": ["  What name has been given to the recently created  recyclable plastic", "  Poly diketoenamine, or PDK  plastic     "], "question20": ["  A species of new vine snake has recently been   discovered in the eastern part of_________, after a  century or so", "  Odisha  "], "question21": ["  Victor Vescovo, 53 years old diver and deep sea  explorer from USA broke the world record for  which item", "  Deepest dive in history,  diving  down to 10,927 meters    "], "question22": ["  Where is the deepest (in ocean) point on the  earth", "  The Challenger Deep in Mariana Trench  in Western Pacific ocean  "], "question23": ["  Digital payments company Paytm launched its  first credit card called ﬁPaytm First Cardﬂ in  association with w hich bank", "  Citibank  "], "question24": ["  The International Day of Families is observed on  which day of May", "  15th  "], "question25": ["  Name the sherpa who reached the top of Mt  Everest for the 24th time, creating a new world    record", "  Kami Rita Sherpa    "], "question26": ["  The Geological Survey of India, GSI, has rev ealed  that 35 per cent the country's Graphite deposits is  available in __________", "  Arunachal Pradesh   "], "question27": ["  Graphite is used widely in which two ways in the  automobile industry", "  Lubricants and brake  linings    "], "question28": ["  Which organization released a vision document  for ensuring a safe, secure, convenient, quick and  affordable e - payment system", "  Reserve Bank of  India   "], "question29": ["  Which organization has directed 18 States and 2  Union Territories to submit their respective  action plans o n utilisation of treated wastewater  to reduce pressure on the groundwater  resources", "  National Green Tribunal     "], "question30": ["  India has been selected to the Consultative Group  (CG) of Global Facility for Disaster Reduction and  Recovery. Where are its headquarters", "  Washin gton DC, USA   "], "question31": ["  Which global financial giant manages and  supports activities of Global Facility for Disaster  Reduction and Recovery", "  World Bank     "], "question32": ["  India recently extended a $1 billion Line of Credit  through EXIM bank to which country", "  Mongolia      "], "question33": ["  India extend ed a $1 billion Line of Credit to  Mongolia for what purpose", "  To set up its first - ever petrochemical refinery   "], "question34": ["  World™s first exclusive women's cricket magazine  was recently released in India. What is its title", "  'Criczone'"]}, {"page": 75, "question0": ["  Chhaya Sharma, an IPS officer was felicitated with  McCain Institute Award 2019 for courage and  leadership. She is known for investigation of  which infamous case", "  Nirbhaya rape case, 2012   "], "question1": ["  G S Lakshmi has become the first ever woman to  be appointed to the _ ______.", "  ICC International  Panel of Match Referees   "], "question2": ["  The DRDO successfully flight tested the drone  ABHYAS. What is it", "  a High - speed Expendable  Aerial Target (HEAT)   "], "question3": ["  Department of Biotechnology under ministry of  science and technology recently launched human   tissue mapping project. What is its name", "  ﬁMANAV", " Human Atlas Initiativeﬂ   "], "question4": ["  Researchers have found a new ‚rain loving™ snake  species named ﬁSmithophis Atemporalisﬂ in  _________ in North - east India", "  Mizoram   "], "question5": ["  The Indian Air Force has received the first Apach e  Guardian helicopter from which company", "  Boeing USA   "], "question6": ["  Apache Guardian is what type of Helicopter", "  Multi  role attack helicopter    "], "question7": ["  Prof. Tijjani Mohammed Bande has been elected  as the president of which international forum", "  UN  General Assembly   "], "question8": ["  Prof. Bande is a senior politician and career  diplomat of which country", "  Nigeria   "], "question9": ["  Which women cricketer created world record of  securing  highest number of wickets by a spinner  in ODI cricket", "  Sana Mir, Pakistan      "], "question10": ["  Who has been appointed as the Coach for I ndian  men™s football team", "  Igor Stimac, Croatia    "], "question11": ["  World celebrates International Nurses Day on  May 12 to commemorate the birth anniversary of  which famous person", "  Florence Nightingale   "], "question12": ["  Who was Florence Nightingale and she became  famous for what work", "  Briti sh social worker  who rendered outstanding nursing services  during the war of Crimea in late 19th century   "], "question13": ["  A new species of reddish - brown pit viper snake  has been found in_________, having a unique heat - sensing system", "  Arunachal Pradesh   "], "question14": ["  As per the CEAT Cricket Rating International  Awards 2019, ________ won the award for  International Cricketer and Batsman of the Year", "  Virat Kohli     "], "question15": ["  _______ won the International Bowler of the Year  award in the CEAT Cricket Rating International  Awards 2019", "   Jasprit Bumrah   "], "question16": ["  The World Trade Organisation, WTO™s ministerial  meeting of developing countries was held in  which place", "  New Delhi     "], "question17": ["  _______ has been appointed as the new Chairman of  the ITC company", "  Sanjiv Puri     "], "question18": ["  What is the full form of ITC", "  Indian Toba cco  Company     "], "question19": ["  Where are the headquarters of ITC", "  Kolkata     "], "question20": ["  Which International Day is observed twice, on  2nd Saturday of May and October 2 highlight the  need for the conservation of migratory birds and  their habitats", "  World Migratory Bird Day      "], "question21": ["  Name the n oted industry leader and ITC chairman  who passed away in second week of May", "  Y C  Deveshwar     "], "question22": ["  What was the major contribution of Y C  Deveshwar in the ITC that stood as its turning  point", "  He transformed the cigarette major into  a diversified player with  interests in FMCG,  hospitality, IT and other sectors   "], "question23": ["  Mumbai Indians became IPL champions for the  fourth time after defeating which team", "  Chennai  Super Kings   "], "question24": ["    India celebrates May 11 as the National  Technology Day to commemorate which major  event", "  Conduct ing of Pokhran nuclear Tests  (Shakti Pokhran II) of 1998   "], "question25": ["  Dia Mirza, the Indian actress has been appointed  as the Goodwill Ambassador for India for which  UN programme", "  UN Environment programme      "], "question26": ["  The Indian Army is commemorating 2019 as the  __________ to r each out to the next of kin of battle  casualties, ex - servicemen and serving soldiers", "  Year of Next of Kin   "], "question27": ["  The 5th United Nations Global Road Safety Week  was celebrated from May 6 to 12. What was its  theme", "  Leadership for road safety     "], "question28": ["  Popular milk products brand Amul has decided to  be the principal sponsor of which international  cricket team for the upcoming world cup", "  Afghanistan   "], "question29": ["  Which country declared climate emergency in  2nd week of May", "  Ireland     "], "question30": ["  What is the objective of declaring climate  emergency in a country", "  To achieve drastic  reduction in green house gas emissions   "], "question31": ["  Which country recently reported the first ever  case of the Monkeypox Virus, a rare virus similar  to the human smallpox", "  Singapore   "], "question32": ["  Reliance Industries Ltd. (RIL) acquired one of the  oldest companies, British toy retailer __________ in  a all cash deal", "  Hamleys   "], "question33": ["  Which state for the first time has inducted an all  women platoon of 30 commandos as anti naxal  force", "  Chhattisgarh     "], "question34": ["  What is the name of the all women platoon of 30  commandos recently inducted in Chhattisgarh", "  Danteshwari Ladake   "], "question35": ["  India was re - elected as Observer to the Arctic  Council. Where is its headquarters", "  Tromso,  Norway   "], "question36": ["  World over May 8 is celebrated as Internatio nal  Thalassaemia Day. This is what type of decease"]}, {"page": 76, "question0": ["  Jagjit Pavadia has been   re - elected by the UN  Economic and Social Council to a five - year term  on which of its outfit", "  International Na rcotics  Control Board   "], "question1": ["  World Red Cross Day is observed on which date", "  May 8   "], "question2": ["  The World Red Cross Day is celebrated to  commemorate the birthday of founder of Red  Cross. Who was he", "  Henry Dunant     "], "question3": ["  Where is the headquarters of Red Cross", "  Geneva,  Switzerland   "], "question4": ["  What is the theme for this year's World Red Cross  Day", "  #Love      "], "question5": ["  Vice President Venkaiah Naidu embarked on a  four - day official visit to _____ on May 9", "  Vietnam   "], "question6": ["  Which organization distributed more than    one  lakh bee boxes to the farmers and unemployed  peopl e recently", "  KVIC - Khadi and Village  Industries Commission      "], "question7": ["  Which state has notified a new act as per which  commercial establishments in certain specified  areas will now be allowed to operate 24 hours", "  Gujarat     "], "question8": ["  Which international body supports the  celebr ation of World Asthma Day", "  Global  Initiative for Asthma, USA     "], "question9": ["  What is the theme for this year's World Asthma  Day", "  STOP for Asthma   "], "question10": ["  What is the full form of STOP", "  Symptom  evaluation, Test response, Observe and assess,  Proceed to adjust treatment   "], "question11": ["  Asthma effects which vital system of the human  body", "  Respiratory system     "], "question12": ["  The Reserve Bank has decided to enhance the  housing loan limits for priority sector for which  banks", "  Regional Rural Banks (RRBs) and Small  Finance Banks (SFBs)     "], "question13": ["  As per new RBI guidelines, RRBs and SFBs can  give housing loan to individuals up to Rs. ____ lakh  in metropolitan centers", "  35   "], "question14": ["  As per new RBI guidelines, RRBs and SFBs can  give housing loan to individuals up to Rs. ____ lakh  in other than metropolitan cent ers", "  25   "], "question15": ["  Uttarakahand is famous for its Chaardham Yatra  (Pilgrimage of four centres). Name the four  places", "  Gangotri and Yamunotri dhams and  Badrinath and Kedarnath dhams       "], "question16": ["  Govt. has launched FAME scheme for boosting  promotion of electric vehicles in the   country.  Expand the acronym FAME", "  Faster Adoption and  Manufacturing of Hybrid and Electric Vehicles     "], "question17": ["  Extremely severe cyclonic storm ______ made  landfall on the eastern coast wreaking  widespread destruction", "  Fani   "], "question18": ["  Which state suffered most on account of  cyclone  Fani", "  Odisha   "], "question19": ["  International organizations talked about which  particular aspect of cyclone Fani", "  Excellent  disaster management efforts by the local  administration       "], "question20": ["  World Laughter day is celebrated on _______  Sunday of May", "  First     "], "question21": ["  Saurav Ghoshal and    Joshna Chinappa won their  respective Asian Individual _________  Championship titles in Kuala Lumpur, Malaysia", "  Squash   "], "question22": ["  The fourth of Indian Navy™s stealth Scorpene class  Submarines, named _______ was launched at  Mazagon Dock Limited at  Mumbai", " ‚ INS Vela™   "], "question23": ["  INS Vela has been built in collaboration with  which country", "  France      "], "question24": ["  King Maha Vajiralongkorn has been crowned as  the new king of which country", "  Thailand   "], "question25": ["  King Maha Vajiralongkorn is the 10th king of  ______ dynasty founded in 1782", "  Chakri    "], "question26": ["  Which city in Karnataka has launched an all - women police patrol unit named ‚Rani Abbakka  Force™", "  Mangaluru     "], "question27": ["  INS Ranjit, Indian Navy™s frontline missile  destroyer of Russian origin was in news recently  for what reasons", "  It was decommissioned after  36 years of service      "], "question28": ["  Which Indian wrestler won the gold medal in  65kg freestyle in the Ali Aliyev Wrestling  Tournament in Kaspiysk, Russia", "  Bajrang Punia     "], "question29": ["  Which Indian scientist was honoured with  Chevalier de l'Ordre national de la Legion  d'Honneur award in 1st week of May", "  A S Kiran  Kumar   "], "question30": ["  Who is A S Kiran Kumar", "  Former Chairman   of  ISRO     "], "question31": ["  Which UN organization supports the celebrations  of the World Press Fr eedom Day on May 3", "  UNESCO   "], "question32": ["  Which international day is observed on May 2 to  highlight importance of a particular fish", "  World  Tuna Day     "], "question33": ["  The Central government has asked the state  transport departments to make it mandatory for  all EVs (electric vehicles) to   use only ______ colour  number plates", "  Green   "], "question34": ["  A postage stamp was released to commemorate  the 750th birth anniversary of Sri Vedanta  Desikan. He hailed from which country", "  Tamil  Nadu    "], "question35": ["  Researchers at__________, New Delhi, have  developed an ultrasensitive quantum  thermometer using graphene quantum dots", "  Jamia Millia Islamia   "], "question36": ["  Raheem Sterling   of ____ has been named th"]}, {"page": 77, "question0": ["  W hat is the name of the first part of the Indo - French joint naval exercise that was held off the  Goa coast", "  Varuna 19.1     "], "question1": ["  Which country became India™s top crude oil  supplier, meeting more than a fifth of the  country™s oil needs in 2018 - 19", "  Iraq   "], "question2": ["  Fifteen security personnel were martyred in a  land  - mine blast executed by Naxalites in  Gadchiroli district of which state", "  Maharashtra     "], "question3": ["  The U N Security Council designated Pakistan - based Jaish - e -   Mohammed chief as a \"global  terrorist\". What is his name", "  Masood Azhar   "], "question4": ["  Which country has announced its plans to move  its capital as the present capital is very heavily  congested and is sinking at one of the fastest rates  in the world", "  Indonesia,   (Capital Jakarta)   "], "question5": ["  As per the recent report from Sweden based  Stockholm International Peace Research Institute  (SIPRI), India was the world™s _____ biggest  military spender in 2018", "  Fourth     "], "question6": ["  As per a report by SIPRI, ______ is the biggest  military spender in the world", "  USA   "], "question7": ["  Which country announced its withdrawal from  the UN Arms Trade Treaty as it hinders its  citizen's right to bear arms", "  USA   "], "question8": ["  Which country hosted the Asian Wrestling  Championships", "  China     "], "question9": ["  India secured _____  position with 16 medals in the  Asian Wrestling Ch ampionships", "  8th   "], "question10": ["  Which country witnessed its first abdication of its  emperor in past 200 years", "  Japan      "], "question11": ["  What is the name of the new emperor of Japan", "  Naruhito   "], "question12": ["  Coronation of Naruhito as the emperor of Japan  marked the beginning of a new imperial era  named _________", "  Reiwa      "], "question13": ["  The Labour Day is celebrated on May 1 to  commemorate the Haymarket Massacre of May 4,  1886. Where this incident took place", "  Chicago,  USA      "], "question14": ["  Australia's _________   has become the first female  umpire to officiate in a men's one - day  international at the ICC World Cricket League", "  Claire Polosak   "], "question15": ["  Valtteri Bottas of team Mercedes won the  Azerbaijan Grand Prix F1 championship. He hails  from which coun try", "  Finland   "], "question16": ["  Which country topped the medal tally in the  International Shooting Sport Federation (ISSF)  World Cup, Beijing held in April end", "  India     "], "question17": ["  Which national organization launched the  'Malaria Elimination Research Alliance (MERA)  India' to eliminat e Malaria from India by 2030", "  Indian Council of Medical Research (ICMR)   "], "question18": ["  Who is the winner of this year's  National  Intellectual Property Award", "    Dr. Benny Antony   "], "question19": ["  Which bank launched India™s first ‚Green Car  Loan™ to encourage customers to buy electric  ve hicles", "  SBI   "], "question20": ["  Which author won the $10,000 Rabindranath  Tagore Literary Prize", "  Rana Dasgupta   "], "question21": ["  India won 13 medals at the Asian Boxing  Championship held in _______", "  Bangkok      "], "question22": ["  Name the India™s ace cueist who won the Asian  Snooker Tour title in Bengaluru", "  Pankaj Advani     APRIL  -   2019   "], "question23": ["  World Intellectual Property Day   is observed on  April   26, supported by   specialized UN agency  WIPO. What is  the full form of  WIPO", "    World  Intellectual Property Organization   "], "question24": ["  Where  is the h eadquarter of World Intellectual  Property Organization", "  Geneva, Switzerland   "], "question25": ["  The world's first - ever malaria vaccine was  launched  recently  in a pilot project in ________  , a  small country in south east Africa ", "  Malawi   "], "question26": ["  What is the name of the first ever malaria  vaccine   launched recently", "  RTS,S (trade name Mosquirix)   "], "question27": ["  The  World Malaria Day   is observed on which  date", "  April 25   "], "question28": ["  What is the theme of this year's World Malaria  Day", " Zero malaria starts with me   "], "question29": ["  The Reserve Bank h as become the first central  bank in the Asia - Pacific region to begin an explicit  interest rate easing cycle . What does it  imply ", "   Gradual reduction of Repo Rate   "], "question30": ["  In the recently concluded Asian Athletics  Championships in  Doha , what was India's rank in  medal tally", "  4th    "], "question31": ["  VolodymyrZelenskiy, recently elected as the  President of Ukraine, is  a  famous __ _______ _____ by  profession", "  Comedian   "], "question32": ["  Which country has successfully tested the world™s  first floating nuclear power plant -   ‚Akademik  Lomonosov™", "  Russia   "], "question33": ["  We celebrate April 24 as the National Panchayati  Raj Day.  Which amendment of constitution  provided constitutional status to Panchayati Raj  System", "  73rd   "], "question34": ["  There are how many tiers in the Panchayati Raj  System", "  Three   "], "question35": ["  What are the three tiers of the Panchayati Raj  institutions", "  (i) Gram Panchayat (ii)  Gram  Samiti (iii) ZilaParishad   "], "question36": ["  The Reserve Bank has divested its entire stake in  which of its   two organizations", "  National Housing  Bank and the National Bank for Agriculture  and Rural Development   "], "question37": ["  After disinvestment by RBI, which authority is the  is the sole owner of NHB and NABARD", "  Govt. o"]}, {"page": 78, "question0": ["  Which country released a special commemorative  st amp on the theme of Ramayana to mark the  70th anniversary of the establishment of its  diplomatic ties with India", "  Indonesia   "], "question1": ["  Which institution has announced the creation of  the Amartya Sen Chair in Inequality Studies,  named in honour of noted economist and Nobel  laureate", "  London School of Economics   "], "question2": ["  ‚ Martyrdom to Freedom ™   is a famous book written  by which author", "  Rajesh  Ramachandran   "], "question3": ["  \"Lost Roses\" is a best seller novel written by  which author", "  Martha Hall Kelly   "], "question4": ["  What is the name of the latest novel authored by  Della Owens", "  Where the Crawdads Sing   "], "question5": ["  The Union Ministry of AYUSH and CSIR signed a  MoU for cooperation in resear ch and education in  areas of traditional systems of medicine. What is  full form of CSIR", "  Council of Scientific and  Industrial Research   "], "question6": ["  Headquarters of  Council of Scientific  &   Industrial  Research are located at which place", "  New Delhi    "], "question7": ["  The acronym AYUSH stands for what", "  Ayurveda,  Yoga and Naturopathy, Unani, Siddha and  Homoeopathy   "], "question8": ["  UNESCO has designated ______ as the World Book  Capital for 2019", "  Sharjah   "], "question9": ["  Headquarters of UNSECO are located at which  place", "  Paris, France    "], "question10": ["  Which  international day is celebrated on April   23 to highlight the power of books", "  The World  Book and Copyright Day   "], "question11": ["  Santosh Trophy is associated with which sports", "  Football   "], "question12": ["  Which team won this year's Santosh Trophy", "  Services   "], "question13": ["  The Department of Posts has tied  up    with which  IT company for complete digitali s ation and  modernization of India Post", "  TCS   "], "question14": ["  Which retail company in India has become the  first retail company to cross 1 trillion revenue  mark", "  Reliance Retail   "], "question15": ["  Reliance Retail has become  1 st   retail company i n  India to operate more than _____ stores across the  country", "  10,000   "], "question16": ["  In Startup Ecosystem Ranking for 2019 released  by StartupBlink, India has been placed at which  rank", "  17th    "], "question17": ["  ________ has been ranked at no. 1 in the Startup  Ecosystem Ranking for 2019", "  USA   "], "question18": ["  Which international organi s ation supports the  celebrations of World Haemophilia Day", "  WorldFederation of Haemophilia   "], "question19": ["  World Haemophilia Day is observed on which  date", "  April 17   "], "question20": ["  Which country was the Guest of Honour country  at the 2019 Abu Dhabi Interna tional Book Fair  (ADIBF)", "  India   "], "question21": ["  Which day is observed worldwide on April 22 to  raise concern about issues like climate change,  deforestation, habitat loss, pollution, etc.", "  Earth  Day   "], "question22": ["  What is the theme of this year's Earth Day", "  Protect Our Species .   "], "question23": ["    Name the 25 year old wrestler who regained the  world number one spot in the men's 65 kg  freestyle category", "  BajrangPunia   "], "question24": ["  We celebrate which international day on April 18  to create awareness among the people to  conserve and protect our cultural heritage", "  World  Heritage Day   "], "question25": ["  The RBI recently issued its first bank notes signed  by its new Governor, in which denomination", "  50   "], "question26": ["    In which country around 300 people were killed  and more than 400 injured in a series of bomb  blasts", "  Sri Lanka   "], "question27": ["  Civil Services Day is o bserved on April 21. Which  British Governor General introd uced   civil services  in India", "  Warren Hastings   "], "question28": ["  What is the full form of EMV", "  Europay - Mastercard - Visa   "], "question29": ["  What is the special feature of EMV cards", "  They  are chip based which makes them very secure   "], "question30": ["  ____ _____ has been named the goodwill ambassador  of Team India at the Street Child Cricket World  Cup", "  Mithali Raj   "], "question31": ["  With which country India held the bilateral  maritime exerciseIN  Œ   VPN BILAT EX", "  Vietnam   "], "question32": ["  Who is the first Indian female scientist to be  elected as a Fellow of the Royal Society (FRS) in  the UK", "  Prof. Gagandeep Kang   "], "question33": ["  In the World Press Freedom Index 2019, which  country has been placed at the top", "  Norway    "], "question34": ["  India has been placed at ______ rank in   the World  Press Freedom Index", "  140 th   "], "question35": ["  Which country has announced to host the G20  summit in November 2020", "  Saudi Arabia   "], "question36": ["  Two warships of Indian Navy, INS Kolkata and  INS Shakti    took part in the International Fleet  Review in______, China", "  Qingdao   "], "question37": ["  What wa s the name of the first satellite launched  recently by Sri Lanka", "  Raavana - 1   "], "question38": ["  Nepalese scientists developed their first satellite  named ___ _____ ___ that was launched successfully  by NASA", "  NepaliSat - 1   "], "question39": ["  The Indian Navy launched guided missile  destroyer war  ship __ ____ ___ at Mazagon Dock in  Mumbai", "  Imphal   "], "question40": ["  Researchers from Tel Aviv University, Israel have  succeeded in making world's first 3D printe"]}, {"page": 79, "question0": ["  Which country recently successfully tested th e  world's first armed amphibious drone boat  named ‚Marine Lizard™", "  China   "], "question1": ["  India™s first exotic bird park ‚Essel World Bird  Park™ has been opened at which place", "  Mumbai    "], "question2": ["  A massive fire consumed the 850 year old ancient  Cathedral in Paris on April 15, stunning France  and the world. Can you name it", "  Notre - Dame  Cathedral   "], "question3": ["  Name the bilateral exercise that was held  between navies of India and Australia near  Visakhapatnam coast", "   AUSINDEX 19   "], "question4": ["  The Central Marine Fisheries Research Institute  has joined hands with which organization to map,  validate and protect smaller wetlands in coastal  regions", "  ISRO   "], "question5": ["  Who has been appointed as the first woman vice - chancellor of Jamia MilliaIslamia", "  Prof. Najma  Akhtar   "], "question6": ["  Where in India we have the central university  Jamia MilliaIslamia", "  Delhi   "], "question7": ["  Who organized the World Allergy Week 2019  globally from 7 - 13 April 2019", "  World A llergy  Organization   "], "question8": ["  India successfully test - fired its first long - range  subsonic cruise missile.  What is its name", "  Nirbhaya   "], "question9": ["  What is the approximate strike range of the  Nirbhaya missile", "  1000 kms   "], "question10": ["  What is the name of the world's largest aircraft  that took   to the air for the first time on April 13 ", "  Stratolaunch   "], "question11": ["  INS Kozhikode, the warship of Indian Navy that  was decommissioned recently was which type of  warship", "  Mine sweeper   "], "question12": ["  Who won the Formula One™s 1,000th world  championship race  -   Chinese Grand Prix", "  Lewis  Hamilton   "], "question13": ["  Entire India celebrates the harvest festival on  13/14 April to mark the harvesting of which  season crop", "  Rabi   "], "question14": ["  In which state of India Baisakhi festival is  celebrated by the name of Vishu", "  Kerala   "], "question15": ["  In the state of Assam, Baisakhi festival is   celebrated by which name", "  Rongali Bihu    "], "question16": ["  In which part of India people celebrate Baisakhi  by the name of Puthandu", "  Tamil Nadu   "], "question17": ["  April 13 this year marks the 100 years of the  Jallianwala Bagh Massacre. The gathering there  was protesting against which Britis h Act", " Rowlatt  Act   "], "question18": ["  What was the name of the Colonel who ordered  firing on the peaceful gathering in Jallianwala  Bagh", "  Colonel Reginald Dyer   "], "question19": ["  Which authority ordered the Haryana State  Pollution Control Board to identify and  immediately shut polluting industrial units in  Yamunanagar, Panipat and Kundli", "  Central  Pollution Control Board   "], "question20": ["  Which space company recently launched world's  most powerful operation rocket with 27 engines  firing at liftoff", "  Space X    "], "question21": ["  What is the name of world's most powerful  operation rocket", "  Falcon Heavy   "], "question22": ["  Name the Saudi Arabian communication satellite  weighing 5900   kg launched by the Falcon Heavy  rocket", "  Arabsat - 6A   "], "question23": ["  Which Ganga cleansing programme won the  distinction of ﬁPublic Water Agency of the Yearﬂ at  the Global Water Summit in London", "  NamamiGange   "], "question24": ["  Google launched a new cloud based platform  -   _______ that allow s users run applications from  anywhere, in unmodified form", "  Anthos   "], "question25": ["  Which PSU won the AIMA Managing India Award  for outstanding PSU of the year", "  Indian Oil  Corporation   "], "question26": ["  In a survey by the Forbes magazine in India to  select the best bank, ______ was ranked  at no. one", "  HDFC Bank   "], "question27": ["  The Order of St Andrew the Apostle is the highest  civil decoration of which country", "  Russia   "], "question28": ["  Recently Russia honoured which Indian dignitary  with its highest civil decoration", "  Prime Minister  Narendra Modi   "], "question29": ["  World over April 12 is celebrated as what day to  commemorate space flight of Gagarin", "  International Day of Human Space Flight   "], "question30": ["  SaraswatiSamman is awarded for honouring  outstanding work in which field", "  Literature   "], "question31": ["  SaraswatiSamman is awarded for outstanding  work of literature in which language", "  Any one of  the 22 languages recognized by Constitution   "], "question32": ["  SaraswatiSamman is conferred by which  organization", "  KK Birla foundation   "], "question33": ["  What is the cash component of the  SaraswatiSamman", "  Rs. 15 lakh   "], "question34": ["  K Siva Reddy, winner of S araswatiSamman 2018,  is a prominent author of which language", "  Telugu    "], "question35": ["  \"It shows an intensely bright 'ring of fire'  surrounding a perfectly circular dark hole\". What  is this", "  First - ever image of a black hole   "], "question36": ["  According to a recent report by UNPFA, India™s  population stood at 1.36 billion in 2019. What is  UNPFA", "  United Nations Population Fund   "], "question37": ["  Abdelkader Bensalah has been elected as the new  ______ of    Algeria", "  President   "], "question38": ["  In which African country the national arm y  conducted a coup to over throw the President", "  Sudan"]}, {"page": 80, "question0": ["  What is the name of the Sudanese President over  thrown by its army", "  Omaral - Bashir   "], "question1": ["  Government launched which app for the benefit  of the families of CRPF personnel killed in the line  of duty", "  ‚Veer Pari var App™   "], "question2": ["  According to data released by the AMFI, which is  the largest mutual fund of India", "  HDFC Mutual  Fund   "], "question3": ["  What is the full form of AMFI", "  Association of  Mutual Funds in India   "], "question4": ["  Which bank in Dubai has become first Islamic  bank in world to offer Chat Banking services to its  customers via WhatsApp", "  Emirates Islamic   "], "question5": ["  _______ has become the first city in the world to  implement a 24x7 Ultra Low Emission Zone  (ULEZ) norms", "  London   "], "question6": ["  As p er the Wisden Cricketers™ Almanack  -   2019,  who has been named as the 'Cricketer of the Year'  in both, Men and Women category", "  Virat Kohli,  Smriti Mandhana   "], "question7": ["  What is the popular nick name of the Wisden  Cricketers™ Almanack", "  Bible of Cricket   "], "question8": ["  Joint military e xercise Bold Kurukshetra  -   2019  was held at Babina Cantonment. Where is this  place", "  Jhansi, Uttar Pradesh   "], "question9": ["  __________ has been become the first ever railway  station in the Indian Railways to get an ISO  certification for Environment Management  System from t he National Green Tribunal", "  Guwahati Railway Station   "], "question10": ["  In which of its report The International Monetary  Fund has projected that global growth will be  3.3% in 2019", "  World Economic Outlook 2019   "], "question11": ["  As per various global reports, trade tensions  between which two countries are having negative  impact on global growth", "  USA and China   "], "question12": ["  Who won the election of Prime Minister of Israel  for record 5th time", "  Benjamin Netanyahu   "], "question13": ["  The Army Ordnance Corps recently   celebrated the  Platinum Jubilee of the Battle of KanglaTongbi at  which place", "  Imphal, Manipur   "], "question14": ["  Malaysia Open Badminton Championship was  held at which place", "  Kuala Lumpur    "], "question15": ["  Graham Reid, the new chief coach of the Indian  men's hockey team hails from which country", "  Australia    "], "question16": ["  The first batch of 6 indigenously produced  Dhanush artillery guns work inducted in Indian  army. Which factory manufactured these guns", "  Gun Carriage Facto ry, Jabalpur   "], "question17": ["  What is the strike range of Dhanush Artillery  guns", "  36 to 38 km    "], "question18": ["  According to the latest edition of the World  Bank™s Migration and Development Brief, _____ is  the world™s top recipient of inward remittances  from its diaspora", "  India   "], "question19": ["  The RBI has directed banks that new currency  chests should have minimum area of _____ square  feet for strong room", "  1,500   "], "question20": ["  The RBI has said that the new currency chests  should have a processing capacity of _____ lakh  pieces of banknotes per day", "  6.6   "], "question21": ["  Minist ry of HRD released the NIRF report on April  8 in New Delhi.   What is full form of NIRF", "  National Institutional Ranking Framework   "], "question22": ["  As per NIRF ranking which higher education  institution has been ranked as the \"Overall Best  Institute\"", "  IIT Madras   "], "question23": ["  NIRF has  ranked _______ ___ __, Bengaluru as the best  university in India", "  IndianInstitute of Science   "], "question24": ["  Which Indian college has been ranked at No. 1 by  the NIRF", "  Miranda House, Delhi   "], "question25": ["  April 10 is celebrated as the birthday of the  founder of Homoeopathy. Who was he", "  D r.Christian Fredrich Samuel Hahnemann   "], "question26": ["  The biannual Army Commanders™ Conference  2019 was held in New Delhi. Who chairs this  conference", "  Chief of the Army Staff   "], "question27": ["  Which international day is observed to  commemorate the inauguration of the first ever  Olympic games of the modern era on April 6 in  Athens, Greece in 1896", "  International Day of  Sport for Development and Peace   "], "question28": ["  Which village in Manipur has become India™s first  carbon - positive settlement", "  Phayeng   "], "question29": ["  Who has become the first Indian to be elected as a  member of the FIFA Executive Council", "  Praful  Patel   "], "question30": ["  Praful Patel is the _______ of All India Football  Federation", "  Pres ident   "], "question31": ["  Hayabusa - 2 spacecraft successfully dropped an  explosive charge on the asteroid Ryugu to create  an artificial crater there. This is which country's  spacecraft", "  Japan   "], "question32": ["  World Health Day is observed on which date", "  April 4   "], "question33": ["  World Health Day commemorates which  historical event", "  Founding of World Health  Organisation  -   WHO in 1948   "], "question34": ["  Shah Rukh Khan, the Bollywood star was  conferred honorary doctorate in Philanthropy by  the University of Law in which city", "  London   "], "question35": ["  Which country top ped the world football rankings  released by FIFA in April", "  Belgium   "], "question36": ["  BSE and India INX have signed a MoU with which  Russian exchange for connecting investors of the  two countries", "  Moscow Exchange    "], "question37": ["  Keshav Murugesh, CEO of WNS Global Services  Group has been  appointed as the Chairman of  NASSCOM. Expand the acronym NASSCOM", "  National Association of Software and Services  Companies"]}, {"page": 81, "question0": ["  Who is Vikram Kirloskar, recently elected as  President of the Confederation of Indian Industry  (CII) for 2019 - 20", "  CMD of Kirloskar Sy stems  Ltd., and vice - chairman of Toyota Kirloskar  Motor   "], "question1": ["  Who has been elected as the President of the  World Bank", "  David Malpass   "], "question2": ["  Where are the Headquarters of the World Bank", "  Washington DC, USA    "], "question3": ["  David Malpass is a citizen of which country", "  USA   "], "question4": ["  How many countries are the member of World  Bank", "  189   "], "question5": ["  The popular Hindu festival of Chaitra Sukladi  marks which event", "  It is the first day of the  lunar month of Chaitra   "], "question6": ["  The RBI recently fixed the WMA limits for the first  half of the FY 2019 - 20 at Rs. 75,000 crore. What is  WMA", "  Ways and Means Advances   "], "question7": ["  What is the purpose of Ways and Means  Advances", "  Temporary loan facility provided by  the RBI to the center and state govern ments    "], "question8": ["  Who has been appointed as the Managing  Director of Life Insurance Corporation of India", "  Vipin Anand   "], "question9": ["  Name the present Chairman of the Life Insurance  Corporation of India", "  M. R. Kumar   "], "question10": ["  Which international day is observed on April 4 to  spread awareness about dangers of explosive  mines", "  International Mine Awareness Day   "], "question11": ["  RBI recently lowered Repo Rate by 25 basis  points to 6.0 percent. How it will impact economic  growth", "  It is likely to imp rove   "], "question12": ["  With the recent lowering of Repo Rate, what are  the new MSF rate and Bank Rate", "  Both 6.25  percent   "], "question13": ["  The \"Order of Zayed\" is the highest civilian  decoration of which country", "  United Arab  Emirates   "], "question14": ["  UAE recently honoured which noted statesman  with the Or der of Zayed", "  PM Narendra Modi    "], "question15": ["  Who became the first Indian squash player in the  men™s category to enter the top 10 in latest  Professional Squash Association (PSA) world  rankings", "  Saurav Ghosal   "], "question16": ["  According to a new LinkedIn report \"2019 Top  Companies\", ___ ____ is the most sought after  company where Indian professionals want to  work and stay", "  Flipkart   "], "question17": ["  _______ became first nation in world to launch full - fledged 5G mobile networks in the country", "  South  Korea    "], "question18": ["  _______ became the first nation in South East Asia  to introduce harsh new Sharia laws", "  Brunei   "], "question19": ["  Name the Algerian President who resigned after  weeks of mass protests against him", "   Abdelaziz  Bouteflika   "], "question20": ["  Indian Army has successfully built the longest  suspensio n bridge named ‚Matiri Bridge™ over  ______ River in the _____ region", "  Indus; LehLadakh   "], "question21": ["  Which South American country signed the  framework agreement in March end to join the  International Solar Alliance", "  Bolivia   "], "question22": ["  'KandhamalHaldi', an indigenous variety of  turmeric recently got the GI Tag. It is from which  state", "  Odisha   "], "question23": ["  Which country has confirmed sale of    24 multi - role MH - 60 ‚Romeo™ Seahawk helicopters to India", "  USA   "], "question24": ["  Which multinational company makes the  Seahawk h elicopters", "   Lockheed Martin  Corporation   "], "question25": ["  Japan has declared ______ as the name of its new  imperial era that will begin on May 1, 2019", "  Reiwa   "], "question26": ["  What is the name of the new Emperor of Japan", "  Crown Prince Naruhito   "], "question27": ["  Name the Indian who has been appointed as the  CEO of the International Cricket Council, Dubai", "  Manu Sawhney   "], "question28": ["  ______ successfully launched Tianlian II - 01  -   the  first of its new - generation data relay satellites", "  China   "], "question29": ["  Garden Reach Shipbuilders & Engineers L td.  became the 'first Indian shipyard' to build and  deliver 100 warships. It is located at which place", "  Kolkata    "], "question30": ["  World over, April 2 is celebrated as the World  Autism Awareness Day. Autism refers to which  disability", "  A complex neuro behavioural  condition  which causes problems with  language and communication skill,  particularly in children   "], "question31": ["  ________ has been adjudged as the 'Best Digital  Bank' in India at the Asiamoney Best Bank  Awards", "  HDFC Bank   "], "question32": ["  Tech giant Apple has announced to    start   assembl y   of which  of its mobile phones in India", "  iPhone 7   "], "question33": ["  Which country ranked first in ICC test rankings,  for the third consecutive year", "  India   "], "question34": ["  Which country announced 30 days of electricity  rationing from April 1 as part of steps taken to  deal with its deep economic crisis", "  Venezuela   "], "question35": ["  Sultan Azlan Shah Cup is associated with which  sports", "  Hockey   "], "question36": ["  ___________ won the Sultan Azlan Shah Cup by  defeating India", "  SouthKorea   "], "question37": ["  Which country hosts the Sultan Azlan Shah Cup  on regular basis", "  Malaysia   "], "question38": ["  Which Ministry revised the wages under the  MGNREGA scheme from April 1 for the year 2019 - 20", "  Rural Developme nt Ministry"]}, {"page": 82, "question0": ["  Which state has fixed highest wages under  MGNREGA scheme for the year 2019 - 20", "  Haryana (Rs. 284)   "], "question1": ["  Bihar and _______ have lowest per day wages of Rs.  171 under MGNREGA for 2019 - 20", "  Jharkhand   "], "question2": ["  Which multinational grouping voted with good  majority to ban single - use plastic products in  member countries", "  European Union   "], "question3": ["  Name the Swiss - based NRI scientist who has been  conferred PravasiBharatiyaSamman this year", "  Dr.  Rajendra Joshi   "], "question4": ["  On March 30, citie s around the world marked  Earth Hour by turning off lights at their local time  ____ p.m. till _____ pm", "  8", "30, 9.30   "], "question5": ["  Zuzana Caputova has been  elected as first woman  ______ of Slovakia", "  President   "], "question6": ["  The ISRO on April 1 put into orbit satellite Emisat  for what   purpose", "  Electronic intelligence  satellite for DRDO   "], "question7": ["  On April 1, ISRO launched 29 satellites, out of  which 24 satellites are    from one country. Name it", "  USA   "], "question8": ["  Singapore's _____ Airport has been crowned the  world's best aviation hub for the seventh time in a   row", "  Changi   "], "question9": ["  ________ has launched a special programme named  ﬁYoung Scientist Programmeﬂ or  YuvaVigyaniKaryakram (YUVIKA) for school  children", "  ISRO   "], "question10": ["  Coorg Arabica, Chikmagalur Arabica, Baba  Budangiri Arabica, Wayanad Robusta and Araku  Valley Arabica are five varieties of ______ that have  been granted GI - Tag recently", "  Coffee   "], "question11": ["  Name the village in HP which has become the  highest polling station in the wor ld at an altitude  of 15,256 feet", "  Tashigang   "], "question12": ["  Which country honoured our President with its  highest civilian honour ﬁCóndor de Los Andes en  el Grado de Gran Collarﬂ", "  Bolivia   MARCH  -   2019   "], "question13": ["  India has become the ______ nation in the world to  demonstrate anti - satellite missile capability by  shooting down a live satellite", "  Fourth   "], "question14": ["  What is the name of the Anti Satellite missile  developed by the DRDO", "  A - SAT   "], "question15": ["  Name the mission under which the  DRDO  successfully targeted a live satellite on a low earth  orbit", "  Mission Shakti   "], "question16": ["  The UGC has prohibited imparting  correspondence course in which subject on the  ground that it is technical in nature and    requires  practical or laboratory courses", "  Agricultur e   "], "question17": ["  \"Becoming\", is a book related to which global  celebrity", "  Former US First Lady Michelle  Obama   "], "question18": ["  What is the title of the latest book by Raghuram G  Rajan released in March", "  The Third Pillar   "], "question19": ["  President Kovind was recently honoured with the  Grand Order of King Tomislav by which country", "  Croatia   "], "question20": ["  Tech giant Apple has announced launch of a  virtual credit card in tie - up with which global  financial company", "  Goldman Sachs Group   "], "question21": ["  Which IIT has developed a superfast medical test  kit using Nano Technology and Artificial  Intelligence", "  IIT Delhi   "], "question22": ["  The Central Board of Secondary Education (CBSE)  has decided to introduce three new subjects in the  school curriculum for the senior secondary   classes. Name these subjects", "  Artificial  Intelligence (AI), early childhood care  education and yoga   "], "question23": ["  After opening of Karta r pur corridor, the Pakistan  recently announced opening of another corridor  for a Hindu temple. What is the name of this  corridor", "  Sharada Peeth Corridor   "], "question24": ["  Which community considers Goddess Sharada as  their ﬁkuldeviﬂ or principal deity", "  Kashmiri  Pandits   "], "question25": ["  Which city of Norway is set to become the world™s  first city to install wireless, induction - based  charging stations for its fleet of electric taxis", "  Oslo   "], "question26": ["  The RBI has slapped a penalty of Rs. 2 crore on  Punjab National    Bank for non - compliance of  regulator y directions in which regard", "  SWIFT  operations   "], "question27": ["  What is the full form of SWIFT", "  Society for  Worldwide Interbank Financial  Telecommunication     "], "question28": ["  World Theatre Day is observed on which day of  March", "  27th   "], "question29": ["  Which organization supports the celebrations of  World  Theatre Day", "  International Theatre  Institute, Paris    "], "question30": ["  Why March 23 has been selected as World  Meteorological Day", "   Itis the founding day of the  World Meteorological Organization    "], "question31": ["  Which international day has adopted  ﬁThe Sun,  the Earth and the weatherﬂ as the theme for the  year 2019", "  World Meteorological Day    "], "question32": ["  The Shiksha Vani podcast app has been launched  by which organization", "  CBSE   "], "question33": ["  What is the purpose of the Shiksha Vani App", "  To  disseminate crucial information to  students  and parents in a timely manner   "], "question34": ["  Which Unit of the Indian Railways recently  became the largest producer of rail coaches in the  world", "  Integrated Coach Factory   "], "question35": ["  Integrated Coach Factory of Indian Railways is  located at which place", "    Chennai   "], "question36": ["  India celebrates Shaheed Diwas on March 23 to  pay homage to which martyrs", "  Bhagat Singh"]}, {"page": 83, "question0": ["  Where in India is the memorial devoted to  Bhagat  Singh, Rajguru and Sukhdev, the place where they  were cremated", "  Hussainiwala, Distt Ferozpur,  Pun jab   "], "question1": ["  Which is the  first Indian budget airline to become  member of IATA", "  SpiceJet   "], "question2": ["  What is the full form of IATA", " International Air  Transport Association   "], "question3": ["  Name the only factory in India that is authorized  to produce indelible ink used in elections to put a  mark on the fingers", "  Mysore Paints and Varnish  Ltd, Mysore   "], "question4": ["  The secret formula for producing the indelible ink  has been  developed by which organisation", "  ", " National Physical Laboratory, New Delhi   "], "question5": ["    As per the Global Energy Transition Index  released by Geneva - based World Economic  Forum, _______ has been placed at number one  spot", "  Sweden   "], "question6": ["  As per the Global Energy Transition Index, India  has been placed at ____ ____ _ rank among 115  countries", "  76 th   "], "question7": ["  The Indian Navy deployed its ships Sujata, Sarathi  and Shardul to carry out humanitarian and  disaster relief activities in which country", "  Mozambique   "], "question8": ["  Global Teacher Prize is awarded by which  organization", "  Varkey Founda tion, London   "], "question9": ["  What is the cash component given in the Global  Teacher Prize", "  $ 1 million   "], "question10": ["  Who is the winner of the 2019 Global Teacher  Prize", "  Peter Tabichi ,  Kenya   "], "question11": ["  March 24 is celebrated as an International Day to  spread awareness about which dreaded deceas e", "  Tuberculosis   "], "question12": ["  Who has been appointed as the next Chief of  Indian Navy", "  Vice Admiral Karambir Singh  Nijjar   "], "question13": ["  What is the rank of the Chief of Indian Navy", "  Admiral   "], "question14": ["  Templeton Prize is awarded for excellence in  which field", "  Human Values and Spiritualism   "], "question15": ["  What is the cash component of the Templeton  Prize", "  $1.45 million   "], "question16": ["  Who is the winner of the Templeton Prize 2019", "  Marcelo Gleiser   "], "question17": ["  The International Day of Forests is observed on  which day of March", "  21st    "], "question18": ["  Forests cover roughly ______ % of the Earth's land  mass", "  33%   "], "question19": ["  What is the theme of this year's International Day  of Forests", "  Forests and Education", " Learn to  Love Forests   "], "question20": ["  March 20 is observed every year to raise  awareness about the role of which common bir d  in our life", "  Sparrow   "], "question21": ["  What is the theme for this year's World Sparrow  Day", "  I Love Sparrows   "], "question22": ["  The 33rd edition of the India - Indonesia  Coordinated Patrol (Ind - Indo Corpat) was held at  which place", "  Near Andaman & Nicobar Islands   "], "question23": ["  Which international prize is considered as Nobel  of Mathematics", "  Abel Prize   "], "question24": ["  Abel Prize is presented by King of which country", "  Norway   "], "question25": ["  What is the cash component of the Abel Prize", "  $ 7  lakh    "], "question26": ["  Name the professor from the University of Texas  who became the f irst woman to win the Abel  Prize", "  Karen Uhlenbeck   "], "question27": ["  Which international day is celebrated worldwide  on March 22 with an aim to tackling the water  crisis", "  World Water Day   "], "question28": ["  ﬁLeaving no one behindﬂ is the theme for this  year's _____ day", "  World Water Day   "], "question29": ["  The International Day of Happiness is observed  on which date", "  March 20   "], "question30": ["  What is the theme of this year's International Day  of Happiness", "  Happier Together   "], "question31": ["  As per the UN World Happiness report, citizens of  ______ feel most happy in the world", "  Finland   "], "question32": ["  What  is India's rank in the latest UN World  Happiness report", "  140th   "], "question33": ["  Special Olympics World Games 2019 were held  from March 14 to March 21 in which country", "  UAE, Abu Dhabi   "], "question34": ["  The Special Olympic World Games are organized  for which category of sports persons", "  Intellectually impaired   "], "question35": ["  The next Special Olympic Games are set to take  place in _______ in 2021", "  Sweden   "], "question36": ["  India bagged a record ______ medals at the Special  Olympic World Games", "  368   "], "question37": ["  Which country recently changed the name of its  capital in the honour of its longtime ruler who  resigned recently", "  Kazakhstan   "], "question38": ["  What is the new name of the capital  (Astana)  of  Kazakhstan", "  Nursultan   "], "question39": ["  Global Recycling Day is observed on which day of  March", "  18   "], "question40": ["  What is the name of mobile app of the Election  Commission where anyone can post photos /  videos of any violation of code of conduct", "  cVIGIL   "], "question41": ["  Who has been appointed as the first Lokpal of  India", "  Justice Pinaki Chandra Ghose   "], "question42": ["  Who is the appointing authority   for the Lokpal", "  The President   "], "question43": ["  The Lokpal is administered the oath of office by  which authority", "  The President"]}, {"page": 84, "question0": ["  The equivalent of the Lokpal at the state level is  designated at _____", "  Lokayukt   "], "question1": ["  What is the name for Lokpal in English", "  Ombudsman    "], "question2": ["  What is the role of the office of Lokpal", "  To look  into cases of corruption against certain  categories of public servants   "], "question3": ["  How many judicial and non judicial members are  there in the office of Lokpal", "  4 each   "], "question4": ["  VyasSamman isconferredfor excellence in which  fi eld", "   Hindi Literature   "], "question5": ["  Which organization awards the Vyas Samman", "  KK  Birla Foundation   "], "question6": ["  Who is the winner of Vyas Samman 2018", "  LeeladharJagudi   "], "question7": ["  What is the name of the book for which  LeeladharJagudi won the Vyas Samman", "  Jitne Log  UtnePrem   "], "question8": ["  The Indian Department of Post released a special  stamp cover on Ice Stupa. It is found at which  place", "  Gangles Village in Leh in J&K   "], "question9": ["  What is the purpose of forming Ice Stupas", "  Water  conservation    "], "question10": ["  Irfan K T of India qualified for the 2020 Tokyo  Olympics i n which sports category", "  Race Walking   "], "question11": ["  In the coming general elections, which state has  the largest number of voters", "  Uttar Pradesh   "], "question12": ["  As per the Quality of Living Survey 2019 by  Mercer, _____ has secured no. 1 spot for the 10th  year in a row", "  Vienna, Capital of Austria    "], "question13": ["  Which Indian cities have secured joint 143rd  rank, highest among Indian cities, in the Quality of  Living Survey 2019", "  Hyderabad and Pune   "], "question14": ["  In terms of vulnerability to the risks of climate  change, recently which Himal a yan state has been  assessed as most vulnerable", "  Assam   "], "question15": ["  Which bank launched a first of its kind new  service called ‚YONO Cash™ for its customers to  facilitate withdrawal of money from ATMs  without using debit cards", "  State Bank of India   "], "question16": ["  What is the full for m of YONO", "  You Only Need  One   "], "question17": ["  Which IT major has partnered with the Ministry  of Housing and Urban Affairs to promote its  project ‚Sangam™ aimed at promoting Swachh  Bharat Mission in India", "  Microsoft   "], "question18": ["  As per the Forbes' List Of World's Richest Sports  Team O wners, who has been placed at the top", "  Mukesh Ambani   "], "question19": ["  Mukesh Ambani, ranked as the No. 1 in the list of  World's Richest Sports Team Owners, is the  owner of which team", "  Mumbai Indians (IPL  Cricket Team)   "], "question20": ["  The Asian Youth Athletics Championships were  hosted b y which country", "  Hong Kong    "], "question21": ["  What was the rank of Indian team in the Asian  Youth Athletics Championships where it secured  26 medals", "  2nd    "], "question22": ["  Which country topped the medal tally in the Asian  Youth Athletics Championships", "  China   "], "question23": ["  The RBI has named which 3 banks in the category  of Domestic Systemically Important Banks (D - SIBs) for 2018", "  SBI, ICICI Bank and HDFC Bank   "], "question24": ["  D - SIBs are required to maintain ______ capital as  compared to other banks", "  Higher   "], "question25": ["  Which country has been named by FI FA for  hosting the Women's World Cup 2020", "  India   "], "question26": ["  What is the full form of FIFA", "  International  Federation of Football Associations   "], "question27": ["  Which International Day is observed on March 15  to promote basic rights of consumers", "  The World  Consumer Rights Day   "], "question28": ["  What is   the theme of this year's World Consumer  Rights Day", "  Trusted Smart Products    "], "question29": ["  Which world day is observed annually on the  Friday before the March Equinox on the Earth", "  World Sleep Day   "], "question30": ["  M.R. Kumar has been appointed as the chairman  of which apex national organization", "  Life  Insurance Corporation of India (LIC)   "], "question31": ["  The RBI has notified which Bank as a  ‚ private  sector ™   lender following acquisition of majority  stake in it by LIC", "  IDBI Bank    "], "question32": ["  Pra nav R Mehta became the first Indian to hold  the post of the President of Global Solar Council.  Where are its headquarters", "  Washington D.C.,  USA   "], "question33": ["  Erode turmeric was granted Geographical  Indication (GI) tag recently. It is in which state", "  Tamil Nadu   "], "question34": ["  The ‚Sirsi Supari™ (Areca Nut or betel nut) that  was granted the GI - tag recently, is a product of  which state", "  Karnataka    "], "question35": ["  Name the badminton player who is the 1st  Japanese to win  Men's Singles title at the  YONEX  All England Open Badminton Championships", "  Ke ntoMomota   "], "question36": ["  Which Indian sports person has been selected as  role model for new series of Barbie dolls launched  to mark the 60th anniversary of the Barbie doll", "  DipaKarmakar   "], "question37": ["  The DRDO successfully test - fired the indigenously  developed ___________ ‚Pinaka™ at Pokhran in  Rajasthan", "  Guidedrocket system   "], "question38": ["  Following a n  Ethiopian Airlines crash, which  plane was grounded all over the world for safety  considerations", "  Boeing 737 Max 8   "], "question39": ["  India launched its third IT corridor in China at  ______ to facilitate partnerships between Indian  and Chinese companies", "  Xuzhou   "], "question40": ["  Which Union Ministry won the First Prize in th"]}, {"page": 85, "question0": ["  ACKO General Insurance won the Golden Peacock  Innovative Product Award for which of its  innovative product", "  Ola Ride Insurance   "], "question1": ["  What do we call the properties that were left  behind by people who migrated to Pakistan s ince  the partition in 1947 and to China after the 1962  Sino - Indian war", "  Enemy properties   "], "question2": ["  Why the enemy properties were in news recently", "  Govt.allowed states to put these properties to  public use   "], "question3": ["  March 12 marked completion of  30 years of the  World Wide  Web . Who is credited with its  invention", "  Sir Tim Berners - Lee   "], "question4": ["  As per the annual report by SIPRI, ______ is the  largest importer of major arms after Saudi Arabia", "  India   "], "question5": ["  Which country is the largest exporter of major  arms accounting for 36 per cent share", "  USA   "], "question6": ["  What is the full form of SIPRI", "  Stockholm  International Peace Research Institute   "], "question7": ["  The CEC announced that 2019 elections will be  conducted through VVPAT machines. What is  VVPAT", "  Voter Verifiable Paper Audit Trail   "], "question8": ["  In how many states assembly elections  will also  be held along with Lok Sabha elections", "  Four   "], "question9": ["  The Pritzker Architecture Prize is given by which  foundation", "  Hyatt Foundation, Chicago   "], "question10": ["  Name the Japanese architect who won this year's  Pritzker Prize", "  Arata Isozaki   "], "question11": ["  India signed a $ 3 billion deal with ______ for  leasing a nuclear - powered attack submarine for  the Indian Navy", "  Russia   "], "question12": ["  International Women's Day is observed on which  date", "  March 8   "], "question13": ["  #BalanceforBetter is a campaign launched to  celebrate which international  day", "  International  Women's Day   "], "question14": ["  Which bank announced linking of its savings  deposits rates and short - term loans rates to the  RBI™s repo rate", "  State Bank of India   "], "question15": ["  Which country's first lunar lander, named  Beresheet sent back a first of its kind selfie taken  from a distance of 37,600 kilometers", "  Israel   "], "question16": ["  Where in India ‚India Jewellery Park™ is being set  up with an investment of Rs.14,467 crore", "  Navi  Mumbai   "], "question17": ["  In a firs t ever attempt to compile the names of our  martyrs, Government released a ﬁDictionary of  Martyrs of India™s Freedom Struggleﬂ. It covers  which period", "  1857 - 1947   "], "question18": ["  The National Green Tribunal slapped a fine of Rs.  500 crore on which automobile company  for  damaging the environment through the use of  ﬁcheat deviceﬂ in its diesel cars in India", "  Volkswagen   "], "question19": ["  Malaysia has become the 124th member of the  ICC headquartered a t The Hague, Netherlands.  What is ICC", "  International Criminal Court,   "], "question20": ["  The Finance Ministry released a new Rs . 20 coin  made in copper, zinc and nickel. What is its shape", "  12 - edged polygon   "], "question21": ["  Govt. has decided to do away with the paper or  booklet - based driving licence or registration  certificate with what other form", "  Plastic Cards   "], "question22": ["  The Supreme Court referred the politically  sensitive Ram Janmabhoomi - Babri Masjid land  dispute at Ayodhya to media tion. Who is the head  of the mediation panel", "  Justice Kalifulla   "], "question23": ["  Ministry of Housing and Urban Affairs launched e - Dharti app for what purpose", "  To facilitate online  execution of Conversion, Substitution and  Mutation related to land properties   "], "question24": ["  The United St ates reduced the visa duration for  ______ citizens from five years to just three  months", "  Pakistani   "], "question25": ["  The government launched   ﬁTransport and  Marketing Assistanceﬂ scheme for providing  financial assistance for transport and marketing  of _____ products", "  agricu lture   "], "question26": ["  Bharat Electronics Ltd. launched SWAGAT  -   the  Automatic Fare Collection Gating System for what  purpose", "  To facilitatehassle - free commute  across various modes of transport in India    "], "question27": ["  Who is  Kylie Jenner,   21, named the youngest self - made billionaire of all time by Forbes magazine", "  American TV artist and business woman   "], "question28": ["  A unique museum ‚Azaadi - Ke - Diwane™, dedicated  to the unsung heroes of the country™s freedom  struggle, was opened at which place", "  Red Fort  pr emises in New Delhi   "], "question29": ["  Tech giant Google unveiled a new app 'Bolo' that  aims to help children in primary school learn  what", "  To read in Hindi and English   "], "question30": ["  Ajit Kumar Mohanty, distinguished scientist has  been appointed Director of which apex national  scientifi c organization", "  Bhabha Atomic Research  Centre   "], "question31": ["  The Bhabha Atomic Research Centre is located at  which place", "  Mumbai   "], "question32": ["  Swachh Survekshan2019, covering all 4247  Urban Local Bodies in the country, ranked which  city at the top", "  Indore   "], "question33": ["  Government has decided to celebrate March ____  as the JanaushadhiDiwas to  create awareness  about the use of generic medicines available at  much cheaper rates", "  7   "], "question34": ["  According to the Delta ranking report released by  NITI Aayog, Hailakandi has become the top  as pirational district. It is in which state", "  Assam"]}, {"page": 86, "question0": ["  The world celebrates the World Wildlife Day  every year on March 03. What is the theme for  this year", "  Life below water", " for people and  planet   "], "question1": ["  Who has been appointed as the chairman of the  newly constituted  National Commission for  Backward Classes (NCBC)", "  Bhagwan Lal Sahni   "], "question2": ["  Mukesh Ambani, richest Indian with worth  jumping to $50 billion, jumped six positions to  rank _____ on Forbes World's Billionaire list", "  13th   "], "question3": ["  India scored its 500th ODI victory by beating  which team at Nagpur", "  Australia   "], "question4": ["  As per the World Air Quality Report 2018, which  Indian city has been ranked most polluted in the  world", "  Gurugram, Haryana   "], "question5": ["  The Union Ministry of Housing and Urban Affairs  launched ‚National Common Mobility Card™ for  what pu rpose", "  For facilitating seamless travel  through different metros and other transport  systems across the country   "], "question6": ["  The ISRO launched a special programme  \"YuvaVigyaniKaryakram\" for imparting scientific  knowledge to which category of persons", "  School  Children   "], "question7": ["  Which international financial body has agreed for  the funding of Gram Samridhi Yojana", "  World  Bank   "], "question8": ["  Which insurance company has launched India™s  first ‚bank locker protector policy™", "  IFFCO Tokio  General Insurance   "], "question9": ["  India signed a deal with a Russian firm Con cern  Kalashnikov to manufacture which weapon in  India", "  AK - 203 rifles   "], "question10": ["  India will manufacture 7.5 lakh AK - 203 rifles at  which Indian ordinance factory", "  At Korwa in  Amethi, Uttar Pradesh   "], "question11": ["  For the first time in nine years, two India bowlers  joined the top fiv e club in the latest ICC  women's   cricket rankings for ODI bowlers. Can you name  them", "  JhulanGoswami (first) and Shikha  Pandey(fifth)   "], "question12": ["  Which Indian woman cricketer has been ranked  No. 1 in ICC women's cricket rankings for ODI", "  Smriti Mandhana   "], "question13": ["  The BSF recently launched  the project BOLD - QIT  -   Border Electronically Dominated QRT (quick  reaction team) Interception Technique on which  part of Indian border", "  District Dhubri in Assam  on Bangladesh Border   "], "question14": ["  The researchers of the IIT, Delhi have created  India's first Braille laptop for the visually -   impaired. What is its name", "  Dot Book   "], "question15": ["  The KumbhMela that concluded on March 4 on  which auspicious day", " Mahashivratri   "], "question16": ["  The RBI constituted a task force headed by ______,  former D y.   Governor to look into issues related to  the offshore rupee markets", "  Usha Thorat   "], "question17": ["  _______ claimed the 100th ATP title of his career  after winning    the Dubai Tennis Championships", "  Roger Federer   "], "question18": ["  On the occasion of the National Science Day on  Feb 28, HRD min istry launched ‚STARS™ scheme.  The acronym STARS stands for what", "  Scheme for  Translational and Advanced Research in  Science   "], "question19": ["  Which apex Indian institute has been designated  as the coordinat or   for the STARS scheme", "  Indian  Institute of Science (IISc), Bengal uru   "], "question20": ["  The Shanti Swarup Bhatnagar Prizes were  recently awarded to 34 budding scholars in which  field", "  Science and Technology   "], "question21": ["  The Ministry of Tribal Affairs launched the Van  Dhan scheme for what purpose", "  To provide  Minimum Support Price (MSP) for Minor  Forest Produce to Tribals   "], "question22": ["  According tothe BCG - IBA Report, which Bank  secured the top spot among all public sector  banks in the implementation of ‚Reforms agenda'", "  Punjab National Bank   "], "question23": ["  The Cabinet Committee on Economic Affairs  approved the JI - VAN Yojana f or providing  financial support to the Integrated Bioethanol  Projects. Expand the acronym JI - VAN", "  JaivIndhan -   VatavaranAnukoolfasalawasheshNivaran   "], "question24": ["  HasmukhAdhia, former Finance Secretary has  been appointed as non - executive chairman of  which bank", "  Bank of Ba roda   "], "question25": ["  India celebrates National Science Day on which  date", "  February 28    "], "question26": ["  The National Science Day is dedicated to the  honour of which great scientist", "  Sir CV Raman   "], "question27": ["  Sir CV Raman won the Nobel prize in 1930 in  which field", "  Physics   "], "question28": ["  As per the Inclusive Internet Index 2019, ______ is  the best country in terms of  availability,  affordability and readiness of internet network", "  Sweden   "], "question29": ["  India was ranked ____ in the Inclusive Internet  Index 2019", "  47th   "], "question30": ["  Deepak Singh is the current national c hampion of  which sports", "  Boxing   "], "question31": ["  RBI signed a Bilateral Swap Arrangement (BSA)  for $75 billion with central bank of which  country", "  Japan   "], "question32": ["  The summit meet between  the    US President  Trump and the Supreme leader of North Korea  was held at which place", "  Hanoi,   Vietnam    "], "question33": ["  What is the official formal name of North Korea", "  Democratic People™s Republic of Korea   "], "question34": ["  The Union Cabinet approved the upgradation of  which AIIMS into a world class Medica"]}, {"page": 87, "question0": ["  Under which central scheme the 22nd AIIMS of  the country is being setup at village Manethi, near  Rewari in Haryana", "  Pradhan Mantri Swasthya  Suraksha Yojana   "], "question1": ["  Govt. launched the SHREYAS scheme for  providing industry apprenticeship to which  category of persons", "  Tonon - technical students  of BA, BSc. BCom courses   "], "question2": ["  What is the expansion of the term SHREYAS", "  Scheme for Higher Education Youth in  Apprenticeship and Skil ls   "], "question3": ["  Which state launched the PRANAM Commission  to monitor issues related to the protection of  parents of state government  employees ", "  Assam   "], "question4": ["  The PRANAM Commission has been setup under  the PRANAM Bill passed by the Assam state.  Expand the acronym PRANAM", "  Par ents  Responsibility and Norms for Accountability  and Monitoring   "], "question5": ["  Which African country has re - elected  Muhammadu Buhari as its President", "  Nigeria   "], "question6": ["  Railway Minister announced formation of a  18th   zone of the Indian Railways in Andhra Pradesh.  What is the name   of new zone", "  Southern Coast  Railway at Visakhapatnam   FEBRUARY  -   2019   "], "question7": ["  Indian Air Force used which fighter jets to carry  out surgical strike on Balakot", "  Mirage  -   2000   "], "question8": ["  GST council has slashed GST on  non - affordable  houses to  ____ percent, from the present 12  percent ", "  5   "], "question9": ["  In case of affordable houses, the GST rate has  been reduced to  _____  percent, from 8 percent at  present ", "  1   "], "question10": ["  Under which scheme  the first instalment of Rs  2,000 was directly credited to the bank accounts  of selected beneficiary farmers of 24  States and  the UTs   on Feb 24", "  Pradhan Mantri  KisanSamman Nidhi Yojana (PM - KISAN)   "], "question11": ["  Railways launched  ______  Dashboard to keep  people informed about the work going on in the  Railways across the country ", "  Rail Drishti   "], "question12": ["  _______  has become the first state in the   country to  have raised a special dog squad to detect liquor  consignments ", "  Bihar   "], "question13": ["  Which Indian Bank in collaboration with  World  Bank, United Nations Entity for Gender Equality  and the Empowerment of Women (UN Women)   launched Women's Livelihood Bonds", "  Small   Industries Development Bank of India (SIDBI)   "], "question14": ["  Individual  women entrepreneurs   can borrow up  to Rs .  ______ under Women's Livelihood Bonds", "  Rs.3 lakh   "], "question15": ["  Who has been  selected for the ﬁPlayer of the Yearﬂ  award by the Asian Hockey Federation ", "  Manpreet Singh   "], "question16": ["  Grandmaster Abhijeet Gupta  won which  international title recently", "  Cannes International  Open trophy   (chess)   "], "question17": ["  The 79th Indian History Congress was hosted by  the Barkatullah University in which place", "  Bhopal, Madhya Pradesh   "], "question18": ["  India got its first War Memorial, established in  New Delhi, just next to which grand monument", "  India Gate   "], "question19": ["  The National War Memorial has been built up  with a layout of ______ concentric circles", "  Four    "], "question20": ["  Which Indian entry won the Oscar for the  Best  Document ary Short Subject category", "  Period.  End of Sentence   "], "question21": ["  Who is the producer of the film  Period , ﬁ End of  Sentence ﬂ ", "  Guneet Monga   "], "question22": ["  Which film won the Oscar for the Best Picture  category", "  Green Book   "], "question23": ["  The Oscar for the Best Director was won by which  person", "  Alfonso Cuarón   "], "question24": ["  What is the title of the book launched recently,  written by  P Chidambaram, former Finance  Minister", "  Undaunted", " Saving the Idea of India   "], "question25": ["  Name the title of the novel written by Jane Harper  that was released in February 2019", "  The Lost  Man   "], "question26": ["  The EPFO raised the  interest rate on Employees™  Provident Fund (EPF) by ______ basis points to  8.65 percent for 2018 - 19", "  10   "], "question27": ["  Who has been appointed as the first  Ombudsman  for the BCCI  -   Board of Control of Cricket in India  by the Supreme Court", "  Justice DK  Jain (retd.)   "], "question28": ["  India™s first Humanoid Police Robot named KP - BOT, ranked as Sub - Inspector (SI), was inducted  at  ", " ", "  Thiruvananthapura Police  , Kerala   "], "question29": ["  Which IT giant company recently launched  world's first folding smart phone", "  Samsung   "], "question30": ["  What is the name of the first folding smart phone  launched by Samsung", "  The Galaxy Fold   "], "question31": ["  The 12th edition of Asia's premier Air show 'Aero  India - 2019' began at Yelahanka Air Force Station.  Where is this venue", "  Bengaluru   "], "question32": ["  Govt. launched KUSUM programme with  what  objective", " Providing financial and water  security to farmers   "], "question33": ["  What is the full form of KUSUM", "  KisanUrja  Suraksha evamUtthaanMahabhiyan   "], "question34": ["  There are how many components in the KUSUM  scheme", "  Three    "], "question35": ["  The central govt. and the state govt., each will  provide __________ per cent subsidy for financing of  solar agriculture pumps under KUSUM scheme", "  30   "], "question36": ["  Prince Salman who visited India in 3rd week o"]}, {"page": 88, "question0": ["  Saudi Arabia recently became ____ member of the  International Solar Alliance", "  73rd   "], "question1": ["  Government launched an online initiative  SWAYATT on the Government e Marketplace  (GeM). Write its full form", "  Start - ups, Women and  Youth Advantage Through e - Transact ions   "], "question2": ["  The World Day of Social Justice is celebrated on  which day", "  February 20   "], "question3": ["  Which UN organization supports the promotion of  The World Day of Social Justice", "  International  Labour Organization     "], "question4": ["  What is the theme of this years' World Day of  Social Justic e", "  \" If You Want Peace &  Development, Work for Social Justice\"   "], "question5": ["  Indian Railways has created history by converting  a diesel locomotive into electric locomotive for  the first time in the world. Which railway  organization achieved this feat", "  DieselLocomotive W orks, Varanasi   "], "question6": ["  Which Union Ministry launched the Nyaya  Bandhu app for spreading the coverage of legal  aid", "  Law Ministry   "], "question7": ["  Government launched which major initiative  recently to provide better digital education in  schools, colleges and universities", "  OperationDigital Board   "], "question8": ["  Which international day is observed on February  21, with support from UNESCO for preserving the  linguistic diversity", "  International Mother  Language Day   "], "question9": ["  South Korea honoured our Prime Minister with an  international peace award. Can  you name it", "  Seoul Peace Prize   "], "question10": ["  Martin Ennals Award is conferred for outstanding  work in which field", "  Human Rights    "], "question11": ["  Who is the winner of the Martin Ennals Award for  2019", "  Abdul Aziz Muhamat   "], "question12": ["  Which country plans to replace the words  'mother' and 'father' with 'parent 1' and 'parent 2'  on official forms in an attempt to be more  inclusive to LGBT families", "  France   "], "question13": ["  Who has been selected as the Laureus  Sportswoman of the year", "  Simone Biles   "], "question14": ["  Who is Simone Biles", "  Star gymnast  from USA   "], "question15": ["  Who has been selected as the Laureus Sportsman  of the year", "  Novak Djokovic   "], "question16": ["  Novak Djokovic hails from which country", "  Serbia   "], "question17": ["  Which international team won the \"Laureus team  of the year\" award for 2019", "  Football W orld Cup  winner French team   "], "question18": ["  Which is the first major US Bank that launched a  crypto currency of its own", "  JP Morgan Chase  Bank   "], "question19": ["  What is the name of the crypto currency launched  by the JP Morgan", "  JPM Coin    "], "question20": ["  The crypto currency operations are usually based  o n which technology", "  Blockchain   "], "question21": ["  The International Hockey Federation announced  which player as the Female Player of the Year  2018", "  Eva De Goede, Netherlands   "], "question22": ["  The International Hockey Federation announced  which player as the Male Player of the Year 2018", "  Arthur van Doren of Belgium   "], "question23": ["  The RBI Board approved an early transfer of Rs.  28,000 crore to the government on what account", "  Interim dividend for the half year ending  December 31, 2018   "], "question24": ["  _____ won the 83rd edition of Senior National  Badminton Championships", "   SainaNehwal   "], "question25": ["  Irani Cup is associated with which sports", "  Cricket   "], "question26": ["  Which team won the 2019 Irani Cup", "  Vidarbha   "], "question27": ["  Who was the head of the committee setup for  \"Determining the Methodology for Fixation of the  National Minimum Wage\"", "  Anoop Satpathy   "], "question28": ["  Anoop Satpat hy committee recommended the  fixation of need based National Minimum Wage at  Rs. _______ per day", "  375   "], "question29": ["  Which series of Lok Sabha came to an end on 13th  February, 2019", "  16th    "], "question30": ["  What is the name of the pension scheme launched  for the workers of the unorganised sector", "  Pradhan Mantri Shram Yogi Maan - Dhan  scheme   "], "question31": ["  What is the amount of the minimum pension  assured under the Pradhan Mantri  Shram Yogi  Maan - Dhan scheme", "  Rs. 3,000/ -   "], "question32": ["  To  be eligible for pension under  Pradhan Mantri  Shram Yogi Maan - Dhan scheme, a persons salary  should not exceed _______ rupees", "  15,000/ -   "], "question33": ["  Only workers in the age group of _____ to _____ are  eligible for joining the Pradhan Mantri Shram Yogi  Maan - Dhan scheme", "  18 to 40   "], "question34": ["  World Radio Day is observed all over the world  on February 13. It is supported by which UN  organization", "  UNESCO   "], "question35": ["  The CCEA app roved the Credit Linked Capital  Subsidy and Technology Up - gradation Scheme for  what purpose", "  To facilitate technology up - gradation for improvement in quality of  products by MSMEs   "], "question36": ["  Often ,   we read in the newspapers that MSMEs  should aim at achieving ZED practices in  manufacturing processes. What is the full form of  ZED", "  zero defect and zero effect   "], "question37": ["  Dan David Prize is given in which country", "  Israel    "], "question38": ["  Sanjay Subrahmanyam won the Dan David Pri ze  2019. He is associated with which field", "  History   "], "question39": ["  What is the name of the new 24x7 satellit"]}, {"page": 89, "question0": ["  Which big bird has been selected as the mascot  for the CMS - COP 13", "  Great Indian Bustard   "], "question1": ["  Which UAE emirate has decided to include Hindi  as the third official language used in its courts,  alongside Arabic and English", "  Abu Dhabi   "], "question2": ["  Which country signed an MoU with Indian  government for training its 1800 Civil Servants at  the National Centre for Go od Governance in New  Delhi", "  Bangladesh   "], "question3": ["  The Grammy awards are conferred to recognize  outstanding performances in which field", "  Music   "], "question4": ["  Which city hosted the 61st Grammy Award on  February 10", "  Las Angeles (USA)   "], "question5": ["  Which musical creation won the Grammy \"Record  of The Year\"", "  This is America    "], "question6": ["  Grammy for the \"Album of the Year\" was won by  which Album", "  Golden Hour   "], "question7": ["  The BAFTA award are given to recognize  excellence in which field", "  Cinema and TV    "], "question8": ["  What is the full form of   BAFTA", "  British Academy  of Film and Television Arts   "], "question9": ["  Which film won the BAFTA award for the best  film", "  Roma   "], "question10": ["  Alfonso Cuaron won the BAFTA award for best  director for which film", "  Roma   "], "question11": ["  The first batch of four heavy lift transport  helicopters from USA was recently received in  India. Can you name this helicopter", "  CH - 47F  Chinook   "], "question12": ["  Which Indian badminton star signed a whopping  four - year sports sponsorship deal of Rs. 50 crore  with Chinese sports brand Li - Ning", "  P V Sindhu   "], "question13": ["  Which UN organization has said that 2018 was set  to be the fourth warmest year in recorded  history", "  World Meteoro logical Organisation   "], "question14": ["  Where are the headquarters of the World  Meteorological Organisation", "  Geneva,  Switzerland   "], "question15": ["  Which Indian corporate was conferred with the  Ernst & Young Lifetime Achievement Award", "  Azim Premji, Chairman of Wipro Ltd   "], "question16": ["  The Digital Civility   Index by Microsoft placed  India at which rank", "  7th    "], "question17": ["  China is the largest consumer of LPG in the world.  Which county is next to it", "  India   "], "question18": ["  Besides 'India Size' which are the other two most  popular global world sizes", "  UK Size and USA Size    "], "question19": ["  The RBI has decided to raise the criteria for 'bulk  deposits' for banks to Rs. _____ crore from the  current Rs. 1 crore", "  Two    "], "question20": ["  The 85th edition of the prestigious Ranji Trophy  was won by Vidarbha by beating which team", "  Saurashtra    "], "question21": ["  The Union Cabinet has ap proved setting up of the  Rashtriya Kamdhenu Aayog for what purpose", "  For conservation, protection and development  of cows   "], "question22": ["  The United Kingdom along with other European  nations such as Germany and France set up a new  transaction channel. What is the name of  this  channel", "  ‚INSTEX™ (instrument in support of  trade exchanges)   "], "question23": ["  Which Indian state was placed at the top in a  survey to study the best practices followed by  states in the budget formulation and  implementation", "  Assam   "], "question24": ["  ISRO launched successfully GSAT - 31 from Kourou  in French Guiana on board the Ariane - 5 rocket.  What type of satellite it was", "  Communication  satellite     "], "question25": ["  Which two super powers announced their  decision to  pull out of the three - decade - old  Intermediate - Range N uclear Forces Treaty", "  USA  and Russia   "], "question26": ["  Who became the first pontiff to visit the Arabian  peninsula (Abu Dhabi)", "  Pope Francis    "], "question27": ["  The United Nations announced 2019 as the  International Year of the Periodic Table. It is a  table of which items", "  Chemical elements   "], "question28": ["  How many chemical elements have been listed in  the Periodic Table", "  118   "], "question29": ["  Which international day is celebrated every year  to raise global awareness on the value of wetlands  for humanity and the planet", "  World Wetlands  Day    "], "question30": ["  World Wetlands Day is observed o n which date", "  February 02   "], "question31": ["  Which govt. department announced a new set of  policy rules formed for the regulation of business  of e - commerce companies", "  DPIIT   "], "question32": ["  What is the full form of DPIIT", "  Department for  Promotion of Industry and Internal Trade   "], "question33": ["  Which country became the 30th member of the  defence organization NATO", "  Republic of North  Macedonia   "], "question34": ["  Indian Banking Association has issued advisory  requesting banks to waive off the processing,  documentation, inspection and all other service  charges for which farmer loan scheme", "  Kisan  Credit Card and crop loans uptoRs.3 lakh   "], "question35": ["  Who has been appointed as the   new Director of  the Central Bureau of Investigation, CBI", "  Rishi  Kumar Shukla   "], "question36": ["  The first project under the Swadesh Darshan  Scheme was launched at the Zero Point. Where is  this place", "  Gangtok, Sikkim    "], "question37": ["  Which scheme was launched for integrated  development of   theme based tourist circuits in  the country in 2014 - 15", "  Swadesh Darsha"]}, {"page": 90, "question0": ["  Country™s second Tulip garden is to be setup in  Pithoragarh district of which state", "  Uttarakhand   "], "question1": ["  India recently replaced Japan as the world™s _____  largest steel producing co untry", "   2nd   "], "question2": ["  _____ is the largest producer of steel in the world", "  China   "], "question3": ["  ________ Airport retained its position as the world's  busiest airport for international customers for the  fifth consecutive year", "  Dubai   "], "question4": ["  In the Innovation Index  -   2019 compiled for top  60 economies of the world, India figured for the  first time, at what rank", "  54   "], "question5": ["  _______ continues to top the Innovation Index for  the sixth time in a row", "  South Korea   "], "question6": ["  The central banks of the _____ and ______   have  launched a common digital currency called  \"Aber\"", "  UAE, Saudi Arabia   "], "question7": ["  Which contingent was selected as the Best  Marching Contingent among the three services in  this year's Republic Day Parade", "  Gorkha Brigade  Contingent   "], "question8": ["  _______ won the prize for best  Marching Contingent  among paramilitary forces in this year's Republic  Day Parade", "  CRPF   JANUARY  Œ   2019   "], "question9": ["  January 30 Martyr Day of Mahatma Gandhi is  observed as which special day in India", "  Anti  Leprosy Day   "], "question10": ["  International Day of Education is observed on  which date", "  January 24   "], "question11": ["  Which international day is observed on last  Sunday of January to achieve the target of zero  cases of leprosy - related disabilities", "  World  Leprosy Day   "], "question12": ["  What is the formal name given to the India's  fastest train T18", "  Vande Bharat   "], "question13": ["  The train Vande Bharat Express will run between  which two cities", "  NewDelhi  -   Varanasi   "], "question14": ["  Oxford dictionaries declared ________ as the Hindi  word for the year 2018", "  ‚Nari Shakti™   "], "question15": ["  Ace shuttler SainaNehwal recently won which  international title for the first time", "  Indonesia  Masters, Jakarta    "], "question16": ["  Australian Open, year™s first Grand Slam of Tennis  was held in which city", "  Melbourne   "], "question17": ["  __________ won the Men's single title of Australian  Open  for the record 7th time", "  Novak Djokovic   "], "question18": ["  Name   the first woman Japanese player to win the  singles title  at   Australian Open", "  Naomi Osaka   "], "question19": ["  India celebrated its _________ Republic Day on  January 26, 2019", "  70th   "], "question20": ["  Cyril Ramaphosa was the Chief Guest on this  year's Republic Day Parade. Who is he", "  President  of South Africa   "], "question21": ["  Contingent of which paramilitary force created  history on becoming the first ever all women  contingent to take part in Republic Day Parade", "  Assam Rifles    "], "question22": ["  Special tourist train named ______ has been started  to visit places linked with Dr. Ambedkar", "  Samantha Express   "], "question23": ["  What is the title of the recent book by Malala  Yousafzai", "  We Are Displaced", " -   My Journey and  Stories from Refugee Girls Around the   World   "], "question24": ["  Who is the author of the popular book \"The  Wicked King\"", "  Holly Black   "], "question25": ["  The Union Government Instituted an annual  award titled ‚Subhash Chandra Bose  AapdaPrabandhanPuraskar' for what purpose", "  To  reward persons engaged in disaster  management   "], "question26": ["  NASA's M ars rover named ____________completed  15 years of its touchdown on the surface of Mars", "  Opportunity   "], "question27": ["  Name the famous women folk singer who has  been listed for awarding of Padma Vibhushan", "  Teejan Bai   "], "question28": ["  Who is A M Naik whose name figures in the four  Padma Vibhushan declare this year", "  Chairman of  Larsen & Toubro    "], "question29": ["  Former CAG V K Shunglu has been awarded which  Padma award this year", "  Padam Bhushan    "], "question30": ["  Name the iconic face of MDH spices who has been  decorated w ith the Padma Bhushan", "  Mahashay  Dharam Pal Gulati   "], "question31": ["  What is the full name of Bharat Ratna Awardee  Nanaji Deshmukh", "  ChandikadasAmritrao  ‚Nanaji™ Deshmukh   "], "question32": ["  Nanaji Deshmukh established India™s first  university devoted to rural development. Name  this university", "  ‚ChitrakootGramoday  Vishwavidyalaya ,  Chitrakoot, Madhya Pradesh   "], "question33": ["  Sultan Abdullah Sultan Ahmad Shah has been  elected as _______ new king by the members  of the  country's royal families", "  Malaysia   "], "question34": ["  National Voters Day is observed on which date", "  January 25   "], "question35": ["  What is the theme of this year's National Voters  Day", "  No Voter to be left behind   "], "question36": ["  Which two satellites were launched successfully  by ISRO on board its rocket PSLV C 44", "  Kalam - Sat  and Microsat R   "], "question37": ["  Ashoka Chakra, country's highest peacetime  gallantry award was conferred posthumously  upon Lance Naik _________.", "  Nazir Ahmed Wani   "], "question38": ["  National Gi rl Child Day is observed on which date", "  January 24   "], "question39": ["  Virat Kohli created history by becoming first ever  cricketer to win all the three top most ICC  honours. Name these awards", "  Cricketer of th"]}, {"page": 91, "question0": ["  Which national institution announced country™s  first and only the third globally full - fledged  graduation programme in Artificial Intelligence  (AI) technology", "  IIT Hyderabad   "], "question1": ["  Which neighbouring country in India has banned  use of Indian currency notes of Rs . 2,000, Rs . 500  and Rs . 200 denominations", "  Nepal   "], "question2": ["  Name the India™s topranking tennis star won the  International Tennis Federation's   $25,000  Women's tournament in Singapore", "  Ankita Raina   "], "question3": ["  As per the Global Trust Index, released by the  World Economic Forum, ________ is the most  trusted country in the world", "  China   "], "question4": ["  As per the Global Trust Index, released by the  World Economic Forum, India has been placed at  which rank", "  Second   "], "question5": ["  India will host   the 14th session of the Conference  of Parties to the UNCCD in Oct 2019. What is  UNCCD", "  United Nations Convention to Combat  Desertification   "], "question6": ["  The Home Ministry has notified that from now  onwards ____________ will be valid travel  documents for Indians under  15 and over 65  travelling to Nepal and Bhutan", "  Aadhaar cards   "], "question7": ["  In the  ‚ Khelo India ™   Youth Games concluded on  January 20, which state topped the medal tally", "  Maharashtra  -   228 Medals   "], "question8": ["  In which Indian state  is  first Defence Industrial  Corridor of Indialocated", "  Uttar Pradesh   "], "question9": ["  The Vibrant Gujarat Summit was hosted by which  city in Gujarat", "  Gandhinagar   "], "question10": ["  The annual meet of WEF is always held at one  particular city of Switzerland. Can you name it", "  Davos   "], "question11": ["  The United Nations Educational, Scientific, and  Cultural Organization (UNESCO) has announced  that the Brazilian city of ___________will be the  World Capital of Architecture for 2020", "  Rio de  Janeiro   "], "question12": ["  Name the Bharat Rattan Awardee scientist who  has been conferred Sheikh Saud International  Prize for Materials Research", "  CNR Rao   "], "question13": ["  The Pravasi Bhartiya Diwas is observed on which  date", "  January 9   "], "question14": ["  The Pravasi Bhartiya Diwas is observed on  January 9 to commemo rate which historical  event", "  Return of Mahatma Gandhi from South  Africa in 1915   "], "question15": ["  The government will soon set up over 460 more  Eklavya Model Residential Schools across the  country. What is the objective of these schools", "  Providing free education to tribal  students   "], "question16": ["  An Eklavya Model Residential School has to be  setup in every block of the country having  more  than ______ percent ST population and at least  20,000 tribal persons", "  50   "], "question17": ["  The ISRO launched the UNNATI (UNispace Nano - satellite Assembly and Training by ISRO)  programme with what objective", "  To promote  capacity building on nanosatellite  development   "], "question18": ["  The Union Cabinet has approved the  recapitalization of Export Import Bank of Indi a  (Exim Bank) to the tune of Rs ________crore", "  6,000   "], "question19": ["  Govt. has approved to increase the authorized  capital of Exim Bank to Rs. _______ crore, from Rs.  10,000 crore at present", "  20,000   "], "question20": ["  Global chemical giant BASF has signed a MoU with  the Adani Group to inv est  •2 billion (Rs. 16,000  crore) for what purpose", "  To set up a mega  chemical plant in Gujarat at Mundra port  complex   "], "question21": ["  The BASF company is based in which country", "  Germany   "], "question22": ["  Name the private sector Indian company which  became first to  report a quarterly  profit of more  than Rs . 10,000 crore", "  Reliance Industries Ltd  (RIL)   "], "question23": ["  Name the boy from Tamil Nadu who became the  youngest Indian (and second youngest in the  world)   to win the Grand Master title at 12 years, 7  months and 17 days", "  D Gukesh   "], "question24": ["  Name the young moun taineer from Kolkata who  conquered Antarctica's highest volcano point,  Mount Sidley", "  SatyarupSiddhanta   "], "question25": ["  What is the name of the global prize having a cash  award of Rs.   One  crore, instituted by the govt. of  India in the honour of Mahatma Gandhi", "  Gandhi  Peace Prize   "], "question26": ["  Who is the winner of the Gandhi Peace Prize  2018", "  YoheiSasakawa   "], "question27": ["  The government launched two TV channels  devoted to science and technology. What is their  name", "  DD Science, India Science   "], "question28": ["  Which Union Ministry organised 9th International  Micro I rrigation Conference in Aurangabad,  Maharashtra", "  Ministry of Water resources and  River Development   "], "question29": ["  Government e Marketplace [GeM] has launched  ﬁWomaniya on GeMﬂ   initiative with what  objective", "  To enable women entrepreneurs to  sell online handicrafts ,   home   décor and office  furnishings, directly to various Govt outfits   "], "question30": ["  India and the five Central Asia nations held their  first ever India - Central Asia Dialogue on January  13 at which place", "  Samarkand, Uzbekistan   "], "question31": ["  A country in North of Greece changed its official  name by passing a resolution in its parliament.  Name this country", "  Republic of North  Macedonia"]}, {"page": 92, "question0": ["  Abhinav Shaw, the ten year old boy from Asansol,  West Bengal, became the youngest gold medalist  at the Khelo India Youth Games, in which sports", "  Shooting   "], "question1": ["  Karnataka swimmer Srihari Nataraj was in news  for which of her achievement at the Khelo India  Youth G ames", "  Winningrecord 7 gold medals in  swimming, highest in the Games   "], "question2": ["  The Indian army celebrates the Army Day on  which date", "  January 15   "], "question3": ["  The Army Day is observed on January 15 to  commemorate which historical event", "  Ha nding  over of charge of Indian Army to I ndian  General in 1949 on this day      "], "question4": ["  Who was the first Indian Commander - in - Chief of  the Indian Army", "  Lt Gen K M Cariappa   "], "question5": ["  Name the Indian dignitary who was honoured  with the first edition of the prestigious global  award  -   Philip Kotler Presidential Award", "   Narendra Modi   "], "question6": ["  The 11th edition of EIU Global Democracy Index  2018 was topped by which country", "  Norway   "], "question7": ["  India was placed at which rank in the 11th edition  of EIU Global Democracy Index 2018", "  41 st   "], "question8": ["  Which day is celebrated across the country on  January 12 to promote youth related activities to  commemorate the birth anniversary of Swami  Vivekananda", "  National Youth Day   "], "question9": ["  What was the name of Guru of Swami  Vivekananda", "  Ramakrishna Paramhansa   "], "question10": ["  What was the   original name of Swami  Vivekananda", "  Narendra Nath Datta   "], "question11": ["  The world's largest spiritual gathering  -   The  Ardh - Kumbh started on which festival and will  continue till which festival", "  Makar Sankranti - Jan  15, Maha - Shivratri  -   March 4   "], "question12": ["  _________has become first state in India to  announce the benefits of 10 per cent quota for  Economically Weaker Sections of general  category in educational institutions and  government jobs from Jan 14", "  Gujarat   "], "question13": ["  Renuka Ji Dam is to be constructed on which ri ver  and at which place", "  On river Giri, Near Sirmour  District, Himachal Pradesh    "], "question14": ["  India™s longest 300 - meter single lane steel cable  suspension bridge was inaugurated in which  state", "  Arunachal Pradesh   "], "question15": ["  Union Ministry of Environment, Forest and  Climate Change launched which programme to  tackle the increasing air pollution problem across  the country in a comprehensive manner", "  National Clean Air Programme   "], "question16": ["  Which day is celebrated across the world on  January   10 to popularize and promote the use of  Hindi Language", "  World Hindi Day    "], "question17": ["  The sea planes will be operated under the UDAN  Scheme of the govt. The acronym UDAN is stands  for what", "  UdeDesh ka AamNagrik   "], "question18": ["  Col. Ranveer Singh Jamwal, the adventure loving  Colonel   has become the first Army officer for  which achievement", "  Havingscaled the seven  highest mountain summits in each of the  seven continents   "], "question19": ["  In a ﬁmassive reliefﬂ to small businesses, the GST  Council doubled the limit for exemption from GST  to Rs. ____ ___ _ l akh from Rs. 20 lakh earlier ", " 40   "], "question20": ["  The turn over limit for   small traders and  businesses paying 1 percent GST on the turnover  has been increase d   to Rs. ____ crore", "  1.5   "], "question21": ["  As per the Henley Passport Index 2019 which  passport has been ranked as the world's most  powerful passport in 2019", "  Japan   "], "question22": ["  As per the Henley Passport Index 2019, Indian  passport enjoys ________ rank having friendly  access to only 61 countries", "  79th    "], "question23": ["  A report by World Economic Forum says that  ________ is set to become the world's third largest  consumer market behind only USA and China by  2030", "  India   "], "question24": ["  A recent amendment to the Citizenship Act, 1955  seeks to make illegal migrants who are Hindus,  Sikhs, B uddhists, Jains, Parsis and Christians from  3 countries, eligible for Indian citizenship", " Name  these three countries", "  Afghanistan, Bangladesh,  Pakistan   "], "question25": ["  Govt. launched an online campaign,  ‚WebWonderWomen™ with what objective", "  To  discover and celebrate the  exceptional  achievements of women working for social  change via social media   "], "question26": ["  The International Cricket Council (ICC) has  admitted which country as its 105th member", "  USA   "], "question27": ["  Which tennis star created the record of having  won  the Hopman Cup for a record third time", "  Roger Federer   "], "question28": ["  As per the December - end data released by  Association of Mutual funds in India (AMFI),  which mutual fund is largest AMC in India", "  HDFC  Mutual Fund   "], "question29": ["  Which country's spacecraft, has made the first - ever la nding on the far side of the moon, the side  that perpetually faces away from the Earth", "  China   "], "question30": ["  The Ministry for Information & Broadcasting has  decided the sharing of All India Radio News with  which other media outfit", "  Private FM  broadcasters   "], "question31": ["  The latest data released by the CSO shows that the  income earned by an average Indian doubled in 7  years, from Rs 63,642 per year in 2011 - 12 to Rs  _____ lakh in 2018 - 19", "  1.25 lakh   "], "question32": ["  Kumar Rajesh Chandra, senior IPS officer ha"]}, {"page": 93, "question0": ["  The RBI recently released guidelines on  introducing which new process for various card  transactions, including from debit and credit  cards", "  Tokenisation   "], "question1": ["  New food packing guidelines by FSSAI prohibit  use  of which items for wrapping food articles", "  Recycled plastics and newspapers   "], "question2": ["  RBI has constituted a high level committee  headed by UIDAI™s former Chairman __________ on  Deepening of Digital Payments", "  Nandan Nilekani   "], "question3": ["  Recently which articles of constitution  have been  amended to provide for 10% reservation to EWS  in general category", " Article 15 and  Article  16   "], "question4": ["  To be eligible for 10% reservation, annual family  income should be less than Rs.   __ ____ lakh", "  8   "], "question5": ["  Families that  have   agriculture land above _____  acre are not eligible for 10% EWS reservation", "  5   "], "question6": ["  The recent amendment to the constitution  providing for 10% reservation to EWS in general  category is ______ amendment of the constitution", "  103 rd   "], "question7": ["  __________, India born Economi st became the first  woman to join International Monetary Fund as its  Chief Economist", "  Gita Gopinath   "], "question8": ["  Name the Indian fast bowler who  became the  highest international wicket - taker across all  formats in 2018, claiming 78 wickets", "  JaspritBumrah   "], "question9": ["  The Union Hom e Ministry approved the Uttar  Pradesh government™s proposal to rename  Allahabad as _________", "  Prayagraj   "], "question10": ["  Who became world's first woman amputee to  climb Mount Vinson, the highest peak in  Antarctica", "  Arunima Sinha   "], "question11": ["  Which state of India topped ‚ Ease of Doing   Business Index ™   rankings  given  by Asia  Competitiveness Institute, Singapore", "  Andhra  Pradesh   "], "question12": ["  The RBI has recently formed UK Sinha committee  for what purpose", "  To  propose long - term  solutions for revival of the micro, small and  medium enterprises (MSME)  sector   "], "question13": ["  The Golden Globe Awards are conferred to  recognize excellence in ________ ", "  Cinema and TV   "], "question14": ["  The Golden Globe Awards are given in which  country", "  USA   "], "question15": ["  The Bohemian Rhapsody won the Golden Globe  Awards in which category", "  Best Picture, Drama   "], "question16": ["  Alfonso Cuaron won the Golden Globe  award  for  Best Director for which film", "  Roma   "], "question17": ["  Indian cricket team created history by winning  their first ever series on Australian soil. What was  the name of this series", "  Border - Gavaskar  Trophy   "], "question18": ["  Who has been re - elected a s the Bangladesh Prime  Minister after her party Awami League achieved  landslide victory in recent general elections", "  Sheikh Hasina   "], "question19": ["  Which two countries officially quit the United  Nations Educational, Scientific and Cultural  Organization (UNESCO) with the c lose of 2018", "  USAand Israel   "], "question20": ["  Who has been appointed as the head of the  Central Information Commission", "  Sudhir  Bhargava   "], "question21": ["  At which place in India 3 islands were  renamed as  a tribute to Netaji Subhas Chandra Bose", "   Andaman & Nicobar   "], "question22": ["  For which major project of ISRO the Union  Cabinet approved  a budget of Rs. 10,000 crore", "  Gagan - yaan Project   "], "question23": ["  What is the main objective of the Gaganyaan  Project", "  To send three Indian astronauts in  space for up to seven days by 2022   "], "question24": ["  Madhya Pradesh has decl ared Kuno wildlife  sanctuary as a national park for translocation of  which endangered animal", "  Asiatic lions from Gir  in Gujarat   "], "question25": ["  Niti Aayog released the 2nd Delta Ranking of the  Aspirational Districts Programme. Which are  AspirationalD istricts", "  115 most ba ckward  districts of the country   DECEMBER  Œ   2018   "], "question26": ["  The birthday of former Prime Minister Atal Bihari  Vajpayee on Dec ember   25 is celebrated as which  special day", "  Good Governance Day    "], "question27": ["  Indian firm India Ports Global Ltd. recently  formally took over the operations of Shaheed  Behesti port at which place", "  Chabahar, Iran   "], "question28": ["  RBI has appointed ________ to head the committee  that will decide on the appropriate size of  reserves that the central ba nk should maintain", "  Dr. Bimal Jalan   "], "question29": ["  In which state  did  its own new High Court started  functioning from Jan 1, 2019", "  Andhra Pradesh    "], "question30": ["  The Andhra Pradesh High Court is ______ High  Court of the country", "  25th   "], "question31": ["  Name the PM of Bhut an who came to India on a 3  day   visit", "  Dr. LotayTshering   "], "question32": ["  ___________ police station near Bikaner in Rajasthan  has been adjudged best in the country", "  Kalu   "], "question33": ["  National Farmers Day is observed on which date", "  December 23   "], "question34": ["  Burundi, a tiny country in north west of Tanzania,  was in news rece ntly for what reasons", "   It  changed its capital to city of Gitega   "], "question35": ["  What is the name of India™s longest rail - road  bridge opened recently", "  Bogibeel Bridge   "], "question36": ["  Bogibeel bridge has been built across which river", "  Brahmaputra"]}, {"page": 94, "question0": ["  The Bogibeel bridge connects which two states of  North East India", "  Assam and Arunachal Pradesh   "], "question1": ["  India observes the National Consumer Day on  which date", "  December 24   "], "question2": ["  Which state launched Krushak Assistance for  Livelihood and Income Augmentation (KALIA), to  provide farmers Rs 10,000 a year for their crops", "  Odisha   "], "question3": ["  The New York best seller \"Queen of Air and  Darkness\" is a book written by which author", "  Cassandra Clare   "], "question4": ["  \"Once Upon A River\" is a popular novel written by  which author", "  DianeSetterfield   "], "question5": ["  Which day is observed to honour the birthday of  legendary Mathematician Srinivasa Ramanujan", "  National Mathematics Day   "], "question6": ["  National Mathematics Day is observed on which  date", "  December 22   "], "question7": ["  What is the name of the new national honour to  be instituted for promoting national integration", "  Sardar Patel Award for National Integration   "], "question8": ["  Vedangi Kulkarni from Pune became the fastest  Asian in which context", "  Covering the globe on  cycle   "], "question9": ["  The country™s first music museum is to be set up  at which place", "  Thiruvaiyaru, Tamil Nadu   "], "question10": ["  What is the nick name of the heavenly body  discovered recently that is farthest from the Sun  in our solar system", "  Farout   "], "question11": ["  Globally which day is observed on December  18  to support the cause of migrants", "  International  Migrants Day    "], "question12": ["  What is the theme of this year's International  Migrants Day", "  Migration with Dignity    "], "question13": ["  India has been ranked _______ in World Economic  Forum (WEF) Gender Gap Index 2018, compiled  for 149 coun tries", "  108 th   "], "question14": ["  Which country has been ranked at No. 1 for  minimizing the Gender Gap among her citizens", "  Iceland    "], "question15": ["  The International Tennis Federation (ITF) named  Serbia™s ________ as the 2018 ITF World Champion -   Men", "  Novak Djokovic    "], "question16": ["  Who has been named as the 2018 ITF World  Champion -   Women", "  Simona Halep    "], "question17": ["  Simona Halep hails from which country", "  Romania   "], "question18": ["  Golden Shoe Award is given in recognition of  which achievement", "  Scoring highest football  goals in the year in Europe    "], "question19": ["  Who won the Golden Shoe Award 2018 by scoring  34 goals", "  Lionel Messi    "], "question20": ["  Who is the winner of this year's UN Human Rights  Prize", "  LateAsma Jahangir   "], "question21": ["  Who was Asma Jahangir", "  Pakistan™s renowned  social activist   "], "question22": ["  As per the Startup Ranking 2018 released by the  Mi nistry of Commerce and Industry, ________  emerged as the best performing state", "  Gujarat    "], "question23": ["  ________ has been appointed as the Ambassador of  India to the United States of America", "  Harsh  Vardhan Shringla   "], "question24": ["  The IAF recently tested flying which aircraft with  biofuel mixture", "  AN - 32 Transport Aircraft    "], "question25": ["  Which biofuel was used to mix with the aviation  turbine fuel in a recent test on AN - 32 aircraft", "  Jatropha oil   "], "question26": ["  The finals of the FIH Hockey World Cup 2018  were p layed in which city", "  Bhubaneswar, Odisha   "], "question27": ["  The Belgium won the Hockey World Cup 2018 by  defeating which country", "  Netherlands   "], "question28": ["  Kaiga Atomic Power Station in Karnataka was in  news for what reasons", "  For setting world record  of operating uninterrupted for 941 d ays    "], "question29": ["  Merriam - Webster, the noted American dictionary  has chosen _______ as its 2018 word of the year", "  Justice   "], "question30": ["  Catriona Elisa Gray from Philippines won which  international beauty crown recently", "  Miss  Universe 2018   "], "question31": ["  Why we celebrate Vijay Diwas on December 16", "  To mark the victory of Indian forces over Pak  forces in 1971 war   "], "question32": ["  _________ has been elected as the Chief Minister of  Rajasthan", "  Ashok Gehlot   "], "question33": ["  Bhupesh Baghel has recently been elected as Chief  Minister of which state", "  Chhattisgarh   "], "question34": ["  _________ has been elected as the Chief Minister of  Madhya Pradesh", "  Kamal Nath    "], "question35": ["  What is the name of the recently elected Chief  Minister of Mizoram", "  Zoramthanga   "], "question36": ["  K. Ch andrasekhar Rao has been re - elected as the  Chief Minister of which state", "  Telangana   "], "question37": ["  What is the name of the new search engine  launched by Google for online shopping lovers", "  Google Shopping   "], "question38": ["  ________ won the 'Breakthrough Table Tennis Star'  award at the IT TF Star Awards in Incheon, South  Korea", "  Manika Batra   "], "question39": ["  The Aga Khan Gold Cup is associated with which  sports", "  Hockey   "], "question40": ["  As per the Climate Change Performance Index  -   2019, what is India's rank in terms of controlling  release of greenhouse gases", "  11th   "], "question41": ["  As per the Climate Change Performance Index  -   2019, _______ is the best country in terms of  controlling release of greenhouse gases", "  Sweden   "], "question42": ["  What is the name of apex constitutional body  formed for development of policies and strategies  to reduce the energy   use", "  Bureau of Energy  Efficiency"]}, {"page": 95, "question0": ["  National Energy Conservation Day is observed on  which date", "  December 14   "], "question1": ["  Who is the winner of this year's  JnanpithAward", " Amitav Ghosh    "], "question2": ["  Amitav Ghosh is a famous writer of which  language", "  English   "], "question3": ["  What is the amount of cash award given in the  Jnanpith Award", "  Rs. 11 lakh   "], "question4": ["  Which UN organization supports the celebration  of the International Universal Health Coverage  Day on December 12", "  WHO  -   World Health  Organization   "], "question5": ["  Who has been appointed as the new  President of  the Film and Television Institute of India (FTII),  Pune", "  BP Singh   "], "question6": ["  BP Singh is the producer / director of which   famous TV serial", "  CID   "], "question7": ["  Legendary boxer MC Mary Kom was recently  honoured with Meethoileima award by which  state", "  Manipur   "], "question8": ["  The Indian Navy inducted its first DSRV for what  purpose", "  To conduct submarine rescue  operations   "], "question9": ["  What is the full form of DSRV", "  Deep  Submergence Rescue Vehicle   "], "question10": ["  The International Anti - Corruption Day is  observed around the world on which date", "  December 09   "], "question11": ["  The Northeast Frontier Railway is constructing  the world™s tallest girder railway bridge in which  state", "  Manipur   "], "question12": ["  Which International Day is observed on  December 11 to encourage sustainable  development in mountains", "  International  Mountain Day   "], "question13": ["  PrathameshM aulingkar,boy from Goa created  history by becoming the first Asian/Indian to  win____ ____ ___ title", "  Mr. Supranational   "], "question14": ["  The Time magazine named _______ as the \"Person  of the Year\" for 2018", "   Jamal Khashoggi   "], "question15": ["  Who has been appointed as the new Governor of  RBI", "   S. Das   "], "question16": ["  With the beginning of Kannur international  Airport, ________ has become the first state to have  four international airports", "  Kerala   "], "question17": ["  _________ form the largest diaspora in terms of  sending remittances to their country,  a whopping  $ 80 billion in 2 018", "   Indians    "], "question18": ["  Which international day is observed on December  10 to commemorate Universal Declaration of  Human Rights", "  Human Rights Day   "], "question19": ["  What is the approximate range of the ICBM Agni - V", "  5000 kms   "], "question20": ["  What is the full form of ICBM", "  Inter - C ontinental  Ballistic Missile   "], "question21": ["  Government has decided to hike its contribution  to NPS (National Pension Scheme) to ______ per  cent from existing 10 per cent", "  14   "], "question22": ["  Shubhankar Sharma, 22,    the youngest Indian to  win the 2018 Asian Tour Order of Merit  C hampion, is associa ted with which sports", "  Golf   "], "question23": ["  The government cleared a proposal to implement  the Shahpur Kandi Dam Project in which state", "  Punjab   "], "question24": ["  The Shahpur Kandi Dam Project is being built on  which river", "  Ravi    "], "question25": ["  Which carrier has become the first domestic  airline to hav e 200 aircraft in its fleet", "  IndiGo   "], "question26": ["  Which country witnessed month long \"Yellow  Vests\" demonstrations against fuel tax rises, high  living costs and other issues", "  France   "], "question27": ["  The Food and Agriculture Organisation (FAO)  Council of the United Nations approved India™s  proposal to observe the year _______ as the  International Year of Millets", "  2023   "], "question28": ["  Maharashtra launched project SMART in 10,000  villages to achieve sustainable farming . What is  the full form of SMART", "  State of Maharashtra  Agribusiness and Rural Transformation   "], "question29": ["  Vanessa Ponce de Leon of Mexico won which  coveted international beauty crown recently", "  Miss World 2018   "], "question30": ["  To commemorate induction of its first submarine,  the India n Navy celebrates December 9 as what  day", "  Submarine Day    "], "question31": ["  The NITI Aayog recently launched 'AI 4 All Global  Hackathon' to explore new frontiers in which  field", "  Artificial Intelligence   "], "question32": ["  Which country plans to make all public  transportation free to minimize  traffic congestion", "  Luxembourg   "], "question33": ["  Which Union Ministry won the Skoch Award for  National Significance for promoting 73 GW  renewable energy capacity in the country", "  Ministryof New and Renewal Energy   "], "question34": ["  Who has been appointed as the new Chief  Economic Advisor to the Govt of India, for a  period of 3 years", "  Dr. Krishnamurthy  Subramanian   "], "question35": ["  Which national day is observed on December 07,  to express gratitude to the martyrs as well as the  men and women in unifor m", "  Armed Forces Flag  Day   "], "question36": ["  Who is Eliud Kipchoge, the winner of this year's  IAAF Athlete of the year  -   male award", "  World  marathon record holder from Kenya   "], "question37": ["  Name the jump queen from Colombia who won  this year's IAAF  female  Athlete of the year  -   award", "  Cateri neIbarguen   "], "question38": ["  Which country has overtaken Iraq to become the  world™s deadliest country for terrorism, accordin"]}, {"page": 96, "question0": ["  Based on the results of a popular vote, Cambridge  Dictionary has named ________ as the Word of the  Year, 2018", "  Nomophobia   "], "question1": ["  What is the meaning of \"nomophobia\"", "  Fear of  being without mobile phone   "], "question2": ["  With which country India recently signed a pact  on currency swap to enable  the two countries  to  trad e   in their own currency", "  United Arab  Emirates   "], "question3": ["  Which day is observed on December 6 all around  the world to focus attention on the importance of  healthy soil", "  World Soil Day   "], "question4": ["  The European Central Bank launched a new  digital payment system  -   TIPS recently. Write full  form of TIPS", "  Target Instant Payment  Settlement   "], "question5": ["  The ISRO successfully launched GSAT - 11, its  heaviest ever satellite from which space port", "  Kourou Launch Zone, French Guiana in South  America   "], "question6": ["  What is the main function of the GSAT - 11  satellite", "  Providing enhanced high speed  broadband services  in remote rural areas   "], "question7": ["  Which Maharatna company recently crossed the  milestone of generating 5 trillion units of  electricity as on November 30 since its inception  in Nov 1975", "  NTPC - National Thermal Power  Corporation   "], "question8": ["  Which Arabian county recently announce i ts  withdrawal from the oil cartel OPEC", "  Qatar   "], "question9": ["  What is the full form of OPEC", "  Organization of  Petroleum Exporting Countries   "], "question10": ["  The Headquarters of OPEC are located in which  city", "  Vienna, Austria     "], "question11": ["  Which star footballer won the coveted Ballon d'Or  award for 2018", "  Luka Modric ( Croa"], "question12": ["  "], "question13": ["  Indian Navy Day marks the crucial victory of the  Indian navy on which enemy port", "  Karachi,  Pakistan   "], "question14": ["  _______ has become the first state in the North East  to launch comm on emergency number ‚112™", "  Nagaland (Himachal Pradesh was first in India)   "], "question15": ["  Who is the first Indian to be elected to the seven  member Judges Committee of the International  Shooting Sports Federation (ISSF)", "  Pawan Singh   "], "question16": ["  Delegates from nearly 200 nations took   part in  the two - week long COP 24 (conference of parties)  at which place", "  Katowice, Poland    "], "question17": ["  COP 24 made efforts to find ways to implement  the provisions of which important climate treaty", "  2015 Paris treaty   "], "question18": ["  December 03 aims to promote the rights and  well - being of persons with disabilities in all  spheres of society. What is formal name of this  day", "  International Day of Persons with  Disabilities   "], "question19": ["  ____________ became the first Indian state to launch  a single eme rgency number ‚112™", "  Himachal  Pradesh   "], "question20": ["  Which 3 countries recently signed the USMCA  trade agreement", "  USA, Mexico and Canada   "], "question21": ["  This day provides an opportunity for people  worldwide to unite in the fight against HIV and to  show support for people living with H IV. Name  this day", "  World AIDS Day   "], "question22": ["  World AIDS Days is observed on which date", "  December 01   "], "question23": ["  What is the theme for this year's World AIDS Day", "  Know Your Status   "], "question24": ["  The Blue Cross, the highest honour in the sport of  shooting, has recently been conferred on which   Indian sports person", "  Abhinav Bindra   "], "question25": ["  Which initiative has been launched to introduce  school students to 22 Indian languages listed in  the Constitution", "  Bhasha Sangam   "], "question26": ["  Which state organizes Hornbill festival to  showcase its rich culture, traditions and rituals", "  Nagaland   "], "question27": ["  Name the grand master who won the World Chess  Championship for the fourth time in a row", "  Magnus Carlsen, Norway   "], "question28": ["  Azim Premji, IT tycoon was recently hon oured  with highest civil award of France. Name the  award", "  Knight of the Legion of Honour   "], "question29": ["  A collection of speeches of President R . N . Kovind  has been published as a book under which title", "  The Republican Ethic   "], "question30": ["  What is the title of the book written by former   PM  Manmohan Singh, released in December 2018", "  Changing India   "], "question31": ["  International Day for Elimination of Violence  against Women is observed on which date", "  November 25   "], "question32": ["  What is the theme of this year's International Day  for the Elimination of Violence against Women", "  ﬁOrange the World", "  #HearMeTooﬂ.   "], "question33": ["  ﬁOrden Mexicana del Águila Aztecaﬂ is one of the  highest civilian honour of which country", "  Mexico   "], "question34": ["  Name the Indian honoured this year with the  ﬁOrden Mexicana del Águila Aztecaﬂ", "  Prof.  Shyama Prasad Ganguly   "], "question35": ["  India observes the Constitution Day on which  date", "  November 26   "], "question36": ["  The Constitution of India was implemented from  which date", "  January 26, 1950   "], "question37": ["  Team f rom which country won the Women's  World T20 Championship", "  Australia   "], "question38": ["  Nahid Afrin, popular singer of Assam has been  appointed as the first 'Youth Advocate' of th"]}, {"page": 97, "question0": ["  The ‚SHe - Box™ portal has been created fo r what  purpose", "  To report complaints of sexual  harassment at the workplace   "], "question1": ["  The ‚SHe - Box™ portal has been created by which  Union Ministry", "  The Ministry of Women and  Child Development   "], "question2": ["  What is the name of the highest international  body of the world for  accurate and precise  measurements", "   General Conference on Weights  and Measures   "], "question3": ["  What is the approximate location of the tiny  island country Papua New Guinea", "  North of  Australia in South Pacific Ocean   "], "question4": ["  Subroto Cup is associated with which sports", "   Football   "], "question5": ["  W hich team lifted the Subroto Cup International  Football Tournament  -   Junior", "  Bangladesh Krida  Shiksha Prothishtan   "], "question6": ["  Where in India is being constructed country's first  \"Justice City\"", "  Amaravati, Andhra Pradesh   "], "question7": ["  Who is the youngest ever (14 years) goodwill  a mbassador of UNICEF, appointed on the occasion  of World Children™s Day", "  Millie Bobby Brown   "], "question8": ["  Who is Millie Bobby Brown", "  Popular star of hit  Netflix series ﬁStranger Thingsﬂ   "], "question9": ["  World / Universal Children™s Day is observed on  which date", "  November 20   "], "question10": ["  Which UN  organization supports the celebration  of World Children's Day", "   UNICEF   "], "question11": ["  Name the winner of this year's Indira Gandhi  Prize for Peace, Disarmament and Development", "  Centre for Science and Environment   "], "question12": ["  The Indira Gandhi Prize for Peace, Disarmament  and Develop ment is awarded by which  organization", "  Indira Gandhi Trust, New Delhi   "], "question13": ["  What is the amount of cash prize given in the  Indira Gandhi Prize for Peace, Disarmament and  Development", "  Rs .  25 lakh   "], "question14": ["  Wasim Jaffer became the first Indian batsman to  touch the 11,000 - r un figure in which national  tournament", "  Ranji Trophy   "], "question15": ["  The Cabinet Committee on Economic Affairs has  approved 100% mandatory packaging of which  item in Jute bags", "  Foodgrains   "], "question16": ["  Which committee has suggested creation of a new  asset management company to resolve high value  NPAs", "  Sunil Mehta Committee   "], "question17": ["  What is the name of the proposed new asset  management company to resolve high value  NPAs", "  Sashakt India Asset Management   "], "question18": ["  What is the cut off limit for NPA cases to be  handled by the Sashakt India Asset Management", "  Above Rs. 500 crore   "], "question19": ["  Prime Minister Modi recently inaugurated KMP  expressway. What is KMP", "  Kundli  -   Manesar  -   Palwal   "], "question20": ["  KMP expressway is aimed to reduce considerably  vehicular pollution in which area", "  Delhi   "], "question21": ["  In a global annual ranking of 63 countries in  developing, attracting and retaining talent, what  is the rank of India", "  53rd    "], "question22": ["  Name the country that has decided to re - jo in the  Commonwealth Group after a gap of 2 years", "  Maldives    "], "question23": ["  Who is the current head of the Commonwealth  Group", "  Queen   Elizabeth II   "], "question24": ["  The government launched the Grand Challenge on  the Startup India Portal for what purpose", "  To  invite innovative ideas based  on Artificial  Intelligence, Internet of Things, Big Data  Analytics, Blockchain and other cutting - edge  technology to reform Government processes   "], "question25": ["  What is the aim of launching the Grand Challenge", "  Improving the India™s ranking in ‚Ease of  Doing Business™ to  within 50, from 77 at  present   "], "question26": ["  Which Bank launched ‚Nexxt Credit Card™ which  empowers customers with a choice of payment  options such as EMI, Reward Points or Credit at  the push of a button, on the card", "  IndusInd Bank   "], "question27": ["  Who has been appointed as the new Rev enue  Secretary in the Ministry of Finance", "  Ajay  BhushanPandey   "], "question28": ["  The Ayush Ministry celebrated the India's first  Naturopathy Day on which date", "  November 18   "], "question29": ["  What is the full form of Ayush", "  Ayurveda, Yoga  and Naturopathy, Unani, Siddha, and  Homeopathy   "], "question30": ["  Suppor ted by the UNO, the World Toilet Day is  celebrated across the world on which date", "  November 19   "], "question31": ["  Out of 17 SDGs, w hich number Sustainable  Development Goal of UNO aims to ensure  availability and sustainable management of  sanitation and water for all by 2030", "   6th   "], "question32": ["  Which player became India™s highest T20 run - getter, including men and women, scoring  2,283  T20 runs", "  Mithali Raj   "], "question33": ["  The Union Ministry of Women and Child  Development proposes to use which fund to fast  track cases of rape of children and women under  POCSO", "  Nirbhaya Fund   "], "question34": ["  Nguy  nPh  ngKhánh of Vietnam won which  international beauty crown recently", "  Miss Earth  2018   "], "question35": ["  Who has been crowned the Miss International  2018", "  MariemVelazcoof Venezuela   "], "question36": ["  Oxford dictionaries selected which word as the  'Word of the Year'", "  Toxic"]}, {"page": 98, "question0": ["  Name the Barcelona star footballer who was  named La Liga Player of the Year for 6th time", "  Lionel Messi   "], "question1": ["  November 16 is celebrated as the International  Day  for ___________ all over the world", "  Tolerance    "], "question2": ["  Which national day is observed on November 16  to honour the existence of free and responsible  press in India", "  The National Press Day    "], "question3": ["  Why November 16 has been selected to celebrate  the National Press Day", "  It   was on this day in  1966 that the Press Council of India started  functioning   "], "question4": ["  Ministry of Agriculture launched the  ‚YuvaSahakar - Cooperative Enterprise Support  and Innovation Scheme™ for what purpose", "  To  attract the youth to launch cooperative  business vent ures   "], "question5": ["  HRD Ministry launched which programme for  online professional development of 15 lakh  higher education faculty", " ARPIT   "], "question6": ["  What is the full form of ARPIT", "  Annual Refresher  Programme In Teaching   "], "question7": ["  On November 14, ISRO launched its heaviest ever  satellite. Can you name it", "  GSAT - 29   "], "question8": ["  The GSAT - 29 was launched by which heavy lift  rocket", "  GSLV - Mark III   (GSAT -    Geo - synchronousSatellite)   (GSLV - Geosynchronous Satellite Launch Vehicl"], "question9": ["  "], "question10": ["  The GSAT - 29 shall be used for what purpose", "  To  facilitate high speed internet connections for  better communications with the Village  Resource Centres established by the ISRO   "], "question11": ["  Notes of a Dream   is the autobiography of which  famous celebrity", "  A.R. Rehman    "], "question12": ["  ‚ Kingdom of Ash™   is a chart buster book by which  author", "  Sarah J. Mass   "], "question13": ["  Why November 14 has been selected for  observing the world Diabetes Day", "  The day  marks the birthday of Sir Frederick Banting,  who co - discovered insulin along with Charles  Best in 1922    "], "question14": ["  Ministry of Finance has decided to release a  commemorative coin of Rs.75 to mark which  historic event", "  75th anniversary of the hoisting  of Tricolour for the first time by Netaji  Subhash Chandra Bose at Port Blair   "], "question15": ["  Which day is observed on November 12 to  commemorate the first and last visit of the  Mahatma Gandhi to the studio of All India Radio,  Delhi", "  The Public Service Broadcasting Day   "], "question16": ["  Knight of the Legion of Honour, France's highest  civilian honour was recently c onferred upon  which Indian", "  Jawahar Lal Sarin   Edited, Printed and Published by Varinder Mohan Singh Grover for Gyanm  Education and Training Institute Pvt. Ltd., SCO 13 - 14 - 15, 2 nd   Floor, Sector  34 - A, Chandigarh  Œ   160022 and printed by him at All tech Print   Pack, 182/4,  Industrial Area  Œ   I, Chandigarh   ANNUAL SUBSCRIPTION FORM   FOR SOFT COPY ONLY    ( Only  Online Mode)    TO SUBSCRIBE THE MAGAZINE    WhatsApp or SMS <MAGAZINE> TO 09646888377   SUBSCRIPTION PERIOD", " ONLY 12 MONTHS     FROM (MONTH) –––––––..TO–––––.  (MONTH)     AMOUNT", "       Name", "  Mr./Ms––––––––––––––––––.–––     Address", " –––––––––––––––––––––––. –––––––––––––––––––––––––– City", "–––––––––––District", "––––––––.     State", " ––––––..–––––––.. PIN", "     Email", " –––––––––––––––––––––––––..     Ph./Mob–––––––––––––––––––..––––      The subscription amount can be    remitted to our following account", "       –––––––––––––––––––––––––––––––––––   PARTICULARS OF REMITTANCE", "   Amount remitted", "  Rs––––        Date", "–./–./––   Bank––––––––––––..Branch–––––     Transaction   no––––––––––..     DATE", "_________                         Signature    (Magazine will be sent through Online Mode only)     GYANM", " SCO 13 - 15, 2 nd   FLOOR, SEC 34 - A, CHANDIGARH    PH", " 0172 - 4052124,  9117 - 34 34 34     Rs. 4 00/ -"]}, {"page": 99, "question0": ["  For Bank PO/Clerical, the cost of pack is  Rs.2000 / -   +  Rs. 150/ -   extra for Courier / Regd Parcel charges. "], "question1": ["  For Combo study material, the cost of pack is  Rs.  3000 / -   + Rs. 150 extra for Courier / Regd. Pa rcel  charges.    Gyanm  has more than 20 franchisees in North India. For  any new franchise please contact our Franchise Head Mr.  Amarjeet Sharma  -   9646888354. For more details visit our  website www.gyanm.in       PARTICULARS FOR ONLINE PAYMENT     a) GYANM EDUCATION   & TRAINING INSTITUTE PVT. LTD.   b) Current A/c No", "   31737210954                c) IFSC Code", "    SBIN0008701   d) STATE BANK OF INDIA, SECTOR 34 - A, CHANDIGARH.                NOTE ", "  After depositing the amount, please send us  complete details on email  gyanmvks@gmail.com   such as  Name, Mobile No., Complete Address with State, Pin code,  Amount deposited, Transaction No / UTR No. & Date.    Contact us", "   0172 - 4052124, 4192124, M - 6239363604   BANK PROMOTIONS STUDY  MATERIAL      TITLE    Price       BANKERS BRIEF ", "   C ontains topics on Banking Law,  Loan & Advances, PS Lending, Forex, Credit Mgmt,  Govt. Sponsored Schemes, Latest Banking concepts.   300      BANKING RECOLLECTED Q™S", "   C ontains previous  Recalled Q™s & Answer from  Internal  IBPS exams.    250      MOCK TEST PAPERS   BOOK ", "   C ontains 1000  Important  Multiple Choice Questions with  A nswer .     300      PRACTICE TESTS (KIT - 1)", "  Contains multiple choice  questions with answers on Banking Law.    250      PRACTICE TESTS (KIT - 2) ", "  Contains questions on  Priority Sector, NPA, Loans &   Advances, BS, Forex  BEP  & Other Banking concepts.    250      ENGLISH PRACTICE TESTS ", "   Book  contains practice  test papers for Internal & Bank entrance exams.   250      COMPUTER AWARENESS BOOKLET", "   Book contains  basic concepts of Computer Awareness ,  MCQs  and  Recollected Q™s from previous competitive exams.   200      ECONOMICS FOR BANKERS ", "   C ontains basic  concepts of  Macro & Micro, Indian Economy &  MCQs with Answers .     250      BOOK - KEEPING FOR BANKERS ", "   Book  designed for  PNB Clerical exams,  contains basic concepts  Book - keeping, BS, Ratio & Analysis,  MCQs with Answers.     250      GK AWARENESS MAGAZINE ", "   C ontains  month   wise  updates on  all exam oriented  Current Affairs   for 6  Months.      60   FREE PASSWORD   for Special Important Q™s uploaded in  our website 5 days before exam for  our regular /  correspondence members.   COST OF PACK ", " Rs. 2,150/ -   (including Courier / Speed  Post charges).      JAIIB CORRESPONDENCE MODULE   The cost of pack is  Rs. 700/ -   per subject   in which we provide  two Books for each paper which contain Descriptive, Multiple Choice  Questions, Recollected Questions & Consolidated Tests with  answers. Total cost of pack for all papers is  Rs.2,100 + Rs.150   extra for Courier / Speed Post Charges.     CAI IB CORRESPONDENCE MODULE     The cost of pack is  Rs.900/ -   per subject   for compulsory papers,  which contain two books for each subject. In optional paper, we  have Retail Banking/HRM each priced at  Rs.400/ - .   The Study material covers Descriptive, Multiple Choice   Questions,  Numericals with solution (Case studies), Recollected Questions &  Consolidated Tests with Answer.  Total Cost of pack for all papers is   Rs. 2,200+ Rs.150  extra for Courier / Speed Post Charges.     We  also conduct   classroom programme for JAIIB / CAIIB.   For Any Queries Contact", "   Mr. Vipan Sharma  -   6239363604,    9888776293, 0172 - 4192124                            "]}]