[{"page": 76, "month": "APRIL 2020", "question 0": ["  With the support of the UNO,   which day is  celebrated across the world on May 15 to  highlight the importance of families in  strengthening the social fabric all over the  world", "    International Family Day  "], "question 1": ["  What is the theme of this year™s International  Family Day", "    Families in Developmen t  "], "question 2": ["  Which union ministry promotes the celebration  of the National Dengue Day", "    Ministry of  Health and Family Welfare  "], "question 3": ["  Who is the present   Minister of Health and  Family Welfare in India", "   Dr Harsh Vardhan  "], "question 4": ["  Dengue is a viral disease, transmitted by the  infectiv e bite of which mosquito", "   Aedes  Aegypti  "], "question 5": ["  The government plans to launch a 20,000 crore  rupees scheme for the development of marine  and inland fisheries. What is its  name", "   Pradhan Mantri Matsya Sampada  Yojana  "], "question 6": ["  Celebrations of the   International   Day of Living   Together in Peace are supported by which  international organisation", "    United Nations  "], "question 7": ["  The   International   Day of Living Together in  Peace is observed in May on which day", "    16 th  "], "question 8": ["  The government plans to launch a 20,000 crore  rupees scheme for the development   of marine  and inland fisheries.   What is its  name", "    Pradhan Mantri Matsya Sampada  Yojanaﬂ   (Prime Minister Fisheries Wealth  Scheme)   APRIL 2020  "], "question 9": ["  Name the oldest Grand Slam tennis tournament  that has been scrapped for the first time since  World War II due to havoc of Corona.   Wimbledon, London  "], "question 10": ["  The Union cabinet has approved a _____ percent  cut in the salaries of the Members   of Parliament  for one ye ar wef April 1 this year.   30%  "], "question 11": ["  The Union cabinet has decided to  suspend  MPLADS funds for two years from 2020 - 21 to  2022.     What is the full form of MPLADS", "   Member of Parliament Local Area  Development Scheme  "], "question 12": ["  Every MP gets how much funds every year  under t he MPLADS", "   Rs 5 crore  "], "question 13": ["  The Central Board of Secondary Education  (CBSE) has decided to introduce three new  subjects for class 11 from 2020 - 21 academic  session. Name these subjects.  Design  Thinking, Physical Activity Trainer and  Artificial Intelligence  "], "question 14": ["  Which global agency has approved a fast - track  $1 billion support for ﬁIndia Covid Emergency  Response and Health Systems Preparedness  Projectﬂ", "   The World Bank  "], "question 15": ["  The Great Barrier Reef, the world™s largest coral  reef system has suffered its worst mass coral  bleaching in recent years. Where is it located", "   In the sea around northeast Australia   "], "question 16": ["  Name the FIFA event that was to be held in  India in November this year, which has been   postponed by FIFA due to the worsening  COVID - 19 pandemic across the globe.   The  F IFA Under - 17 Women™s World Cup   "], "question 17": ["  The New Delhi _________ World Cup , which had  already been postponed from March to May,  has now been cancelled due to the Covid - 19  pandemic.   Shooting   "], "question 18": ["  The Central Government has approved a  double - digit hike in the wages of manual  labourers under MNREGA. The letter G stands  for what", "  Guarantee    "], "question 19": ["  The World Health Day is celebrated around the  globe on which date", "   April 07   "], "question 20": ["  What is the name of the main mobi le app  launched for tracking and fighting COVID - 19,  launched by the Central Government", "   ‚Aarogya Setu™   "], "question 21": ["  Name the British cricketer who co - invented the  Duckworth - Lewis Method, who died on April 1  at the age of   78.    Tony Lewis   "], "question 22": ["  Who has been appointed the new Chairman of  the National Association of Software and  Services Companies (Nasscom)", "   Pravin Rao   "], "question 23": ["  The  World Homoeopathy Day   is observed on  which date", "  April 10   "], "question 24": ["  Who is known as the father of the   Homoeopathic system of medicines ", "    Dr"]}, {"page": 77, "month": "APRIL 2020", "question 0": ["  India celebrates   National Safe Motherhood Day  on April 11. This day also commemorates the  birth day of which great Indian lady social  worker", "   Kasturba Gandhi   "], "question 1": ["  Which organisation supports the celebration of  the  National Safe Moth erhood Day", "   White  Ribbon Alliance India   "], "question 2": ["  Indian football team retained its ______ spot in  the latest FIFA rankings.   108 th   "], "question 3": ["  Which ministry launched Bharat Padhe Online  campaign on April 11 to crowdsource ideas for  improving the online education ecosystem of  India", "    The Union Ministry of Human  Resources Development   "], "question 4": ["  These days we hear a lot about providing PPEs  to doctors and m edical staff. What is full form  of PPE", "    Personal Protection Equipment   "], "question 5": ["  Which funding agency has   has assured $2.2  billion (about Rs 16,500 crore) support to India  in its fight against the Covid - 19 pandemic", "   The  Asian Development Bank   "], "question 6": ["  Name the England™s a ll - rounder who has been  named the leading cricketer in the world     2020  by Wisden.   Ben Stokes   "], "question 7": ["  Which national day is celebrated to  commemorate the sailing of first Indian ship  from Mumbai to London", "    National Maritime  Day, April 5   "], "question 8": ["  Which global day is  observed on April 2 to   highlight the need to improve the quality of life  of those suffering with Autism", "   World Autism  Awareness Day   "], "question 9": ["  The Indian Air Force conducted ‚Operation  Sanjeevani™ to air - lift 6.2 tonnes of essential  medical supplies to which countr y", "   Maldives   "], "question 10": ["  The Olympic Council of Asia unveiled the  official mascots of the 19th Asian Games - 2022.  Which city will host these games", "   Hangzhou,  China   "], "question 11": ["  Name the three animated robots selected as the  mascots for the 19th Asian Games - 2022", "   Congcong,  Lianlian and Chenchen   "], "question 12": ["  What is the single name given to the three  mascots of 19th Asian Games - 2022", "    The  Smart Triplets   "], "question 13": ["  Who is the Chief of the Indian Air Force", "   Air  Chief   Marshal Rakesh Kumar Singh  Bhadauria   "], "question 14": ["  In which state Baisakhi is celebrated as  Naba  Barsha", "    West Bengal   "], "question 15": ["  Vishu is a famous festival of which state", "    Kerala   "], "question 16": ["  In Tamil Nadu festival of Baisakhi is celebrated  by which name", "   Puthandu   "], "question 17": ["  Which country has approved the sale of  Harpoon Block II air launched missiles and  lightweight torpedoes worth $155 million to  India.   USA   "], "question 18": ["  What kind of weapon is a Torpedo", "    A guided  missile usually fired from a submarine   "], "question 19": ["  M S Mahabaleshwara has been   re - ap pointed as  the   MD and CEO of which private sector", "   Karnataka Bank   "], "question 20": ["  World Art Day is celebrated with support from  UNESCO on which day of April", "    15 th   "], "question 21": ["  Which country has decided to stop funding for  the World Health Organization (WHO),  accusing it of grossly mismanaging and  covering - up the spread of the novel  coronavirus", "   USA   "], "question 22": ["  Reserve Bank of India on April 17 announced  several regulatory measures aimed a t boosting  liquidity in the market. It slashed which policy  rate by 25 basis points", "   Reverse Repo Rate   "], "question 23": ["  RBI announced a booster package of 50,000  crore rupees for supporting which sector of  economy to recover from the lockdown", "  Small  and Medium - sized indu stries    "], "question 24": ["  The RBI Governor declared that the period of  resolution plan for NPAs will be extended by  ____ days", "   90   "], "question 25": ["  An Integrated Geospatial Platform named  _________has been rolled out by the Deptt. of  Science and Technology, Govt. of India, to help  in deci sion making during the present COVID - 19 outbreak.    SAHYOG   "], "question 26": ["  The WWF (World Wide Fund) India has  appointed veteran world chess champion  ___________ as its ambassador for the  environmental education program.   Viswanathan Anand"]}, {"page": 78, "month": "APRIL 2020", "question 0": ["  World Hemophilia Day is observ ed on April 17  across the world. Hemophilia is related to  which ailment", "  B leeding disorders   "], "question 1": ["  Fei Fei the bird has been unveiled as the mascot  for which Asian Para Games", "   Hangzhou  (China) 2022 Asian Para Games   "], "question 2": ["  World Heritage Day is observed on which date", "   April 18     "], "question 3": ["  What is the name of the mobile app launched to  facilitate transportation of food grains and  perishables like fruits and vegetables, during  lockdown", "   Kissan Rath   "], "question 4": ["  Which Indian two wheeler company ha s  acquired   the United Kingdom™s most iconic  sporting motorcycle brand ‚Norton™", "   TVS  Motors   "], "question 5": ["  Name the world's most famous cycling race,  held every year in France, which has been  postponed in the wake of the Coronavirus  pandemic.   Tour de France   "], "question 6": ["  April 19 i s celebrated around the world to  promote awareness about one of the most  complex organ in the body. Can you name it", "    Liver   "], "question 7": ["  Which great Indian statesman termed civil  servants as the ‚steel frame of India™", "    Sardar  Vallabhbhai Patel   "], "question 8": ["  Which International da y is observed on April  22 to create awareness about pollution and to  celebrate the environment of our planet", "   The  Earth Day   "], "question 9": ["  Social media and tech giant Facebook invested  Rs 43,574 crore for securing a 9.99 per cent  stake in which Indian company", "    Jio  Platforms   "], "question 10": ["  ______________ became the first state on April 19  to geo - tag community kitchens being run in the  state.   Uttar Pradesh   "], "question 11": ["  Name the creator of most popular animation  characters Tom and Jerry, Popeye the Sailor,  who passed away at the age of 95 at his  residence in Prague, Czechoslovakia.   Gene  Deitch   "], "question 12": ["  Kapil Dev Tripathi has been a ppointed as the  new Secretary to which apex auth ority", "   President of India   "], "question 13": ["  Which bank has rolled out a new feature of  voice banking services on Amazon Alexa and  Google Assistant for its customers", "   ICICI Bank   "], "question 14": ["  HRD Ministry launched the national program  named _________ for inviting e - learning content  co ntributions for both school and higher  education.   VidyaDaan 2.0   "], "question 15": ["  April 23 is observed globally every year as  English Language Day to mark the birthday and  date of death of which legendary writer", "    William Shakespeare   "], "question 16": ["  The UNESCO has selected which city as the  World Book Capital for 2020.   Kuala Lumpur,  Malaysia   "], "question 17": ["  National Panchayati Raj Day is celebrated on  which date", "   April 24   "], "question 18": ["  Which amendment of Indian Constitution  introduced the Panchayati Raj Act in 1993", "   73 rd   amendment   "], "question 19": ["  The Prime Minister launched which two major  schemes for rural areas on April 24", "  e - Gram  Swaraj Portal and Swamitva   "], "question 20": ["  The World Bank   has approved $82 million for  the State Roads Transformation Project of  which state for upgradation of major roads and  modernization of the Public Works Department  in the state", "   Himachal Pradesh   "], "question 21": ["  Name the eminent theatre personality who  died at her residen ce in south Kolkata on April  23, at the age of 75.   Usha Ganguly   "], "question 22": ["  The Global Press Freedom Index has ranked  India at which spot", "   142 nd   "], "question 23": ["  Which country topped the the Global Press  Freedom Index", "   Norway   "], "question 24": ["  Which institution has claimed to have  developed a pot ential COVID - 19 vaccine, the  first human trials of which began on April 23,  2020", "   Oxford University, London   "], "question 25": ["  Who has been appointed as the new Chief  Vigilance Commissioner of India", "      Sanjay  Kothari   "], "question 26": ["  Which international day is celebrated on April  25 to  raise awareness about a globally present  disease", "    World Malaria Day   "], "question 27": ["  Malaria is a life - threatening disease which is  caused by ________ Parasites.   Plasmodium   "], "question 28": ["  The Plasmodium parasite is spread by whic"]}]