[{"page": 79, "month": "MARCH 2020", "question 0": ["  What is the them e for this year™s World Malaria  Day", "   Zero malaria starts with me   "], "question 1": ["  Government has declared banking industry as a  public utility service for six months till October  21 under the provisions of which Act", "  Industrial Disputes Act, 1947   "], "question 2": ["  __________ has become the first state to have the  requisite infrastructure in all its courts for  hearing cases through video conferencing.   Uttar Pradesh   "], "question 3": ["  Which country successfully launched its first - ever military satellite named ﬁNoorﬂ into orbit", "   Iran   "], "question 4": ["  According to a Swedish research institute,  Stockholm International Peace Research  Institute (SIPRI), India is the ____ biggest  spender on military hardware.   Third   "], "question 5": ["  As per SIPRI report, ___________ is the biggest  spender of military expenditure.   USA   "], "question 6": ["  Which country has declared an end to the death  penalty for crimes committed by minors", "   Saudi Arabia   "], "question 7": ["  The Reserve Bank announced on April 27 a  Special Liquidity Facility of Rs 50,000 crore for  which sector of economy", "   Mutual funds   "], "question 8": ["  World Day for Safety an d Health at Work is  observed on which day", "   April 28   "], "question 9": ["  Which UN agency supports the celebrations of  the World Day for Safety and Health at Work", "   International Labour Organization (ILO)   "], "question 10": ["  The BRICS Ministers of Foreign Affairs summit  was held through a video   conference on April  28, 2020.  It was hosted by which country", "   Russia   "], "question 11": ["  What is the full form of the UN special agency  WIPO", "   World Intellectual Property Office,  Geneva   "], "question 12": ["  What is the theme of this year™s  World  Intellectual Property Day", "   Innovate for a  Green Future   "], "question 13": ["  Who has been appointed as the next  Ambassador / Permanent Representative of  India to the United Nations", "   T S Tirumurti   "], "question 14": ["  The International Dance Day is celebrated on  which day of April", "   29 th   "], "question 15": ["  The 11th session of Petersburg Climate  Dialogue with 30 countries including India was  hosted by which country", "   Germany   "], "question 16": ["  Who represented India at the 11th session of  Petersburg Climate Dialogue", "   Prakash  Javadekar, the Union Minister for  Environment, Fores t and Climate Change   "], "question 17": ["  Name the veteran Bollywood actor who passed  away on Apri 30, losing his battle against  Leukemia.   Rishi Kapoor     MARCH 2020   "], "question 18": ["  The Central government approved Rs 1,340  crore recapitalisation plan to help which type  of banks", "  Regional  Rural Banks (RRBs)   "], "question 19": ["  Govt has planned recapitalization of RRBs to  meet the CRAR requirements. What is full form  of CRAR", "  Capital to Risk weighted Assets  Ratio   "], "question 20": ["  What is the percentage of stake of the  sponsoring bank in the capital of the RRB", "   35%   "], "question 21": ["  What is the percentage of stake of the central  government in the capital of the RRB", "  50%   "], "question 22": ["  Rajyogini Dadi Janki, who passed away  recently,   was the spiritual head of which world  famous spiritual organisation", "  Brahma  Kumaris Sansthan   "], "question 23": ["  The World Theatre Day is   observed on which  day of March", "   23 rd   "], "question 24": ["  Which US defence force   deployed its Advanced  Extremely High Frequency (AEHF) satellite to  provide secure communications for the US  military and its allies", "   US Space Force   "], "question 25": ["  Government announced the ‚Garib Kalyan  Packa ge™ for helping the poor people amidst the  Corona crisis.  What is its amount", "   Rs. 1.70  lakh crore   "], "question 26": ["  Under which new government scheme 80 crore  poor people will be given 5 kg Wheat or 5  kg   Rice and one kg pulse for 3 months", "   Pradhan Mantri Garib Kalyan An na Yojana   "], "question 27": ["    Government has announced Rs.____ lakh per  person insurance cover for all employees  working in the medical field for next three  months.   50   "], "question 28": ["  Indian scientists have developed ‚MACS 4028™,  a biofortified high - protein variety of whic"]}, {"page": 80, "month": "MARCH 2020", "question 0": ["  Which country hosted the firstever G - 20 virtual  summit through video conference", "   Saudi  Arabia   "], "question 1": ["  Name the doe - eyed star of 1950s and ‚60s  Hindi movies such as  Aan, Barsaat and Deedar,   who died recently after prolonged illness.   Nimmi   "], "question 2": ["  Name the artist and ar chitect renowned for his  versatility across different mediums, who  passed away recently in New Delhi.   Satish  Gujral   "], "question 3": ["  Which global rating agency slashed its estimate  of India's GDP growth during the 2020 calendar  year to 2.5 per cent, from an earlier estimate of  5.3 per cent", "   Moody's Investors Service    "], "question 4": ["  The Monetary Policy Committee of RBI headed  by its Governor Shaktika nta Das announced on  March 27 a cut in benchmark interest rate,  Repo Rate by _____ basis points to 4.40 per cent.   75   "], "question 5": ["  RBI   reduced the Cash Reserve Ratio (CRR) of all  banks by ______ basis points to 3 per cent with  effect from March 28 for 1 year.   100   "], "question 6": ["  Wh at is the new reverse repo rate under the  LAF after a reduction of 90 basis points", "   4%   "], "question 7": ["  Which oil company has become the 1st Indian  company to begin supply of BS - VI fuel across its  28,000 petrol pumps", "   Indian Oil Corporation  Ltd.   "], "question 8": ["  The Reserve Bank of Ind ia has decided to  extend the _________  _______ classification for  bank loans to Non - Banking Financial  Companies (NBFCs) for on - lending, for FY  2020 - 21.   Priority sector   "], "question 9": ["  Which State Police has become the first to be  equipped with taser guns as a part of t heir  modernization drive to ensure public safety  and security", "   Gujarat   "], "question 10": ["  Which gas is used in the Taser guns to fire the  darts", "    Compressed Nitrogen   "], "question 11": ["  Famous ‚Abel Prize™ is given for outstanding  achievement in which field", "    Mathematics   "], "question 12": ["  Government of which   country has instituted  the Abel Prize", "    Norway   "], "question 13": ["  Japan's Prime Minister and the head of the  International Olympic Committee, Shinzo Abe  announced to postpone the Tokyo 2020 Games  by how many months", "   12   "], "question 14": ["  In the 124 - year old history of the Olympics, the  games have been cancelled how many times", "   Three   "], "question 15": ["  World Tuberculosis Day is observed on which  day of March", "   24   "], "question 16": ["  World Tuberculosis Day is observed with the  support of which UN organisation", "  WHO  Œ   World Healt h Organisation   "], "question 17": ["  What is the theme for this year™s   World  Tuberculosis Day", "  It™s Time   "], "question 18": ["  Name the scientist who discovered the  Tuberculosis causing bacteria", "    Dr. Robert  Koch      "], "question 19": ["  Name the Indian mountaineer who entered  ‚Limca Book of Records™ for his extraordi nary  achievement of becoming the first Indian to  climb the highest volcanoes of each of the 7  continents.   Satyarup Siddhanta   "], "question 20": ["  Who took the oath of Chief Minister for the  fourth time in Madhya Pradesh", "    Shivraj Singh  Chouhan   "], "question 21": ["  M arch 23 is celebrated as  Shaheed Diwas   every  year to pay tribute to which three martyrs", "  Bhagat Singh, Sukhdev Thapar, and  Shivaram Rajguru   "], "question 22": ["  World Meteorological Day is observed on  March 23 to highlight which important issue", "   Climate related issues   "], "question 23": ["  What is the theme for this yea r™s World Water  Day", "    Water and climate change   "], "question 24": ["  On which day of March we celebrate  World  Water Day", "   March 22   "], "question 25": ["  For what purpose Small Industries  Development Bank of India (SIDBI) plans to  start Swavalamban Express on June 05, 2020", "   To promote budding busi ness aspirants and  entrepreneurs   "], "question 26": ["  Where are the headquarters of   Small Industries  Development Bank of India (SIDBI)", "   Lucknow   "], "question 27": ["  Who is the current Charman & Managing  Director of SIDBI", "   Mohmmad Mustafa   "], "question 28": ["  When do we celebrate  the International Day for  the Elimination of Racial Discrimination", ""]}, {"page": 81, "month": "MARCH 2020", "question 0": ["  What is the theme for this year™s World Down  Syndrome Day observed on March 21", "    We  Decide     "], "question 1": ["  On which date we observe World Poetry Day", "   March 21   "], "question 2": ["  Which international day is observed every year  to raise awareness about the importance of the  household sparrow and the other common  birds to urban environments, and the threats to  their populations", "  The World Sparrow Day     "], "question 3": ["  As per the World Happiness Repor t 2020  released by the United Nations, India stands at  which rank in world", "   144 th   "], "question 4": ["  Which country topped the rankings given by  the   World Happiness Report 2020", "   Finland   "], "question 5": ["  Name the legendary Indian footballer who died  in Kolkata after battling prolonged illness.  P K  Banerjee   "], "question 6": ["  The Defence Ministry signed a capital  acquisition contract with which country for  procurement of 16,479 Negev 7.62x51 mm  light machine guns (LMGs)", "   Is rael   "], "question 7": ["  A bench of NCLAT has been established in  Chennai to cater to the needs of south based  clients. Expand the term NCLAT.   National  Company Law Appellate Tribunal   "], "question 8": ["  OFB  - Ordnance Factory Board, th e 2nd largest  defence equipment manufacturer in Asia, has  its headquarters in which city", "   Kolkata   "], "question 9": ["  What is the name of the OFB HQs in Kolkata", "    Aayudh Bhawan   "], "question 10": ["  The Chameli Devi Award is conferred upon  women for showing excellence in which field", "   Journalism   "], "question 11": ["  A roll - on - roll off cum passenger ferry service,  was recently launched between Mumbai and  which other city", "    Mandwa   "], "question 12": ["  Which apex authority recently ruled that  women cannot be denied permanent  commission in the Navy", "   Supreme Court   "], "question 13": ["  A tiny island country i n the South Pacific Ocean  has become the world™s first whole country to  be recognised as a ‚Dark Sky Place™. Name it.   Nieu   "], "question 14": ["  Who has been appointed as the new MD and  CEO of the Yes Bank", "   Prashant Kumar   "], "question 15": ["  Which national day is observed celebrate  delivery of   the first dose of Oral Polio Vaccine  in India on March 16, 1995", "  National  Vaccination Day   "], "question 16": ["  Name the former Chief Justice of India who has  recently been nominated to Rajya Sabha.    Justice Ranjan Gogoi   "], "question 17": ["  The Central Sanskrit University Bill 2019 was  passed recently by the Parliament to provide  Central University status to how many  universities in India.   Three   "], "question 18": ["  Name the ace Indian paddler   who  ended his  decade - long wait for a title by winning the ITTF  Chall enger Plus Oman Open (Table Tennis) in  Muscat, Oman.     Achanta Sharath Kamal   "], "question 19": ["  Noted  philanthropist and IT magnate, Bill Gates  was in news recently for what reason", "   He  stepped down from Microsoft™s Board of  Directors.   "], "question 20": ["  Muhyiddin Yassin has been appointed as the  Prime Minister of which country", "   Malaysia   "], "question 21": ["  The First Khelo India University Games were  hosted by which state", "  Odisha   "], "question 22": ["  Indian Railways launched its first ﬁRestaurant  on Wheelsﬂ at which railway station", "   Asansol,  West Bengal.   "], "question 23": ["  On which date we celebrate Zero  Discrimination Day", "   March 1   "], "question 24": ["  What is the name of the welfare programme  launched to provide good nutritional food tp  pregnant mothers", "    Suposhit Maa Abhiyaan   "], "question 25": ["  The United States recently signed a historic  peace  agreement with which big militant  group", "   Taliban   "], "question 26": ["  Which militant outfit is formally known as the  Islamic Emirate of Afghanistan", "   Taliban   "], "question 27": ["  DRDO in collaboration with Indian Institute of  Science, Bengaluru has developed a new  explosive detection device  RaIDer - X for what  purpose", "    To detect explosives from a  distance   "], "question 28": ["  Which International day is observed on March  3 for raising awareness about flora and fauna  and the dependability of humans on their  surroundings and the environment", "   Worl"]}, {"page": 82, "month": "MARCH 2020", "question 0": ["  The Government of India has declared the  National Chambal Sanctuary an eco - sensitive  zone. It lies in which state", "   Madhya Pradesh   "], "question 1": ["  Dr. Ajay Bhushan Pandey has been given charge  of which important office in the Finance  Ministry", "   Finance Secretary   "], "question 2": ["    Which  are the two places nominated by the  government for inclusion in the World Heritage  List 2020, maintained by UNESCO", "   Dholvira  and Forts and Monuments of Deccan  Sultanate   "], "question 3": ["  Dholavira, an ancient site of  Indus Valley  Civilization is located in which state", "   Gujarat   "], "question 4": ["  India bagged a $ 40 million deal to supply 4  indigenously built radars (capable of locating  weapons) to which European country", "   Armenia   "], "question 5": ["  Assembly of which state went paperless on  March 2 with the implementation of National e - Vidhan Application (N eVA)", "   Arunachal  Pradesh   "], "question 6": ["  Which union ministry is responsible for  implementation of   National   e - Vidhan  Application", "   Ministry of Parliamentary  Affairs   "], "question 7": ["  Who is the Minister of Parliamentary Affairs", "   Pralhad Joshi   "], "question 8": ["  What is the name of the scheme that aims to   r eplace all level crossings on National  Highways with road over bridges or under  bridges", "   Setu Bhartam   "], "question 9": ["  Name the former UN chief, who led the world  body during the Iran - Iraq war and the civil war  in El Salvador, who died recently.   Javier Perez  de Cuella r   "], "question 10": ["  India observes  National Safety Day on which  date", "   March 4   "], "question 11": ["  Which hilly state of India has declared to shift  its summer capital to Gairsain", "   Uttarakhand   "], "question 12": ["  On March 1, we celebrate World _____  ______ Day  to highlight the importance of civil protection.    Civil Defence   "], "question 13": ["  What was the theme for this year™s World Civil  Defence Day", "   Children™s safety, our  responsibility   "], "question 14": ["  India celebrates Jan Aushadhi Diwas on which  day of March", "  7 th   "], "question 15": ["  International Women's Day is observed on  which date", "   March 8   "], "question 16": ["  Dhruv Batra Player of the Year Award is given  for outstanding performance in which field", "   Hockey   "], "question 17": ["  Who won this year™s  Dhruv Batra Player of the  Year Award for men", "   Manpreet Singh   "], "question 18": ["  Who won this year™s Dhruv Batra Player of the  Year Award for women", "   Rani  Rampal   "], "question 19": ["  Denys Shmygal was elected as the new _________  of Ukraine.   Prime Minister   "], "question 20": ["  Which country won the ICC Women™s T20  World Cup 2020", "   Australia   "], "question 21": ["  Finals of the  ICC Women™s T20 World Cup 2020  were held in which city", "   Melbourne,  Australia   "], "question 22": ["    Securities a nd Exchange Board of India (SEBI)  has launched a mobile application ‚Sebi  SCORES™ for what purpose", "   To facilitate  online filing of investors grievances through  their smartphones.   "], "question 23": ["  What is the full form of the acronym SCORES", "   Sebi Complaints Redress Syste m   "], "question 24": ["  Name the RBI Deputy Governor who  announced his resignation due to health  problems", "     N S Vishwanathan   "], "question 25": ["  ﬁChapchar Kutﬂ is the most joyful and biggest  spring festival of which Indian state", "   Mizoram   "], "question 26": ["    Which state government has asked the temple  administrators in     the state to obtain a ‚BHOG™  certificate from FSSAI (Food Safety and  Standards Authority of India) for the ‚prasad™  distributed by them", "   Tamil Nadu   "], "question 27": ["  What is the name of the Mizoram™s  popular  bamboo folk dance", "   Cheraw   "], "question 28": ["    NASA has named its Mars rover as__________ for  the Mars mission scheduled for July 2020", "   Perseverance   "], "question 29": ["  Which great Indian king was named as the  'greatest leader ever' in the world in a survey  conducted by BBC World History Magazine", "   Maharaja Ranjit Singh   "], "question 30": ["  Pritzker Prize is given for outstanding  achievement in which field", "   Architecture"]}]